[
    {
        "AwchStdEvent": "BW_MIS_PWED",
        "PubwicDescwiption": "Counts bwanches which awe specuwativewy executed and mispwedicted."
    },
    {
        "AwchStdEvent": "BW_PWED",
        "PubwicDescwiption": "Counts bwanches specuwativewy executed and wewe pwedicted wight."
    },
    {
        "AwchStdEvent": "INST_SPEC",
        "PubwicDescwiption": "Counts opewations that have been specuwativewy executed."
    },
    {
        "AwchStdEvent": "OP_SPEC",
        "PubwicDescwiption": "Counts micwo-opewations specuwativewy executed. This is the count of the numbew of micwo-opewations dispatched in a cycwe."
    },
    {
        "AwchStdEvent": "UNAWIGNED_WD_SPEC",
        "PubwicDescwiption": "Counts unawigned memowy wead opewations issued by the CPU. This event counts unawigned accesses (as defined by the actuaw instwuction), even if they awe subsequentwy issued as muwtipwe awigned accesses. The event does not count pwewoad opewations (PWD, PWI)."
    },
    {
        "AwchStdEvent": "UNAWIGNED_ST_SPEC",
        "PubwicDescwiption": "Counts unawigned memowy wwite opewations issued by the CPU. This event counts unawigned accesses (as defined by the actuaw instwuction), even if they awe subsequentwy issued as muwtipwe awigned accesses."
    },
    {
        "AwchStdEvent": "UNAWIGNED_WDST_SPEC",
        "PubwicDescwiption": "Counts unawigned memowy opewations issued by the CPU. This event counts unawigned accesses (as defined by the actuaw instwuction), even if they awe subsequentwy issued as muwtipwe awigned accesses."
    },
    {
        "AwchStdEvent": "WDWEX_SPEC",
        "PubwicDescwiption": "Counts Woad-Excwusive opewations that have been specuwativewy executed. Eg: WDWEX, WDX"
    },
    {
        "AwchStdEvent": "STWEX_PASS_SPEC",
        "PubwicDescwiption": "Counts stowe-excwusive opewations that have been specuwativewy executed and have successfuwwy compweted the stowe opewation."
    },
    {
        "AwchStdEvent": "STWEX_FAIW_SPEC",
        "PubwicDescwiption": "Counts stowe-excwusive opewations that have been specuwativewy executed and have not successfuwwy compweted the stowe opewation."
    },
    {
        "AwchStdEvent": "STWEX_SPEC",
        "PubwicDescwiption": "Counts stowe-excwusive opewations that have been specuwativewy executed."
    },
    {
        "AwchStdEvent": "WD_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed woad opewations incwuding Singwe Instwuction Muwtipwe Data (SIMD) woad opewations."
    },
    {
        "AwchStdEvent": "ST_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed stowe opewations incwuding Singwe Instwuction Muwtipwe Data (SIMD) stowe opewations."
    },
    {
        "AwchStdEvent": "DP_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed wogicaw ow awithmetic instwuctions such as MOV/MVN opewations."
    },
    {
        "AwchStdEvent": "ASE_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed Advanced SIMD opewations excwuding woad, stowe and move micwo-opewations that move data to ow fwom SIMD (vectow) wegistews."
    },
    {
        "AwchStdEvent": "VFP_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed fwoating point opewations. This event does not count opewations that move data to ow fwom fwoating point (vectow) wegistews."
    },
    {
        "AwchStdEvent": "PC_WWITE_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed opewations which cause softwawe changes of the PC. Those opewations incwude aww taken bwanch opewations."
    },
    {
        "AwchStdEvent": "CWYPTO_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed cwyptogwaphic opewations except fow PMUWW and VMUWW opewations."
    },
    {
        "AwchStdEvent": "BW_IMMED_SPEC",
        "PubwicDescwiption": "Counts immediate bwanch opewations which awe specuwativewy executed."
    },
    {
        "AwchStdEvent": "BW_WETUWN_SPEC",
        "PubwicDescwiption": "Counts pwoceduwe wetuwn opewations (WET) which awe specuwativewy executed."
    },
    {
        "AwchStdEvent": "BW_INDIWECT_SPEC",
        "PubwicDescwiption": "Counts indiwect bwanch opewations incwuding pwoceduwe wetuwns, which awe specuwativewy executed. This incwudes opewations that fowce a softwawe change of the PC, othew than exception-genewating opewations.  Eg: BW Xn, WET"
    },
    {
        "AwchStdEvent": "ISB_SPEC",
        "PubwicDescwiption": "Counts ISB opewations that awe executed."
    },
    {
        "AwchStdEvent": "DSB_SPEC",
        "PubwicDescwiption": "Counts DSB opewations that awe specuwativewy issued to Woad/Stowe unit in the CPU."
    },
    {
        "AwchStdEvent": "DMB_SPEC",
        "PubwicDescwiption": "Counts DMB opewations that awe specuwativewy issued to the Woad/Stowe unit in the CPU. This event does not count impwied bawwiews fwom woad acquiwe/stowe wewease opewations."
    },
    {
        "AwchStdEvent": "WC_WD_SPEC",
        "PubwicDescwiption": "Counts any woad acquiwe opewations that awe specuwativewy executed. Eg: WDAW, WDAWH, WDAWB"
    },
    {
        "AwchStdEvent": "WC_ST_SPEC",
        "PubwicDescwiption": "Counts any stowe wewease opewations that awe specuwativewy executed. Eg: STWW, STWWH, STWWB'"
    },
    {
        "AwchStdEvent": "ASE_INST_SPEC",
        "PubwicDescwiption": "Counts specuwativewy executed Advanced SIMD opewations."
    }
]
