[
    {
        "BwiefDescwiption": "Counts the totaw numbew of BACWEAWS due to aww bwanch types incwuding conditionaw and unconditionaw jumps, wetuwns, and indiwect bwanches.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.ANY",
        "PubwicDescwiption": "Counts the totaw numbew of BACWEAWS, which occuw when the Bwanch Tawget Buffew (BTB) pwediction ow wack theweof, was cowwected by a watew bwanch pwedictow in the fwontend.  Incwudes BACWEAWS due to aww bwanch types incwuding conditionaw and unconditionaw jumps, wetuwns, and indiwect bwanches.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of BACWEAWS due to a conditionaw jump.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.COND",
        "SampweAftewVawue": "200003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Counts the numbew of BACWEAWS due to an indiwect bwanch.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.INDIWECT",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of BACWEAWS due to a wetuwn bwanch.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.WETUWN",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Counts the numbew of BACWEAWS due to a diwect, unconditionaw jump.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.UNCOND",
        "SampweAftewVawue": "200003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Counts the numbew of times a decode westwiction weduces the decode thwoughput due to wwong instwuction wength pwediction.",
        "EventCode": "0xe9",
        "EventName": "DECODE_WESTWICTION.PWEDECODE_WWONG",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of wequests to the instwuction cache fow one ow mowe bytes of a cache wine.",
        "EventCode": "0x80",
        "EventName": "ICACHE.ACCESSES",
        "PubwicDescwiption": "Counts the totaw numbew of wequests to the instwuction cache.  The event onwy counts new cache wine accesses, so that muwtipwe back to back fetches to the exact same cache wine ow byte chunk count as one.  Specificawwy, the event counts when accesses fwom sequentiaw code cwosses the cache wine boundawy, ow when a bwanch tawget is moved to a new wine ow to a non-sequentiaw byte chunk of the same wine.",
        "SampweAftewVawue": "200003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Counts the numbew of instwuction cache hits.",
        "EventCode": "0x80",
        "EventName": "ICACHE.HIT",
        "PubwicDescwiption": "Counts the numbew of wequests that hit in the instwuction cache.  The event onwy counts new cache wine accesses, so that muwtipwe back to back fetches to the exact same cache wine and byte chunk count as one.  Specificawwy, the event counts when accesses fwom sequentiaw code cwosses the cache wine boundawy, ow when a bwanch tawget is moved to a new wine ow to a non-sequentiaw byte chunk of the same wine.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of instwuction cache misses.",
        "EventCode": "0x80",
        "EventName": "ICACHE.MISSES",
        "PubwicDescwiption": "Counts the numbew of missed wequests to the instwuction cache.  The event onwy counts new cache wine accesses, so that muwtipwe back to back fetches to the exact same cache wine and byte chunk count as one.  Specificawwy, the event counts when accesses fwom sequentiaw code cwosses the cache wine boundawy, ow when a bwanch tawget is moved to a new wine ow to a non-sequentiaw byte chunk of the same wine.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    }
]
