[
    {
        "BwiefDescwiption": "BACWEAWs assewted fow any bwanch type",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.AWW",
        "PubwicDescwiption": "Counts the numbew of times a BACWEAW is signawed fow any weason, incwuding, but not wimited to indiwect bwanch/caww,  Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanch, unconditionaw bwanch/caww, and wetuwns.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "BACWEAWs assewted fow conditionaw bwanch",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.COND",
        "PubwicDescwiption": "Counts BACWEAWS on Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanches.",
        "SampweAftewVawue": "200003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "BACWEAWs assewted fow wetuwn bwanch",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.WETUWN",
        "PubwicDescwiption": "Counts BACWEAWS on wetuwn instwuctions.",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Decode westwictions due to pwedicting wwong instwuction wength",
        "EventCode": "0xE9",
        "EventName": "DECODE_WESTWICTION.PWEDECODE_WWONG",
        "PubwicDescwiption": "Counts the numbew of times the pwediction (fwom the pwedecode cache) fow instwuction wength is incowwect.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Wefewences pew ICache wine. This event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe",
        "EventCode": "0x80",
        "EventName": "ICACHE.ACCESSES",
        "PubwicDescwiption": "Counts wequests to the Instwuction Cache (ICache) fow one ow mowe bytes in an ICache Wine.  The event stwives to count on a cache wine basis, so that muwtipwe fetches to a singwe cache wine count as one ICACHE.ACCESS.  Specificawwy, the event counts when accesses fwom stwaight wine code cwosses the cache wine boundawy, ow when a bwanch tawget is to a new wine.\w\nThis event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Wefewences pew ICache wine that awe avaiwabwe in the ICache (hit). This event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe",
        "EventCode": "0x80",
        "EventName": "ICACHE.HIT",
        "PubwicDescwiption": "Counts wequests to the Instwuction Cache (ICache) fow one ow mowe bytes in an ICache Wine and that cache wine is in the ICache (hit).  The event stwives to count on a cache wine basis, so that muwtipwe accesses which hit in a singwe cache wine count as one ICACHE.HIT.  Specificawwy, the event counts when stwaight wine code cwosses the cache wine boundawy, ow when a bwanch tawget is to a new wine, and that cache wine is in the ICache. This event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Wefewences pew ICache wine that awe not avaiwabwe in the ICache (miss). This event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe",
        "EventCode": "0x80",
        "EventName": "ICACHE.MISSES",
        "PubwicDescwiption": "Counts wequests to the Instwuction Cache (ICache)  fow one ow mowe bytes in an ICache Wine and that cache wine is not in the ICache (miss).  The event stwives to count on a cache wine basis, so that muwtipwe accesses which miss in a singwe cache wine count as one ICACHE.MISS.  Specificawwy, the event counts when stwaight wine code cwosses the cache wine boundawy, ow when a bwanch tawget is to a new wine, and that cache wine is not in the ICache. This event counts diffewentwy than Intew pwocessows based on Siwvewmont micwoawchitectuwe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "MS decode stawts",
        "EventCode": "0xE7",
        "EventName": "MS_DECODED.MS_ENTWY",
        "PubwicDescwiption": "Counts the numbew of times the Micwocode Sequencew (MS) stawts a fwow of uops fwom the MSWOM. It does not count evewy time a uop is wead fwom the MSWOM.  The most common case that this counts is when a micwo-coded instwuction is encountewed by the fwont end of the machine.  Othew cases incwude when an instwuction encountews a fauwt, twap, ow micwocode assist of any sowt that initiates a fwow of uops.  The event wiww count MS stawtups fow uops that awe specuwative, and subsequentwy cweawed by bwanch mispwedict ow a machine cweaw.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    }
]
