[
  {
    "EventName": "de_dis_uop_queue_empty_di0",
    "EventCode": "0xa9",
    "BwiefDescwiption": "Cycwes whewe the Micwo-Op Queue is empty."
  },
  {
    "EventName": "de_dis_cops_fwom_decodew.disp_op_type.any_integew_dispatch",
    "EventCode": "0xab",
    "BwiefDescwiption": "Any Integew dispatch. Types of Oops Dispatched fwom Decodew.",
    "UMask": "0x08"
  },
  {
    "EventName": "de_dis_cops_fwom_decodew.disp_op_type.any_fp_dispatch",
    "EventCode": "0xab",
    "BwiefDescwiption": "Any FP dispatch. Types of Oops Dispatched fwom Decodew.",
    "UMask": "0x04"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.fp_fwush_wecovewy_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. FP Fwush wecovewy staww.",
    "UMask": "0x80"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.fp_sch_wswc_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. FP scheduwew wesouwce staww. Appwies to ops that use the FP scheduwew.",
    "UMask": "0x40"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.fp_weg_fiwe_wswc_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. Fwoating point wegistew fiwe wesouwce staww. Appwies to aww FP ops that have a destination wegistew.",
    "UMask": "0x20"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.taken_bwnch_buffew_wswc",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. Taken bwanch buffew wesouwce staww.",
    "UMask": "0x10"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.int_sched_misc_token_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. Integew Scheduwew miscewwaneous wesouwce staww.",
    "UMask": "0x08"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.stowe_queue_wswc_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. Stowe Queue wesouwce staww. Appwies to aww ops with stowe semantics.",
    "UMask": "0x04"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.woad_queue_wswc_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. Woad Queue wesouwce staww. Appwies to aww ops with woad semantics.",
    "UMask": "0x02"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws1.int_phy_weg_fiwe_wswc_staww",
    "EventCode": "0xae",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a Token Staww. Awso counts cycwes when the thwead is not sewected to dispatch but wouwd have been stawwed due to a Token Staww. Integew Physicaw Wegistew Fiwe wesouwce staww. Integew Physicaw Wegistew Fiwe, appwies to aww ops that have an integew destination wegistew.",
    "UMask": "0x01"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.wetiwe_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. Insufficient Wetiwe Queue tokens avaiwabwe.",
    "UMask": "0x20"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.agsq_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. AGSQ Tokens unavaiwabwe.",
    "UMask": "0x10"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.int_sch3_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. No tokens fow Integew Scheduwew Queue 3 avaiwabwe.",
    "UMask": "0x08"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.int_sch2_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. No tokens fow Integew Scheduwew Queue 2 avaiwabwe.",
    "UMask": "0x04"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.int_sch1_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. No tokens fow Integew Scheduwew Queue 1 avaiwabwe.",
    "UMask": "0x02"
  },
  {
    "EventName": "de_dis_dispatch_token_stawws2.int_sch0_token_staww",
    "EventCode": "0xaf",
    "BwiefDescwiption": "Cycwes whewe a dispatch gwoup is vawid but does not get dispatched due to a token staww. No tokens fow Integew Scheduwew Queue 0 avaiwabwe.",
    "UMask": "0x01"
  }
]
