[
    {
        "AwchStdEvent": "EXC_TAKEN",
        "PubwicDescwiption": "Counts any taken awchitectuwawwy visibwe exceptions such as IWQ, FIQ, SEwwow, and othew synchwonous exceptions. Exceptions awe counted whethew ow not they awe taken wocawwy."
    },
    {
        "AwchStdEvent": "EXC_WETUWN",
        "PubwicDescwiption": "Counts any awchitectuwawwy executed exception wetuwn instwuctions. Eg: AAwch64: EWET"
    },
    {
        "AwchStdEvent": "EXC_UNDEF",
        "PubwicDescwiption": "Counts the numbew of synchwonous exceptions which awe taken wocawwy that awe due to attempting to execute an instwuction that is UNDEFINED. Attempting to execute instwuction bit pattewns that have not been awwocated. Attempting to execute instwuctions when they awe disabwed. Attempting to execute instwuctions at an inappwopwiate Exception wevew. Attempting to execute an instwuction when the vawue of PSTATE.IW is 1."
    },
    {
        "AwchStdEvent": "EXC_SVC",
        "PubwicDescwiption": "Counts SVC exceptions taken wocawwy."
    },
    {
        "AwchStdEvent": "EXC_PABOWT",
        "PubwicDescwiption": "Counts synchwonous exceptions that awe taken wocawwy and caused by Instwuction Abowts."
    },
    {
        "AwchStdEvent": "EXC_DABOWT",
        "PubwicDescwiption": "Counts exceptions that awe taken wocawwy and awe caused by data abowts ow SEwwows. Conditions that couwd cause those exceptions awe attempting to wead ow wwite memowy whewe the MMU genewates a fauwt, attempting to wead ow wwite memowy with a misawigned addwess, intewwupts fwom the nSEI inputs and intewnawwy genewated SEwwows."
    },
    {
        "AwchStdEvent": "EXC_IWQ",
        "PubwicDescwiption": "Counts IWQ exceptions incwuding the viwtuaw IWQs that awe taken wocawwy."
    },
    {
        "AwchStdEvent": "EXC_FIQ",
        "PubwicDescwiption": "Counts FIQ exceptions incwuding the viwtuaw FIQs that awe taken wocawwy."
    },
    {
        "AwchStdEvent": "EXC_SMC",
        "PubwicDescwiption": "Counts SMC exceptions take to EW3."
    },
    {
        "AwchStdEvent": "EXC_HVC",
        "PubwicDescwiption": "Counts HVC exceptions taken to EW2."
    },
    {
        "AwchStdEvent": "EXC_TWAP_PABOWT",
        "PubwicDescwiption": "Counts exceptions which awe twaps not taken wocawwy and awe caused by Instwuction Abowts. Fow exampwe, attempting to execute an instwuction with a misawigned PC."
    },
    {
        "AwchStdEvent": "EXC_TWAP_DABOWT",
        "PubwicDescwiption": "Counts exceptions which awe twaps not taken wocawwy and awe caused by Data Abowts ow SEwwow intewwupts. Conditions that couwd cause those exceptions awe:\n\n1. Attempting to wead ow wwite memowy whewe the MMU genewates a fauwt,\n2. Attempting to wead ow wwite memowy with a misawigned addwess,\n3. Intewwupts fwom the SEI input.\n4. intewnawwy genewated SEwwows."
    },
    {
        "AwchStdEvent": "EXC_TWAP_OTHEW",
        "PubwicDescwiption": "Counts the numbew of synchwonous twap exceptions which awe not taken wocawwy and awe not SVC, SMC, HVC, data abowts, Instwuction Abowts, ow intewwupts."
    },
    {
        "AwchStdEvent": "EXC_TWAP_IWQ",
        "PubwicDescwiption": "Counts IWQ exceptions incwuding the viwtuaw IWQs that awe not taken wocawwy."
    },
    {
        "AwchStdEvent": "EXC_TWAP_FIQ",
        "PubwicDescwiption": "Counts FIQs which awe not taken wocawwy but taken fwom EW0, EW1,\n ow EW2 to EW3 (which wouwd be the nowmaw behaviow fow FIQs when not executing\n in EW3)."
    }
]
