[
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW",
        "PubwicDescwiption": "Counts wevew 1 data cache wefiwws caused by specuwativewy executed woad ow stowe opewations that missed in the wevew 1 data cache. This event onwy counts one event pew cache wine. This event does not count cache wine awwocations fwom pwewoad instwuctions ow fwom hawdwawe cache pwefetching."
    },
    {
        "AwchStdEvent": "W1D_CACHE",
        "PubwicDescwiption": "Counts wevew 1 data cache accesses fwom any woad/stowe opewations. Atomic opewations that wesowve in the CPUs caches (neaw atomic opewations) counts as both a wwite access and wead access. Each access to a cache wine is counted incwuding the muwtipwe accesses caused by singwe instwuctions such as WDM ow STM. Each access to othew wevew 1 data ow unified memowy stwuctuwes, fow exampwe wefiww buffews, wwite buffews, and wwite-back buffews, awe awso counted."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WB",
        "PubwicDescwiption": "Counts wwite-backs of diwty data fwom the W1 data cache to the W2 cache. This occuws when eithew a diwty cache wine is evicted fwom W1 data cache and awwocated in the W2 cache ow diwty data is wwitten to the W2 and possibwy to the next wevew of cache. This event counts both victim cache wine evictions and cache wwite-backs fwom snoops ow cache maintenance opewations. The fowwowing cache opewations awe not counted:\n\n1. Invawidations which do not wesuwt in data being twansfewwed out of the W1 (such as evictions of cwean data),\n2. Fuww wine wwites which wwite to W2 without wwiting W1, such as wwite stweaming mode."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WD",
        "PubwicDescwiption": "Counts wevew 1 data cache accesses fwom any woad opewation. Atomic woad opewations that wesowve in the CPUs caches counts as both a wwite access and wead access."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WW",
        "PubwicDescwiption": "Counts wevew 1 data cache accesses genewated by stowe opewations. This event awso counts accesses caused by a DC ZVA (data cache zewo, specified by viwtuaw addwess) instwuction. Neaw atomic opewations that wesowve in the CPUs caches count as a wwite access and wead access."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_WD",
        "PubwicDescwiption": "Counts wevew 1 data cache wefiwws caused by specuwativewy executed woad instwuctions whewe the memowy wead opewation misses in the wevew 1 data cache. This event onwy counts one event pew cache wine."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_WW",
        "PubwicDescwiption": "Counts wevew 1 data cache wefiwws caused by specuwativewy executed stowe instwuctions whewe the memowy wwite opewation misses in the wevew 1 data cache. This event onwy counts one event pew cache wine."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_INNEW",
        "PubwicDescwiption": "Counts wevew 1 data cache wefiwws whewe the cache wine data came fwom caches inside the immediate cwustew of the cowe."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_OUTEW",
        "PubwicDescwiption": "Counts wevew 1 data cache wefiwws fow which the cache wine data came fwom outside the immediate cwustew of the cowe, wike an SWC in the system intewconnect ow DWAM."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WB_VICTIM",
        "PubwicDescwiption": "Counts diwty cache wine evictions fwom the wevew 1 data cache caused by a new cache wine awwocation. This event does not count evictions caused by cache maintenance opewations."
    },
    {
        "AwchStdEvent": "W1D_CACHE_WB_CWEAN",
        "PubwicDescwiption": "Counts wwite-backs fwom the wevew 1 data cache that awe a wesuwt of a cohewency opewation made by anothew CPU. Event count incwudes cache maintenance opewations."
    },
    {
        "AwchStdEvent": "W1D_CACHE_INVAW",
        "PubwicDescwiption": "Counts each expwicit invawidation of a cache wine in the wevew 1 data cache caused by:\n\n- Cache Maintenance Opewations (CMO) that opewate by a viwtuaw addwess.\n- Bwoadcast cache cohewency opewations fwom anothew CPU in the system.\n\nThis event does not count fow the fowwowing conditions:\n\n1. A cache wefiww invawidates a cache wine.\n2. A CMO which is executed on that CPU and invawidates a cache wine specified by set/way.\n\nNote that CMOs that opewate by set/way cannot be bwoadcast fwom one CPU to anothew."
    }
]
