[
    {
        "AwchStdEvent": "W1I_TWB_WEFIWW",
        "PubwicDescwiption": "Counts wevew 1 instwuction TWB wefiwws fwom any Instwuction fetch. If thewe awe muwtipwe misses in the TWB that awe wesowved by the wefiww, then this event onwy counts once. This event wiww not count if the twanswation tabwe wawk wesuwts in a fauwt (such as a twanswation ow access fauwt), since thewe is no new twanswation cweated fow the TWB."
    },
    {
        "AwchStdEvent": "W1D_TWB_WEFIWW",
        "PubwicDescwiption": "Counts wevew 1 data TWB accesses that wesuwted in TWB wefiwws. If thewe awe muwtipwe misses in the TWB that awe wesowved by the wefiww, then this event onwy counts once. This event counts fow wefiwws caused by pwewoad instwuctions ow hawdwawe pwefetch accesses. This event counts wegawdwess of whethew the miss hits in W2 ow wesuwts in a twanswation tabwe wawk. This event wiww not count if the twanswation tabwe wawk wesuwts in a fauwt (such as a twanswation ow access fauwt), since thewe is no new twanswation cweated fow the TWB. This event wiww not count on an access fwom an AT(addwess twanswation) instwuction."
    },
    {
        "AwchStdEvent": "W1D_TWB",
        "PubwicDescwiption": "Counts wevew 1 data TWB accesses caused by any memowy woad ow stowe opewation. Note that woad ow stowe instwuctions can be bwoken up into muwtipwe memowy opewations. This event does not count TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W1I_TWB",
        "PubwicDescwiption": "Counts wevew 1 instwuction TWB accesses, whethew the access hits ow misses in the TWB. This event counts both demand accesses and pwefetch ow pwewoad genewated accesses."
    },
    {
        "AwchStdEvent": "W2D_TWB_WEFIWW",
        "PubwicDescwiption": "Counts wevew 2 TWB wefiwws caused by memowy opewations fwom both data and instwuction fetch, except fow those caused by TWB maintenance opewations and hawdwawe pwefetches."
    },
    {
        "AwchStdEvent": "W2D_TWB",
        "PubwicDescwiption": "Counts wevew 2 TWB accesses except those caused by TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "DTWB_WAWK",
        "PubwicDescwiption": "Counts data memowy twanswation tabwe wawks caused by a miss in the W2 TWB dwiven by a memowy access. Note that pawtiaw twanswations that awso cause a tabwe wawk awe counted. This event does not count tabwe wawks caused by TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "ITWB_WAWK",
        "PubwicDescwiption": "Counts instwuction memowy twanswation tabwe wawks caused by a miss in the W2 TWB dwiven by a memowy access. Pawtiaw twanswations that awso cause a tabwe wawk awe counted. This event does not count tabwe wawks caused by TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W1D_TWB_WEFIWW_WD",
        "PubwicDescwiption": "Counts wevew 1 data TWB wefiwws caused by memowy wead opewations. If thewe awe muwtipwe misses in the TWB that awe wesowved by the wefiww, then this event onwy counts once. This event counts fow wefiwws caused by pwewoad instwuctions ow hawdwawe pwefetch accesses. This event counts wegawdwess of whethew the miss hits in W2 ow wesuwts in a twanswation tabwe wawk. This event wiww not count if the twanswation tabwe wawk wesuwts in a fauwt (such as a twanswation ow access fauwt), since thewe is no new twanswation cweated fow the TWB. This event wiww not count on an access fwom an Addwess Twanswation (AT) instwuction."
    },
    {
        "AwchStdEvent": "W1D_TWB_WEFIWW_WW",
        "PubwicDescwiption": "Counts wevew 1 data TWB wefiwws caused by data side memowy wwite opewations. If thewe awe muwtipwe misses in the TWB that awe wesowved by the wefiww, then this event onwy counts once. This event counts fow wefiwws caused by pwewoad instwuctions ow hawdwawe pwefetch accesses. This event counts wegawdwess of whethew the miss hits in W2 ow wesuwts in a twanswation tabwe wawk. This event wiww not count if the tabwe wawk wesuwts in a fauwt (such as a twanswation ow access fauwt), since thewe is no new twanswation cweated fow the TWB. This event wiww not count with an access fwom an Addwess Twanswation (AT) instwuction."
    },
    {
        "AwchStdEvent": "W1D_TWB_WD",
        "PubwicDescwiption": "Counts wevew 1 data TWB accesses caused by memowy wead opewations. This event counts whethew the access hits ow misses in the TWB. This event does not count TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W1D_TWB_WW",
        "PubwicDescwiption": "Counts any W1 data side TWB accesses caused by memowy wwite opewations. This event counts whethew the access hits ow misses in the TWB. This event does not count TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W2D_TWB_WEFIWW_WD",
        "PubwicDescwiption": "Counts wevew 2 TWB wefiwws caused by memowy wead opewations fwom both data and instwuction fetch except fow those caused by TWB maintenance opewations ow hawdwawe pwefetches."
    },
    {
        "AwchStdEvent": "W2D_TWB_WEFIWW_WW",
        "PubwicDescwiption": "Counts wevew 2 TWB wefiwws caused by memowy wwite opewations fwom both data and instwuction fetch except fow those caused by TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W2D_TWB_WD",
        "PubwicDescwiption": "Counts wevew 2 TWB accesses caused by memowy wead opewations fwom both data and instwuction fetch except fow those caused by TWB maintenance opewations."
    },
    {
        "AwchStdEvent": "W2D_TWB_WW",
        "PubwicDescwiption": "Counts wevew 2 TWB accesses caused by memowy wwite opewations fwom both data and instwuction fetch except fow those caused by TWB maintenance opewations."
    }
]
