[
    {
        "BwiefDescwiption": "Counts the totaw numbew when the fwont end is westeewed, mainwy when the BPU cannot pwovide a cowwect pwediction and this is cowwected by othew bwanch handwing mechanisms at the fwont end.",
        "EventCode": "0xe6",
        "EventName": "BACWEAWS.ANY",
        "SampweAftewVawue": "100003",
        "UMask": "0x1f"
    },
    {
        "BwiefDescwiption": "Decode Stweam Buffew (DSB)-to-MITE switch twue penawty cycwes.",
        "EventCode": "0xAB",
        "EventName": "DSB2MITE_SWITCHES.PENAWTY_CYCWES",
        "PubwicDescwiption": "This event counts Decode Stweam Buffew (DSB)-to-MITE switch twue penawty cycwes. These cycwes do not incwude uops wouted thwough because of the switch itsewf, fow exampwe, when Instwuction Decode Queue (IDQ) pwe-awwocation is unavaiwabwe, ow Instwuction Decode Queue (IDQ) is fuww. SBD-to-MITE switch twue penawty cycwes happen aftew the mewge mux (MM) weceives Decode Stweam Buffew (DSB) Sync-indication untiw weceiving the fiwst MITE uop. \nMM is pwaced befowe Instwuction Decode Queue (IDQ) to mewge uops being fed fwom the MITE and Decode Stweam Buffew (DSB) paths. Decode Stweam Buffew (DSB) insewts the Sync-indication whenevew a Decode Stweam Buffew (DSB)-to-MITE switch occuws.\nPenawty: A Decode Stweam Buffew (DSB) hit fowwowed by a Decode Stweam Buffew (DSB) miss can cost up to six cycwes in which no uops awe dewivewed to the IDQ. Most often, such switches fwom the Decode Stweam Buffew (DSB) to the wegacy pipewine cost 02 cycwes.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Numbew of Instwuction Cache, Stweaming Buffew and Victim Cache Weads. both cacheabwe and noncacheabwe, incwuding UC fetches",
        "EventCode": "0x80",
        "EventName": "ICACHE.HIT",
        "PubwicDescwiption": "This event counts the numbew of both cacheabwe and noncacheabwe Instwuction Cache, Stweaming Buffew and Victim Cache Weads incwuding UC fetches.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Cycwes whewe a code fetch is stawwed due to W1 instwuction-cache miss.",
        "EventCode": "0x80",
        "EventName": "ICACHE.IFDATA_STAWW",
        "PubwicDescwiption": "This event counts cycwes duwing which the demand fetch waits fow data (wfdM104H) fwom W2 ow iSB (oppowtunistic hit).",
        "SampweAftewVawue": "2000003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Numbew of Instwuction Cache, Stweaming Buffew and Victim Cache Misses. Incwudes Uncacheabwe accesses.",
        "EventCode": "0x80",
        "EventName": "ICACHE.MISSES",
        "PubwicDescwiption": "This event counts the numbew of instwuction cache, stweaming buffew and victim cache misses. Counting incwudes UC accesses.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Cycwes Decode Stweam Buffew (DSB) is dewivewing 4 Uops",
        "CountewMask": "4",
        "EventCode": "0x79",
        "EventName": "IDQ.AWW_DSB_CYCWES_4_UOPS",
        "PubwicDescwiption": "This event counts the numbew of cycwes 4  uops wewe  dewivewed to Instwuction Decode Queue (IDQ) fwom the Decode Stweam Buffew (DSB) path. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x18"
    },
    {
        "BwiefDescwiption": "Cycwes Decode Stweam Buffew (DSB) is dewivewing any Uop",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.AWW_DSB_CYCWES_ANY_UOPS",
        "PubwicDescwiption": "This event counts the numbew of cycwes  uops wewe  dewivewed to Instwuction Decode Queue (IDQ) fwom the Decode Stweam Buffew (DSB) path. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x18"
    },
    {
        "BwiefDescwiption": "Cycwes MITE is dewivewing 4 Uops",
        "CountewMask": "4",
        "EventCode": "0x79",
        "EventName": "IDQ.AWW_MITE_CYCWES_4_UOPS",
        "PubwicDescwiption": "This event counts the numbew of cycwes 4  uops wewe  dewivewed to Instwuction Decode Queue (IDQ) fwom the MITE path. Counting incwudes uops that may bypass the IDQ. This awso means that uops awe not being dewivewed fwom the Decode Stweam Buffew (DSB).",
        "SampweAftewVawue": "2000003",
        "UMask": "0x24"
    },
    {
        "BwiefDescwiption": "Cycwes MITE is dewivewing any Uop",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.AWW_MITE_CYCWES_ANY_UOPS",
        "PubwicDescwiption": "This event counts the numbew of cycwes  uops wewe dewivewed to Instwuction Decode Queue (IDQ) fwom the MITE path. Counting incwudes uops that may bypass the IDQ. This awso means that uops awe not being dewivewed fwom the Decode Stweam Buffew (DSB).",
        "SampweAftewVawue": "2000003",
        "UMask": "0x24"
    },
    {
        "BwiefDescwiption": "Cycwes when uops awe being dewivewed to Instwuction Decode Queue (IDQ) fwom Decode Stweam Buffew (DSB) path",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.DSB_CYCWES",
        "PubwicDescwiption": "This event counts cycwes duwing which uops awe being dewivewed to Instwuction Decode Queue (IDQ) fwom the Decode Stweam Buffew (DSB) path. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Uops dewivewed to Instwuction Decode Queue (IDQ) fwom the Decode Stweam Buffew (DSB) path",
        "EventCode": "0x79",
        "EventName": "IDQ.DSB_UOPS",
        "PubwicDescwiption": "This event counts the numbew of uops dewivewed to Instwuction Decode Queue (IDQ) fwom the Decode Stweam Buffew (DSB) path. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Instwuction Decode Queue (IDQ) empty cycwes",
        "EventCode": "0x79",
        "EventName": "IDQ.EMPTY",
        "PubwicDescwiption": "This counts the numbew of cycwes that the instwuction decodew queue is empty and can indicate that the appwication may be bound in the fwont end.  It does not detewmine whethew thewe awe uops being dewivewed to the Awwoc stage since uops can be dewivewed by bypass skipping the Instwuction Decode Queue (IDQ) when it is empty.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Uops dewivewed to Instwuction Decode Queue (IDQ) fwom MITE path",
        "EventCode": "0x79",
        "EventName": "IDQ.MITE_AWW_UOPS",
        "PubwicDescwiption": "This event counts the numbew of uops dewivewed to Instwuction Decode Queue (IDQ) fwom the MITE path. Counting incwudes uops that may bypass the IDQ. This awso means that uops awe not being dewivewed fwom the Decode Stweam Buffew (DSB).",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3c"
    },
    {
        "BwiefDescwiption": "Cycwes when uops awe being dewivewed to Instwuction Decode Queue (IDQ) fwom MITE path",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.MITE_CYCWES",
        "PubwicDescwiption": "This event counts cycwes duwing which uops awe being dewivewed to Instwuction Decode Queue (IDQ) fwom the MITE path. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Uops dewivewed to Instwuction Decode Queue (IDQ) fwom MITE path",
        "EventCode": "0x79",
        "EventName": "IDQ.MITE_UOPS",
        "PubwicDescwiption": "This event counts the numbew of uops dewivewed to Instwuction Decode Queue (IDQ) fwom the MITE path. Counting incwudes uops that may bypass the IDQ. This awso means that uops awe not being dewivewed fwom the Decode Stweam Buffew (DSB).",
        "SampweAftewVawue": "2000003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Cycwes when uops awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe Micwocode Sequencew (MS) is busy",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_CYCWES",
        "PubwicDescwiption": "This event counts cycwes duwing which uops awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ. Uops maybe initiated by Decode Stweam Buffew (DSB) ow MITE.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x30"
    },
    {
        "BwiefDescwiption": "Cycwes when uops initiated by Decode Stweam Buffew (DSB) awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe Micwocode Sequencew (MS) is busy",
        "CountewMask": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_DSB_CYCWES",
        "PubwicDescwiption": "This event counts cycwes duwing which uops initiated by Decode Stweam Buffew (DSB) awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Dewivewies to Instwuction Decode Queue (IDQ) initiated by Decode Stweam Buffew (DSB) whiwe Micwocode Sequencew (MS) is busy",
        "CountewMask": "1",
        "EdgeDetect": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_DSB_OCCUW",
        "PubwicDescwiption": "This event counts the numbew of dewivewies to Instwuction Decode Queue (IDQ) initiated by Decode Stweam Buffew (DSB) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Uops initiated by Decode Stweam Buffew (DSB) that awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe Micwocode Sequencew (MS) is busy",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_DSB_UOPS",
        "PubwicDescwiption": "This event counts the numbew of uops initiated by Decode Stweam Buffew (DSB) that awe being dewivewed to Instwuction Decode Queue (IDQ) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Uops initiated by MITE and dewivewed to Instwuction Decode Queue (IDQ) whiwe Micwocode Sequencew (MS) is busy",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_MITE_UOPS",
        "PubwicDescwiption": "This event counts the numbew of uops initiated by MITE and dewivewed to Instwuction Decode Queue (IDQ) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x20"
    },
    {
        "BwiefDescwiption": "Numbew of switches fwom DSB (Decode Stweam Buffew) ow MITE (wegacy decode pipewine) to the Micwocode Sequencew.",
        "CountewMask": "1",
        "EdgeDetect": "1",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_SWITCHES",
        "SampweAftewVawue": "2000003",
        "UMask": "0x30"
    },
    {
        "BwiefDescwiption": "Uops dewivewed to Instwuction Decode Queue (IDQ) whiwe Micwocode Sequencew (MS) is busy",
        "EventCode": "0x79",
        "EventName": "IDQ.MS_UOPS",
        "PubwicDescwiption": "This event counts the totaw numbew of uops dewivewed to Instwuction Decode Queue (IDQ) whiwe the Micwocode Sequencew (MS) is busy. Counting incwudes uops that may bypass the IDQ. Uops maybe initiated by Decode Stweam Buffew (DSB) ow MITE.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x30"
    },
    {
        "BwiefDescwiption": "Uops not dewivewed to Wesouwce Awwocation Tabwe (WAT) pew thwead when backend of the machine is not stawwed",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.COWE",
        "PubwicDescwiption": "This event counts the numbew of uops not dewivewed to Wesouwce Awwocation Tabwe (WAT) pew thwead adding 4  x when Wesouwce Awwocation Tabwe (WAT) is not stawwed and Instwuction Decode Queue (IDQ) dewivews x uops to Wesouwce Awwocation Tabwe (WAT) (whewe x bewongs to {0,1,2,3}). Counting does not covew cases when:\n a. IDQ-Wesouwce Awwocation Tabwe (WAT) pipe sewves the othew thwead;\n b. Wesouwce Awwocation Tabwe (WAT) is stawwed fow the thwead (incwuding uop dwops and cweaw BE conditions); \n c. Instwuction Decode Queue (IDQ) dewivews fouw uops.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Cycwes pew thwead when 4 ow mowe uops awe not dewivewed to Wesouwce Awwocation Tabwe (WAT) when backend of the machine is not stawwed",
        "CountewMask": "4",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.CYCWES_0_UOPS_DEWIV.COWE",
        "PubwicDescwiption": "This event counts, on the pew-thwead basis, cycwes when no uops awe dewivewed to Wesouwce Awwocation Tabwe (WAT). IDQ_Uops_Not_Dewivewed.cowe =4.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts cycwes FE dewivewed 4 uops ow Wesouwce Awwocation Tabwe (WAT) was stawwing FE.",
        "CountewMask": "1",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.CYCWES_FE_WAS_OK",
        "Invewt": "1",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Cycwes pew thwead when 3 ow mowe uops awe not dewivewed to Wesouwce Awwocation Tabwe (WAT) when backend of the machine is not stawwed",
        "CountewMask": "3",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.CYCWES_WE_1_UOP_DEWIV.COWE",
        "PubwicDescwiption": "This event counts, on the pew-thwead basis, cycwes when wess than 1 uop is  dewivewed to Wesouwce Awwocation Tabwe (WAT). IDQ_Uops_Not_Dewivewed.cowe >=3.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Cycwes with wess than 2 uops dewivewed by the fwont end.",
        "CountewMask": "2",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.CYCWES_WE_2_UOP_DEWIV.COWE",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Cycwes with wess than 3 uops dewivewed by the fwont end.",
        "CountewMask": "1",
        "EventCode": "0x9C",
        "EventName": "IDQ_UOPS_NOT_DEWIVEWED.CYCWES_WE_3_UOP_DEWIV.COWE",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    }
]
