[
    {
        "BwiefDescwiption": "Counts the numbew of bwanch instwuctions wetiwed (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of neaw CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xf9"
    },
    {
        "BwiefDescwiption": "Counts the numbew of faw bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.FAW_BWANCH",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xbf"
    },
    {
        "BwiefDescwiption": "Counts the numbew of neaw indiwect CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.IND_CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfb"
    },
    {
        "BwiefDescwiption": "Counts the numbew of bwanch instwuctions wetiwed that wewe conditionaw jumps. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.JCC",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0x7e"
    },
    {
        "BwiefDescwiption": "Counts the numbew of bwanch instwuctions wetiwed that wewe neaw indiwect CAWW ow neaw indiwect JMP. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.NON_WETUWN_IND",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xeb"
    },
    {
        "BwiefDescwiption": "Counts the numbew of neaw wewative CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.WEW_CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfd"
    },
    {
        "BwiefDescwiption": "Counts the numbew of neaw WET bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.WETUWN",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xf7"
    },
    {
        "BwiefDescwiption": "Counts the numbew of bwanch instwuctions wetiwed that wewe conditionaw jumps and pwedicted taken. (Pwecise Event)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.TAKEN_JCC",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted bwanch instwuctions wetiwed (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted neaw CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xf9"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted faw bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.FAW_BWANCH",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xbf"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted neaw indiwect CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.IND_CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfb"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted bwanch instwuctions wetiwed that wewe conditionaw jumps. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.JCC",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0x7e"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted bwanch instwuctions wetiwed that wewe neaw indiwect CAWW ow neaw indiwect JMP. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.NON_WETUWN_IND",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xeb"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted neaw wewative CAWW bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.WEW_CAWW",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfd"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted neaw WET bwanch instwuctions wetiwed. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.WETUWN",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xf7"
    },
    {
        "BwiefDescwiption": "Counts the numbew of mispwedicted bwanch instwuctions wetiwed that wewe conditionaw jumps and pwedicted taken. (Pwecise Event)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.TAKEN_JCC",
        "PEBS": "1",
        "SampweAftewVawue": "200003",
        "UMask": "0xfe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted wefewence cwock cycwes",
        "EventCode": "0x3C",
        "EventName": "CPU_CWK_UNHAWTED.WEF",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted wefewence cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted cowe cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD",
        "PubwicDescwiption": "This event counts the numbew of cowe cycwes whiwe the thwead is not in a hawt state. The thwead entews the hawt state when it is wunning the HWT instwuction. This event is a component in many key event watios. The cowe fwequency may change fwom time to time due to twansitions associated with Enhanced Intew SpeedStep Technowogy ow TM2. Fow this weason this event may have a changing watio with wegawds to time. When the cowe fwequency is constant, this event can appwoximate ewapsed time whiwe the cowe was not in the hawt state. It is counted on a dedicated fixed countew",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted cowe cwock cycwes",
        "EventCode": "0x3C",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD_P",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Cycwes the numbew of cowe cycwes when dividew is busy.  Does not impwy a staww waiting fow the dividew.",
        "EventCode": "0xCD",
        "EventName": "CYCWES_DIV_BUSY.AWW",
        "PubwicDescwiption": "This event counts cycwes when the dividew is busy. Mowe specificawwy cycwes when the divide unit is unabwe to accept a new divide uop because it is busy pwocessing a pweviouswy dispatched uop. The cycwes wiww be counted iwwespective of whethew ow not anothew divide uop is waiting to entew the divide unit (fwom the WS). This event counts integew divides, x87 divides, divss, divsd, sqwtss, sqwtsd event and does not count vectow divides.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of instwuctions wetiwed",
        "EventName": "INST_WETIWED.ANY",
        "PubwicDescwiption": "This event counts the numbew of instwuctions that wetiwe.  Fow instwuctions that consist of muwtipwe micwo-ops, this event counts exactwy once, as the wast micwo-op of the instwuction wetiwes.  The event continues counting whiwe instwuctions wetiwe, incwuding duwing intewwupt sewvice woutines caused by hawdwawe intewwupts, fauwts ow twaps.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the totaw numbew of instwuctions wetiwed",
        "EventCode": "0xC0",
        "EventName": "INST_WETIWED.ANY_P",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of instwuctions wetiwed (Pwecise Event)",
        "EventCode": "0xC0",
        "EventName": "INST_WETIWED.ANY_PS",
        "PEBS": "2",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Counts aww machine cweaws",
        "EventCode": "0xC3",
        "EventName": "MACHINE_CWEAWS.AWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Counts the numbew of times that the machine cweaws due to pwogwam modifying data within 1K of a wecentwy fetched code page",
        "EventCode": "0xC3",
        "EventName": "MACHINE_CWEAWS.SMC",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the totaw numbew of cowe cycwes when no micwo-ops awe awwocated fow any weason.",
        "EventCode": "0xCA",
        "EventName": "NO_AWWOC_CYCWES.AWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x7f"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cowe cycwes when no micwo-ops awe awwocated and the awwoc pipe is stawwed waiting fow a mispwedicted bwanch to wetiwe.",
        "EventCode": "0xCA",
        "EventName": "NO_AWWOC_CYCWES.MISPWEDICTS",
        "PubwicDescwiption": "This event counts the numbew of cowe cycwes when no uops awe awwocated and the awwoc pipe is stawwed waiting fow a mispwedicted bwanch to wetiwe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cowe cycwes when no micwo-ops awe awwocated, the IQ is empty, and no othew condition is bwocking awwocation.",
        "EventCode": "0xCA",
        "EventName": "NO_AWWOC_CYCWES.NOT_DEWIVEWED",
        "PubwicDescwiption": "This event counts the numbew of cowe cycwes when no uops awe awwocated, the instwuction queue is empty and the awwoc pipe is stawwed waiting fow instwuctions to be fetched.",
        "SampweAftewVawue": "200003",
        "UMask": "0x90"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cowe cycwes when no micwo-ops awe awwocated and a WATstaww (caused by wesewvation station fuww) is assewted.",
        "EventCode": "0xCA",
        "EventName": "NO_AWWOC_CYCWES.WAT_STAWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x20"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cowe cycwes when no micwo-ops awe awwocated and the WOB is fuww",
        "EventCode": "0xCA",
        "EventName": "NO_AWWOC_CYCWES.WOB_FUWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts any wetiwed woad that was pushed into the wecycwe queue fow any weason.",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.ANY_WD",
        "SampweAftewVawue": "200003",
        "UMask": "0x40"
    },
    {
        "BwiefDescwiption": "Counts any wetiwed stowe that was pushed into the wecycwe queue fow any weason.",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.ANY_ST",
        "SampweAftewVawue": "200003",
        "UMask": "0x80"
    },
    {
        "BwiefDescwiption": "Counts the numbew of occuwwences a wetiwed woad gets bwocked because its addwess ovewwaps with a stowe whose data is not weady",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.WD_BWOCK_STD_NOTWEADY",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of occuwwences a wetiwed woad gets bwocked because its addwess pawtiawwy ovewwaps with a stowe  (Pwecise Event)",
        "Data_WA": "1",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.WD_BWOCK_ST_FOWWAWD",
        "PEBS": "1",
        "PubwicDescwiption": "This event counts the numbew of wetiwed woads that wewe pwohibited fwom weceiving fowwawded data fwom a pwevious stowe because of addwess mismatch.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of occuwwences a wetiwed woad was pushed into the wehab queue because it sees a cache wine spwit. Each spwit shouwd be counted onwy once. (Pwecise Event)",
        "Data_WA": "1",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.WD_SPWITS",
        "PEBS": "1",
        "PubwicDescwiption": "This event counts the numbew of wetiwed woads which was pushed into the wecycwed queue that expewienced cache wine boundawy spwits (Pwecise event). Not that each spwit shouwd be counted onwy once.",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Counts aww the wetiwed wocked woads. It does not incwude stowes because we wouwd doubwe count if we count stowes",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.WOCK",
        "SampweAftewVawue": "200003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Counts the stowe micwo-ops wetiwed that wewe pushed in the wehab queue because the stowe addwess buffew is fuww",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.STA_FUWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x20"
    },
    {
        "BwiefDescwiption": "Counts the numbew of occuwwences a wetiwed stowe that is a cache wine spwit. Each spwit shouwd be counted onwy once.",
        "EventCode": "0x03",
        "EventName": "WECYCWEQ.ST_SPWITS",
        "PubwicDescwiption": "This event counts the numbew of wetiwed stowe that expewienced a cache wine boundawy spwit(Pwecise Event). Note that each spiwt shouwd be counted onwy once.",
        "SampweAftewVawue": "200003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Counts the totaw numbew of cowe cycwes awwocation pipewine is stawwed when any one of the wesewvation stations is fuww.",
        "EventCode": "0xCB",
        "EventName": "WS_FUWW_STAWW.AWW",
        "SampweAftewVawue": "200003",
        "UMask": "0x1f"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cowe cycwes when awwocation pipewine is stawwed and is waiting fow a fwee MEC wesewvation station entwy.",
        "EventCode": "0xCB",
        "EventName": "WS_FUWW_STAWW.MEC",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of micwo-ops wetiwed",
        "EventCode": "0xC2",
        "EventName": "UOPS_WETIWED.AWW",
        "PubwicDescwiption": "This event counts the numbew of micwo-ops (uops) wetiwed. The pwocessow decodes compwex macwo instwuctions into a sequence of simpwew uops. Most instwuctions awe composed of one ow two uops. Some instwuctions awe decoded into wongew sequences such as wepeat instwuctions, fwoating point twanscendentaw instwuctions, and assists.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Counts the numbew of micwo-ops wetiwed that awe fwom the compwex fwows issued by the micwo-sequencew (MS).",
        "EventCode": "0xC2",
        "EventName": "UOPS_WETIWED.MS",
        "PubwicDescwiption": "This event counts the numbew of micwo-ops wetiwed that wewe suppwied fwom MSWOM.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    }
]
