[
    {
        "BwiefDescwiption": "Counts the numbew of bacweaws",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.AWW",
        "PubwicDescwiption": "The BACWEAWS event counts the numbew of times the fwont end is westeewed, mainwy when the Bwanch Pwediction Unit cannot pwovide a cowwect pwediction and this is cowwected by the Bwanch Addwess Cawcuwatow at the fwont end.  The BACWEAWS.ANY event counts the numbew of bacweaws fow any type of bwanch.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of JCC bacweaws",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.COND",
        "PubwicDescwiption": "The BACWEAWS event counts the numbew of times the fwont end is westeewed, mainwy when the Bwanch Pwediction Unit cannot pwovide a cowwect pwediction and this is cowwected by the Bwanch Addwess Cawcuwatow at the fwont end.  The BACWEAWS.COND event counts the numbew of JCC (Jump on Conditionaw Code) bacweaws.",
        "SampweAftewVawue": "200003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Counts the numbew of WETUWN bacweaws",
        "EventCode": "0xE6",
        "EventName": "BACWEAWS.WETUWN",
        "PubwicDescwiption": "The BACWEAWS event counts the numbew of times the fwont end is westeewed, mainwy when the Bwanch Pwediction Unit cannot pwovide a cowwect pwediction and this is cowwected by the Bwanch Addwess Cawcuwatow at the fwont end.  The BACWEAWS.WETUWN event counts the numbew of WETUWN bacweaws.",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Counts the numbew of times a decode westwiction weduced the decode thwoughput due to wwong instwuction wength pwediction",
        "EventCode": "0xE9",
        "EventName": "DECODE_WESTWICTION.PWEDECODE_WWONG",
        "PubwicDescwiption": "Counts the numbew of times a decode westwiction weduced the decode thwoughput due to wwong instwuction wength pwediction.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Instwuction fetches",
        "EventCode": "0x80",
        "EventName": "ICACHE.ACCESSES",
        "PubwicDescwiption": "This event counts aww instwuction fetches, not incwuding most uncacheabwe\w\nfetches.",
        "SampweAftewVawue": "200003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Instwuction fetches fwom Icache",
        "EventCode": "0x80",
        "EventName": "ICACHE.HIT",
        "PubwicDescwiption": "This event counts aww instwuction fetches fwom the instwuction cache.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Icache miss",
        "EventCode": "0x80",
        "EventName": "ICACHE.MISSES",
        "PubwicDescwiption": "This event counts aww instwuction fetches that miss the Instwuction cache ow pwoduce memowy wequests. This incwudes uncacheabwe fetches. An instwuction fetch miss is counted onwy once and not once fow evewy cycwe it is outstanding.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of times entewed into a ucode fwow in the FEC.  Incwudes insewted fwows due to fwont-end detected fauwts ow assists.  Specuwative count.",
        "EventCode": "0xE7",
        "EventName": "MS_DECODED.MS_ENTWY",
        "PubwicDescwiption": "Counts the numbew of times the MSWOM stawts a fwow of UOPS. It does not count evewy time a UOP is wead fwom the micwocode WOM.  The most common case that this counts is when a micwo-coded instwuction is encountewed by the fwont end of the machine.  Othew cases incwude when an instwuction encountews a fauwt, twap, ow micwocode assist of any sowt.  The event wiww count MSWOM stawtups fow UOPS that awe specuwative, and subsequentwy cweawed by bwanch mispwedict ow machine cweaw.  Backgwound: UOPS awe pwoduced by two mechanisms.  Eithew they awe genewated by hawdwawe that decodes instwuctions into UOPS, ow they awe dewivewed by a WOM (cawwed the MSWOM) that howds UOPS associated with a specific instwuction.  MSWOM UOPS might awso be dewivewed in wesponse to some condition such as a fauwt ow othew exceptionaw condition.  This event is an excewwent mechanism fow detecting instwuctions that wequiwe the use of MSWOM instwuctions.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    }
]
