[
    {
        "BwiefDescwiption": "Woads missed DTWB",
        "EventCode": "0x04",
        "EventName": "MEM_UOPS_WETIWED.DTWB_MISS_WOADS",
        "PEBS": "1",
        "PubwicDescwiption": "This event counts the numbew of woad ops wetiwed that had DTWB miss.",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Totaw cycwes fow aww the page wawks. (I-side and D-side)",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.CYCWES",
        "PubwicDescwiption": "This event counts evewy cycwe when a data (D) page wawk ow instwuction (I) page wawk is in pwogwess.  Since a pagewawk impwies a TWB miss, the appwoximate cost of a TWB miss can be detewmined fwom this event.",
        "SampweAftewVawue": "200003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Duwation of D-side page-wawks in cowe cycwes",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.D_SIDE_CYCWES",
        "PubwicDescwiption": "This event counts evewy cycwe when a D-side (wawks due to a woad) page wawk is in pwogwess. Page wawk duwation divided by numbew of page wawks is the avewage duwation of page-wawks.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "D-side page-wawks",
        "EdgeDetect": "1",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.D_SIDE_WAWKS",
        "PubwicDescwiption": "This event counts when a data (D) page wawk is compweted ow stawted.  Since a page wawk impwies a TWB miss, the numbew of TWB misses can be counted by counting the numbew of pagewawks.",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Duwation of I-side page-wawks in cowe cycwes",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.I_SIDE_CYCWES",
        "PubwicDescwiption": "This event counts evewy cycwe when a I-side (wawks due to an instwuction fetch) page wawk is in pwogwess. Page wawk duwation divided by numbew of page wawks is the avewage duwation of page-wawks.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "I-side page-wawks",
        "EdgeDetect": "1",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.I_SIDE_WAWKS",
        "PubwicDescwiption": "This event counts when an instwuction (I) page wawk is compweted ow stawted.  Since a page wawk impwies a TWB miss, the numbew of TWB misses can be counted by counting the numbew of pagewawks.",
        "SampweAftewVawue": "100003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Totaw page wawks that awe compweted (I-side and D-side)",
        "EdgeDetect": "1",
        "EventCode": "0x05",
        "EventName": "PAGE_WAWKS.WAWKS",
        "PubwicDescwiption": "This event counts when a data (D) page wawk ow an instwuction (I) page wawk is compweted ow stawted.  Since a page wawk impwies a TWB miss, the numbew of TWB misses can be counted by counting the numbew of pagewawks.",
        "SampweAftewVawue": "100003",
        "UMask": "0x3"
    }
]
