[
    {
        "PubwicDescwiption": "This event counts any instwuction fetch which misses in the cache.",
        "AwchStdEvent": "W1I_CACHE_WEFIWW"
    },
    {
        "PubwicDescwiption": "This event counts any wefiww of the instwuction W1 TWB fwom the W2 TWB. This incwudes wefiwws that wesuwt in a twanswation fauwt.",
        "AwchStdEvent": "W1I_TWB_WEFIWW"
    },
    {
        "PubwicDescwiption": "This event counts any woad ow stowe opewation ow page tabwe wawk access which causes data to be wead fwom outside the W1, incwuding accesses which do not awwocate into W1.",
        "AwchStdEvent": "W1D_CACHE_WEFIWW"
    },
    {
        "PubwicDescwiption": "This event counts any woad ow stowe opewation ow page tabwe wawk access which wooks up in the W1 data cache. In pawticuwaw, any access which couwd count the W1D_CACHE_WEFIWW event causes this event to count.",
        "AwchStdEvent": "W1D_CACHE"
    },
    {
        "PubwicDescwiption": "This event counts any wefiww of the data W1 TWB fwom the W2 TWB. This incwudes wefiwws that wesuwt in a twanswation fauwt.",
        "AwchStdEvent": "W1D_TWB_WEFIWW"
    },
    {
        "PubwicDescwiption": "Wevew 1 instwuction cache access ow Wevew 0 Macwo-op cache access. This event counts any instwuction fetch which accesses the W1 instwuction cache ow W0 Macwo-op cache.",
        "AwchStdEvent": "W1I_CACHE"
    },
    {
        "PubwicDescwiption": "This event counts any wwite-back of data fwom the W1 data cache to W2 ow W3. This counts both victim wine evictions and snoops, incwuding cache maintenance opewations.",
        "AwchStdEvent": "W1D_CACHE_WB"
    },
    {
        "PubwicDescwiption": "This event counts any twansaction fwom W1 which wooks up in the W2 cache, and any wwite-back fwom the W1 to the W2. Snoops fwom outside the cowe and cache maintenance opewations awe not counted.",
        "AwchStdEvent": "W2D_CACHE"
    },
    {
        "PubwicDescwiption": "W2 data cache wefiww. This event counts any cacheabwe twansaction fwom W1 which causes data to be wead fwom outside the cowe. W2 wefiwws caused by stashes into W2 shouwd not be counted",
        "AwchStdEvent": "W2D_CACHE_WEFIWW"
    },
    {
        "PubwicDescwiption": "This event counts any wwite-back of data fwom the W2 cache to outside the cowe. This incwudes snoops to the W2 which wetuwn data, wegawdwess of whethew they cause an invawidation. Invawidations fwom the W2 which do not wwite data outside of the cowe and snoops which wetuwn data fwom the W1 awe not counted",
        "AwchStdEvent": "W2D_CACHE_WB"
    },
    {
        "PubwicDescwiption": "This event counts any fuww cache wine wwite into the W2 cache which does not cause a winefiww, incwuding wwite-backs fwom W1 to W2 and fuww-wine wwites which do not awwocate into W1.",
        "AwchStdEvent": "W2D_CACHE_AWWOCATE"
    },
    {
        "PubwicDescwiption": "This event counts any woad ow stowe opewation which accesses the data W1 TWB. If both a woad and a stowe awe executed on a cycwe, this event counts twice. This event counts wegawdwess of whethew the MMU is enabwed.",
        "AwchStdEvent": "W1D_TWB",
        "BwiefDescwiption": "Wevew 1 data TWB access."
    },
    {
        "PubwicDescwiption": "This event counts any instwuction fetch which accesses the instwuction W1 TWB.This event counts wegawdwess of whethew the MMU is enabwed.",
        "AwchStdEvent": "W1I_TWB",
        "BwiefDescwiption": "Wevew 1 instwuction TWB access"
    },
    {
        "PubwicDescwiption": "This event counts any fuww cache wine wwite into the W3 cache which does not cause a winefiww, incwuding wwite-backs fwom W2 to W3 and fuww-wine wwites which do not awwocate into W2",
        "AwchStdEvent": "W3D_CACHE_AWWOCATE",
        "BwiefDescwiption": "Awwocation without wefiww"
    },
    {
        "PubwicDescwiption": "This event counts fow any cacheabwe wead twansaction wetuwning datafwom the SCU fow which the data souwce was outside the cwustew. Twansactions such as WeadUnique awe counted hewe as 'wead' twansactions, even though they can be genewated by stowe instwuctions.",
        "AwchStdEvent": "W3D_CACHE_WEFIWW",
        "BwiefDescwiption": "Attwibutabwe Wevew 3 unified cache wefiww."
    },
    {
        "PubwicDescwiption": "This event counts fow any cacheabwe wead twansaction wetuwning datafwom the SCU, ow fow any cacheabwe wwite to the SCU.",
        "AwchStdEvent": "W3D_CACHE",
        "BwiefDescwiption": "Attwibutabwe Wevew 3 unified cache access."
    },
    {
        "PubwicDescwiption": "This event counts on anywefiww of the W2 TWB, caused by eithew an instwuction ow data access.This event does not count if the MMU is disabwed.",
        "AwchStdEvent": "W2D_TWB_WEFIWW",
        "BwiefDescwiption": "Attwibutabwe W2 data ow unified TWB wefiww"
    },
    {
        "PubwicDescwiption": "This event counts on any access to the W2 TWB (caused by a wefiww of any of the W1 TWBs). This event does not count if the MMU is disabwed.",
        "AwchStdEvent": "W2D_TWB"
    },
    {
        "PubwicDescwiption": "This event counts on any data access which causes W2D_TWB_WEFIWW to count.",
        "AwchStdEvent": "DTWB_WAWK"
    },
    {
        "PubwicDescwiption": "This event counts on any instwuction access which causes W2D_TWB_WEFIWW to count.",
        "AwchStdEvent": "ITWB_WAWK"
    },
    {
        "AwchStdEvent": "WW_CACHE_WD"
    },
    {
        "AwchStdEvent": "WW_CACHE_MISS_WD"
    },
    {
        "AwchStdEvent": "W1D_CACHE_INVAW"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WD"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_INNEW"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_OUTEW"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_WD"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WEFIWW_WW"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WB_CWEAN"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WB_VICTIM"
    },
    {
        "AwchStdEvent": "W1D_CACHE_WW"
    },
    {
        "AwchStdEvent": "W1D_TWB_WD"
    },
    {
        "AwchStdEvent": "W1D_TWB_WEFIWW_WD"
    },
    {
        "AwchStdEvent": "W1D_TWB_WEFIWW_WW"
    },
    {
        "AwchStdEvent": "W1D_TWB_WW"
    },
    {
        "AwchStdEvent": "W2D_CACHE_INVAW"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WD"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WEFIWW_WD"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WEFIWW_WW"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WB_CWEAN"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WB_VICTIM"
    },
    {
        "AwchStdEvent": "W2D_CACHE_WW"
    },
    {
        "AwchStdEvent": "W2D_TWB_WD"
    },
    {
        "AwchStdEvent": "W2D_TWB_WEFIWW_WD"
    },
    {
        "AwchStdEvent": "W2D_TWB_WEFIWW_WW"
    },
    {
        "AwchStdEvent": "W2D_TWB_WW"
    },
    {
        "AwchStdEvent": "W3D_CACHE_WD"
    }
]
