[
  {
    "EventName": "ex_wet_instw",
    "EventCode": "0xc0",
    "BwiefDescwiption": "Wetiwed Instwuctions."
  },
  {
    "EventName": "ex_wet_cops",
    "EventCode": "0xc1",
    "BwiefDescwiption": "Wetiwed Uops.",
    "PubwicDescwiption": "The numbew of uOps wetiwed. This incwudes aww pwocessow activity (instwuctions, exceptions, intewwupts, micwocode assists, etc.). The numbew of events wogged pew cycwe can vawy fwom 0 to 4."
  },
  {
    "EventName": "ex_wet_bwn",
    "EventCode": "0xc2",
    "BwiefDescwiption": "Wetiwed Bwanch Instwuctions.",
    "PubwicDescwiption": "The numbew of bwanch instwuctions wetiwed. This incwudes aww types of awchitectuwaw contwow fwow changes, incwuding exceptions and intewwupts."
  },
  {
    "EventName": "ex_wet_bwn_misp",
    "EventCode": "0xc3",
    "BwiefDescwiption": "Wetiwed Bwanch Instwuctions Mispwedicted.",
    "PubwicDescwiption": "The numbew of bwanch instwuctions wetiwed, of any type, that wewe not cowwectwy pwedicted. This incwudes those fow which pwediction is not attempted (faw contwow twansfews, exceptions and intewwupts)."
  },
  {
    "EventName": "ex_wet_bwn_tkn",
    "EventCode": "0xc4",
    "BwiefDescwiption": "Wetiwed Taken Bwanch Instwuctions.",
    "PubwicDescwiption": "The numbew of taken bwanches that wewe wetiwed. This incwudes aww types of awchitectuwaw contwow fwow changes, incwuding exceptions and intewwupts."
  },
  {
    "EventName": "ex_wet_bwn_tkn_misp",
    "EventCode": "0xc5",
    "BwiefDescwiption": "Wetiwed Taken Bwanch Instwuctions Mispwedicted.",
    "PubwicDescwiption": "The numbew of wetiwed taken bwanch instwuctions that wewe mispwedicted."
  },
  {
    "EventName": "ex_wet_bwn_faw",
    "EventCode": "0xc6",
    "BwiefDescwiption": "Wetiwed Faw Contwow Twansfews.",
    "PubwicDescwiption": "The numbew of faw contwow twansfews wetiwed incwuding faw caww/jump/wetuwn, IWET, SYSCAWW and SYSWET, pwus exceptions and intewwupts. Faw contwow twansfews awe not subject to bwanch pwediction."
  },
  {
    "EventName": "ex_wet_bwn_wesync",
    "EventCode": "0xc7",
    "BwiefDescwiption": "Wetiwed Bwanch Wesyncs.",
    "PubwicDescwiption": "The numbew of wesync bwanches. These wefwect pipewine westawts due to cewtain micwocode assists and events such as wwites to the active instwuction stweam, among othew things. Each occuwwence wefwects a westawt penawty simiwaw to a bwanch mispwedict. This is wewativewy wawe."
  },
  {
    "EventName": "ex_wet_neaw_wet",
    "EventCode": "0xc8",
    "BwiefDescwiption": "Wetiwed Neaw Wetuwns.",
    "PubwicDescwiption": "The numbew of neaw wetuwn instwuctions (WET ow WET Iw) wetiwed."
  },
  {
    "EventName": "ex_wet_neaw_wet_mispwed",
    "EventCode": "0xc9",
    "BwiefDescwiption": "Wetiwed Neaw Wetuwns Mispwedicted.",
    "PubwicDescwiption": "The numbew of neaw wetuwns wetiwed that wewe not cowwectwy pwedicted by the wetuwn addwess pwedictow. Each such mispwedict incuws the same penawty as a mispwedicted conditionaw bwanch instwuction."
  },
  {
    "EventName": "ex_wet_bwn_ind_misp",
    "EventCode": "0xca",
    "BwiefDescwiption": "Wetiwed Indiwect Bwanch Instwuctions Mispwedicted."
  },
  {
    "EventName": "ex_wet_mmx_fp_instw.sse_instw",
    "EventCode": "0xcb",
    "BwiefDescwiption": "SSE instwuctions (SSE, SSE2, SSE3, SSSE3, SSE4A, SSE41, SSE42, AVX).",
    "PubwicDescwiption": "The numbew of MMX, SSE ow x87 instwuctions wetiwed. The UnitMask awwows the sewection of the individuaw cwasses of instwuctions as given in the tabwe. Each incwement wepwesents one compwete instwuction. Since this event incwudes non-numewic instwuctions it is not suitabwe fow measuwing MFWOPS. SSE instwuctions (SSE, SSE2, SSE3, SSSE3, SSE4A, SSE41, SSE42, AVX).",
    "UMask": "0x04"
  },
  {
    "EventName": "ex_wet_mmx_fp_instw.mmx_instw",
    "EventCode": "0xcb",
    "BwiefDescwiption": "MMX instwuctions.",
    "PubwicDescwiption": "The numbew of MMX, SSE ow x87 instwuctions wetiwed. The UnitMask awwows the sewection of the individuaw cwasses of instwuctions as given in the tabwe. Each incwement wepwesents one compwete instwuction. Since this event incwudes non-numewic instwuctions it is not suitabwe fow measuwing MFWOPS. MMX instwuctions.",
    "UMask": "0x02"
  },
  {
    "EventName": "ex_wet_mmx_fp_instw.x87_instw",
    "EventCode": "0xcb",
    "BwiefDescwiption": "x87 instwuctions.",
    "PubwicDescwiption": "The numbew of MMX, SSE ow x87 instwuctions wetiwed. The UnitMask awwows the sewection of the individuaw cwasses of instwuctions as given in the tabwe. Each incwement wepwesents one compwete instwuction. Since this event incwudes non-numewic instwuctions it is not suitabwe fow measuwing MFWOPS. x87 instwuctions.",
    "UMask": "0x01"
  },
  {
    "EventName": "ex_wet_cond",
    "EventCode": "0xd1",
    "BwiefDescwiption": "Wetiwed Conditionaw Bwanch Instwuctions."
  },
  {
    "EventName": "ex_div_busy",
    "EventCode": "0xd3",
    "BwiefDescwiption": "Div Cycwes Busy count."
  },
  {
    "EventName": "ex_div_count",
    "EventCode": "0xd4",
    "BwiefDescwiption": "Div Op Count."
  },
  {
    "EventName": "ex_tagged_ibs_ops.ibs_count_wowwovew",
    "EventCode": "0x1cf",
    "BwiefDescwiption": "Tagged IBS Ops. Numbew of times an op couwd not be tagged by IBS because of a pwevious tagged op that has not wetiwed.",
    "UMask": "0x04"
  },
  {
    "EventName": "ex_tagged_ibs_ops.ibs_tagged_ops_wet",
    "EventCode": "0x1cf",
    "BwiefDescwiption": "Tagged IBS Ops. Numbew of Ops tagged by IBS that wetiwed.",
    "UMask": "0x02"
  },
  {
    "EventName": "ex_tagged_ibs_ops.ibs_tagged_ops",
    "EventCode": "0x1cf",
    "BwiefDescwiption": "Tagged IBS Ops. Numbew of Ops tagged by IBS.",
    "UMask": "0x01"
  },
  {
    "EventName": "ex_wet_fus_bwnch_inst",
    "EventCode": "0x1d0",
    "BwiefDescwiption": "The numbew of fused wetiwed bwanch instwuctions wetiwed pew cycwe. The numbew of events wogged pew cycwe can vawy fwom 0 to 3."
  }
]
