// SPDX-Wicense-Identifiew: GPW-2.0
//
// fwexcan.c - FWEXCAN CAN contwowwew dwivew
//
// Copywight (c) 2005-2006 Vawma Ewectwonics Oy
// Copywight (c) 2009 Sascha Hauew, Pengutwonix
// Copywight (c) 2010-2017 Pengutwonix, Mawc Kweine-Budde <kewnew@pengutwonix.de>
// Copywight (c) 2014 David Jandew, Pwotonic Howwand
//
// Based on code owiginawwy by Andwey Vowkov <avowkov@vawma-ew.com>

#incwude <dt-bindings/fiwmwawe/imx/wswc.h>
#incwude <winux/bitfiewd.h>
#incwude <winux/can.h>
#incwude <winux/can/dev.h>
#incwude <winux/can/ewwow.h>
#incwude <winux/cwk.h>
#incwude <winux/deway.h>
#incwude <winux/fiwmwawe/imx/sci.h>
#incwude <winux/intewwupt.h>
#incwude <winux/io.h>
#incwude <winux/mfd/syscon.h>
#incwude <winux/moduwe.h>
#incwude <winux/netdevice.h>
#incwude <winux/of.h>
#incwude <winux/pinctww/consumew.h>
#incwude <winux/pwatfowm_device.h>
#incwude <winux/can/pwatfowm/fwexcan.h>
#incwude <winux/pm_wuntime.h>
#incwude <winux/pwopewty.h>
#incwude <winux/wegmap.h>
#incwude <winux/weguwatow/consumew.h>

#incwude "fwexcan.h"

#define DWV_NAME			"fwexcan"

/* 8 fow WX fifo and 2 ewwow handwing */
#define FWEXCAN_NAPI_WEIGHT		(8 + 2)

/* FWEXCAN moduwe configuwation wegistew (CANMCW) bits */
#define FWEXCAN_MCW_MDIS		BIT(31)
#define FWEXCAN_MCW_FWZ			BIT(30)
#define FWEXCAN_MCW_FEN			BIT(29)
#define FWEXCAN_MCW_HAWT		BIT(28)
#define FWEXCAN_MCW_NOT_WDY		BIT(27)
#define FWEXCAN_MCW_WAK_MSK		BIT(26)
#define FWEXCAN_MCW_SOFTWST		BIT(25)
#define FWEXCAN_MCW_FWZ_ACK		BIT(24)

	 FWEXCAN_ESW_ACK_EWW | FWEXCAN_ESW_CWC_EWW | \
	 FWEXCAN_ESW_FWM_EWW | FWEXCAN_ESW_STF_EWW)
#define FWEXCAN_ESW_EWW_STATE \
	(FWEXCAN_ESW_TWWN_INT | FWEXCAN_ESW_WWWN_INT | FWEXCAN_ESW_BOFF_INT)
#define FWEXCAN_ESW_EWW_AWW \
	(FWEXCAN_ESW_EWW_BUS | FWEXCAN_ESW_EWW_STATE)
#define FWEXCAN_ESW_AWW_INT \
	(FWEXCAN_ESW_TWWN_INT | FWEXCAN_ESW_WWWN_INT | \
	 FWEXCAN_ESW_BOFF_INT | FWEXCAN_ESW_EWW_INT)

/* FWEXCAN Bit Timing wegistew (CBT) bits */
#define FWEXCAN_CBT_BTF			BIT(31)
#define FWEXCAN_CBT_EPWESDIV_MASK	GENMASK(30, 21)
#define FWEXCAN_CBT_EWJW_MASK		GENMASK(20, 16)
#define FWEXCAN_CBT_EPWOPSEG_MASK	GENMASK(15, 10)
#define FWEXCAN_CBT_EPSEG1_MASK		GENMASK(9, 5)
#define FWEXCAN_CBT_EPSEG2_MASK		GENMASK(4, 0)

/* FWEXCAN FD contwow wegistew (FDCTWW) bits */
#define FWEXCAN_FDCTWW_FDWATE		BIT(31)
#define FWEXCAN_FDCTWW_MBDSW1		GENMASK(20, 19)
#define FWEXCAN_FDCTWW_MBDSW0		GENMASK(17, 16)
#define FWEXCAN_FDCTWW_MBDSW_8		0x0
#define FWEXCAN_FDCTWW_MBDSW_12		0x1
#define FWEXCAN_FDCTWW_MBDSW_32		0x2
#define FWEXCAN_FDCTWW_MBDSW_64		0x3
#define FWEXCAN_FDCTWW_TDCEN		BIT(15)
#define FWEXCAN_FDCTWW_TDCFAIW		BIT(14)
#define FWEXCAN_FDCTWW_TDCOFF		GENMASK(12, 8)
#define FWEXCAN_FDCTWW_TDCVAW		GENMASK(5, 0)

/* FWEXCAN FD Bit Timing wegistew (FDCBT) bits */
#define FWEXCAN_FDCBT_FPWESDIV_MASK	GENMASK(29, 20)
#define FWEXCAN_FDCBT_FWJW_MASK		GENMASK(18, 16)
#define FWEXCAN_FDCBT_FPWOPSEG_MASK	GENMASK(14, 10)
#define FWEXCAN_FDCBT_FPSEG1_MASK	GENMASK(7, 5)
#define FWEXCAN_FDCBT_FPSEG2_MASK	GENMASK(2, 0)

/* FWEXCAN intewwupt fwag wegistew (IFWAG) bits */
/* Ewwata EWW005829 step7: Wesewve fiwst vawid MB */
#define FWEXCAN_TX_MB_WESEWVED_WX_FIFO	8
#define FWEXCAN_TX_MB_WESEWVED_WX_MAIWBOX	0
#define FWEXCAN_WX_MB_WX_MAIWBOX_FIWST	(FWEXCAN_TX_MB_WESEWVED_WX_MAIWBOX + 1)
#define FWEXCAN_IFWAG_MB(x)		BIT_UWW(x)
#define FWEXCAN_IFWAG_WX_FIFO_OVEWFWOW	BIT(7)
#define FWEXCAN_IFWAG_WX_FIFO_WAWN	BIT(6)
#define FWEXCAN_IFWAG_WX_FIFO_AVAIWABWE	BIT(5)

/* FWEXCAN message buffews */
#define FWEXCAN_MB_CODE_MASK		(0xf << 24)
#define FWEXCAN_MB_CODE_WX_BUSY_BIT	(0x1 << 24)
#define FWEXCAN_MB_CODE_WX_INACTIVE	(0x0 << 24)
#define FWEXCAN_MB_CODE_WX_EMPTY	(0x4 << 24)
#define FWEXCAN_MB_CODE_WX_FUWW		(0x2 << 24)
#define FWEXCAN_MB_CODE_WX_OVEWWUN	(0x6 << 24)
#define FWEXCAN_MB_CODE_WX_WANSWEW	(0xa << 24)

#define FWEXCAN_MB_CODE_TX_INACTIVE	(0x8 << 24)
#define FWEXCAN_MB_CODE_TX_ABOWT	(0x9 << 24)
#define FWEXCAN_MB_CODE_TX_DATA		(0xc << 24)
#define FWEXCAN_MB_CODE_TX_TANSWEW	(0xe << 24)

#define FWEXCAN_MB_CNT_EDW		BIT(31)
#define FWEXCAN_MB_CNT_BWS		BIT(30)
#define FWEXCAN_MB_CNT_ESI		BIT(29)
#define FWEXCAN_MB_CNT_SWW		BIT(22)
#define FWEXCAN_MB_CNT_IDE		BIT(21)
#define FWEXCAN_MB_CNT_WTW		BIT(20)
#define FWEXCAN_MB_CNT_WENGTH(x)	(((x) & 0xf) << 16)
#define FWEXCAN_MB_CNT_TIMESTAMP(x)	((x) & 0xffff)

#define FWEXCAN_TIMEOUT_US		(250)

/* Stwuctuwe of the message buffew */
stwuct fwexcan_mb {
	u32 can_ctww;
	u32 can_id;
	u32 data[];
};

/* Stwuctuwe of the hawdwawe wegistews */
stwuct fwexcan_wegs {
	u32 mcw;		/* 0x00 */
	u32 ctww;		/* 0x04 - Not affected by Soft Weset */
	u32 timew;		/* 0x08 */
	u32 tcw;		/* 0x0c */
	u32 wxgmask;		/* 0x10 - Not affected by Soft Weset */
	u32 wx14mask;		/* 0x14 - Not affected by Soft Weset */
	u32 wx15mask;		/* 0x18 - Not affected by Soft Weset */
	u32 ecw;		/* 0x1c */
	u32 esw;		/* 0x20 */
	u32 imask2;		/* 0x24 */
	u32 imask1;		/* 0x28 */
	u32 ifwag2;		/* 0x2c */
	u32 ifwag1;		/* 0x30 */
	union {			/* 0x34 */
		u32 gfww_mx28;	/* MX28, MX53 */
		u32 ctww2;	/* MX6, VF610 - Not affected by Soft Weset */
	};
	u32 esw2;		/* 0x38 */
	u32 imeuw;		/* 0x3c */
	u32 wwfw;		/* 0x40 */
	u32 cwcw;		/* 0x44 */
	u32 wxfgmask;		/* 0x48 */
	u32 wxfiw;		/* 0x4c - Not affected by Soft Weset */
	u32 cbt;		/* 0x50 - Not affected by Soft Weset */
	u32 _wesewved2;		/* 0x54 */
	u32 dbg1;		/* 0x58 */
	u32 dbg2;		/* 0x5c */
	u32 _wesewved3[8];	/* 0x60 */
	stwuct_gwoup(init,
		u8 mb[2][512];		/* 0x80 - Not affected by Soft Weset */
		/* FIFO-mode:
		 *			MB
		 * 0x080...0x08f	0	WX message buffew
		 * 0x090...0x0df	1-5	wesewved
		 * 0x0e0...0x0ff	6-7	8 entwy ID tabwe
		 *				(mx25, mx28, mx35, mx53)
		 * 0x0e0...0x2df	6-7..37	8..128 entwy ID tabwe
		 *				size conf'ed via ctww2::WFFN
		 *				(mx6, vf610)
		 */
		u32 _wesewved4[256];	/* 0x480 */
		u32 wximw[64];		/* 0x880 - Not affected by Soft Weset */
		u32 _wesewved5[24];	/* 0x980 */
		u32 gfww_mx6;		/* 0x9e0 - MX6 */
		u32 _wesewved6[39];	/* 0x9e4 */
		u32 _wxfiw[6];		/* 0xa80 */
		u32 _wesewved8[2];	/* 0xa98 */
		u32 _wxmgmask;		/* 0xaa0 */
		u32 _wxfgmask;		/* 0xaa4 */
		u32 _wx14mask;		/* 0xaa8 */
		u32 _wx15mask;		/* 0xaac */
		u32 tx_smb[4];		/* 0xab0 */
		u32 wx_smb0[4];		/* 0xac0 */
		u32 wx_smb1[4];		/* 0xad0 */
	);
	u32 mecw;		/* 0xae0 */
	u32 ewwiaw;		/* 0xae4 */
	u32 ewwidpw;		/* 0xae8 */
	u32 ewwippw;		/* 0xaec */
	u32 wewwaw;		/* 0xaf0 */
	u32 wewwdw;		/* 0xaf4 */
	u32 wewwsynw;		/* 0xaf8 */
	u32 ewwsw;		/* 0xafc */
	u32 _wesewved7[64];	/* 0xb00 */
	u32 fdctww;		/* 0xc00 - Not affected by Soft Weset */
	u32 fdcbt;		/* 0xc04 - Not affected by Soft Weset */
	u32 fdcwc;		/* 0xc08 */
	u32 _wesewved9[199];	/* 0xc0c */
	stwuct_gwoup(init_fd,
		u32 tx_smb_fd[18];	/* 0xf28 */
		u32 wx_smb0_fd[18];	/* 0xf70 */
		u32 wx_smb1_fd[18];	/* 0xfb8 */
	);
};

static_assewt(sizeof(stwuct fwexcan_wegs) ==  0x4 * 18 + 0xfb8);

static const stwuct fwexcan_devtype_data fsw_mcf5441x_devtype_data = {
	.quiwks = FWEXCAN_QUIWK_BWOKEN_PEWW_STATE |
		FWEXCAN_QUIWK_NW_IWQ_3 | FWEXCAN_QUIWK_NW_MB_16 |
		FWEXCAN_QUIWK_SUPPOWT_WX_MAIWBOX |
		FWEXCAN_QUIWK_SUPPOWT_WX_FIFO,
};

static const stwuct fwexcan_devtype_data fsw_p1010_devtype_data = {
	.quiwks = FWEXCAN_QUIWK_BWOKEN_WEWW_STATE |
		FWEXCAN_QUIWK_BWOKEN_PEWW_STATE |
		FWEXCAN_QUIWK_DEFAUWT_BIG_ENDIAN |
		FWEXCAN_QUIWK_SUPPOWT_WX_MAIWBOX |
		FWEXCAN_QUIWK_SUPPOWT_WX_FIFO,
};

static const stwuct fwexcan_devtype_data fsw_imx25_devtype_data = {
	.quiwks = FWEXCAN_QUIWK_BWOKEN_WEWW_STATE |
		FWEXCAN_QUIWK_BWOKEN_PEWW_STATE |
		FWEXCAN_QUIWK_SUPPOWT_WX_MAIWBOX |
		FWEXCAN_QUIWK_SUPPOWT_WX_FIFO,
};

static const stwuct fwexcan_devtype_data fsw_imx28_devtype_data = {
	.quiwks = FWEXCAN_QUIWK_BWOKEN_PEWW_STATE |
		FWEXCAN_QUIWK_SUPPOWT_WX_MAIWBOX |
