[
  {
    "EventCode": "0x200FE",
    "EventName": "PM_DATA_FWOM_W2MISS",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x300FE",
    "EventName": "PM_DATA_FWOM_W3MISS",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x400FE",
    "EventName": "PM_DATA_FWOM_MEMOWY",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom wocaw, wemote, ow distant memowy due to a demand miss."
  },
  {
    "EventCode": "0x000300000000C040",
    "EventName": "PM_INST_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x000340000000C040",
    "EventName": "PM_DATA_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x000300000010C040",
    "EventName": "PM_INST_FWOM_W2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x000340000020C040",
    "EventName": "PM_DATA_FWOM_W2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x003F00000000C040",
    "EventName": "PM_INST_FWOM_W1MISS",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss."
  },
  {
    "EventCode": "0x003F40000000C040",
    "EventName": "PM_DATA_FWOM_W1MISS",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss."
  },
  {
    "EventCode": "0x003F00000010C040",
    "EventName": "PM_INST_FWOM_W1MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x003F40000020C040",
    "EventName": "PM_DATA_FWOM_W1MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x000040000000C040",
    "EventName": "PM_DATA_FWOM_W2_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x000040000020C040",
    "EventName": "PM_DATA_FWOM_W2_NO_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x004040000000C040",
    "EventName": "PM_DATA_FWOM_W2_MEPF",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x004040000020C040",
    "EventName": "PM_DATA_FWOM_W2_MEPF_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x008040000000C040",
    "EventName": "PM_DATA_FWOM_W2_WDHITST_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict on wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x008040000020C040",
    "EventName": "PM_DATA_FWOM_W2_WDHITST_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict on wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x00C040000000C040",
    "EventName": "PM_DATA_FWOM_W2_OTHEW_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict othew than wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x00C040000020C040",
    "EventName": "PM_DATA_FWOM_W2_OTHEW_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict othew than wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x000380000000C040",
    "EventName": "PM_INST_FWOM_W2MISS",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x0003C0000000C040",
    "EventName": "PM_DATA_FWOM_W2MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss."
  },
  {
    "EventCode": "0x000380000010C040",
    "EventName": "PM_INST_FWOM_W2MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0003C0000020C040",
    "EventName": "PM_DATA_FWOM_W2MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x010300000000C040",
    "EventName": "PM_INST_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x010340000000C040",
    "EventName": "PM_DATA_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x010300000010C040",
    "EventName": "PM_INST_FWOM_W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x010340000020C040",
    "EventName": "PM_DATA_FWOM_W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x010040000000C040",
    "EventName": "PM_DATA_FWOM_W3_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x010040000020C040",
    "EventName": "PM_DATA_FWOM_W3_NO_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x014040000000C040",
    "EventName": "PM_DATA_FWOM_W3_MEPF",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x014040000020C040",
    "EventName": "PM_DATA_FWOM_W3_MEPF_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x01C040000000C040",
    "EventName": "PM_DATA_FWOM_W3_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x01C040000020C040",
    "EventName": "PM_DATA_FWOM_W3_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x000780000000C040",
    "EventName": "PM_INST_FWOM_W3MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x0007C0000000C040",
    "EventName": "PM_DATA_FWOM_W3MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss."
  },
  {
    "EventCode": "0x000780000010C040",
    "EventName": "PM_INST_FWOM_W3MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0007C0000020C040",
    "EventName": "PM_DATA_FWOM_W3MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080040000000C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080040000020C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x084040000000C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x084040000020C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080100000000C040",
    "EventName": "PM_INST_FWOM_W21_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080140000000C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080100000010C040",
    "EventName": "PM_INST_FWOM_W21_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080140000020C040",
    "EventName": "PM_DATA_FWOM_W21_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x088040000000C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x088040000020C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x08C040000000C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x08C040000020C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x088100000000C040",
    "EventName": "PM_INST_FWOM_W31_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x088140000000C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x088100000010C040",
    "EventName": "PM_INST_FWOM_W31_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x088140000020C040",
    "EventName": "PM_DATA_FWOM_W31_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080240000000C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080240000020C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x084240000000C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x084240000020C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080300000000C040",
    "EventName": "PM_INST_FWOM_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080340000000C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss."
  },
  {
    "EventCode": "0x080300000010C040",
    "EventName": "PM_INST_FWOM_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080340000020C040",
    "EventName": "PM_DATA_FWOM_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0040000000C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0040000020C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A4040000000C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A4040000020C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0100000000C040",
    "EventName": "PM_INST_FWOM_W21_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0140000000C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0100000010C040",
    "EventName": "PM_INST_FWOM_W21_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0140000020C040",
    "EventName": "PM_DATA_FWOM_W21_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A8040000000C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A8040000020C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0AC040000000C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0AC040000020C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A8100000000C040",
    "EventName": "PM_INST_FWOM_W31_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A8140000000C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A8100000010C040",
    "EventName": "PM_INST_FWOM_W31_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A8140000020C040",
    "EventName": "PM_DATA_FWOM_W31_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0240000000C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0240000020C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A4240000000C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A4240000020C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0300000000C040",
    "EventName": "PM_INST_FWOM_NON_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0340000000C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss."
  },
  {
    "EventCode": "0x0A0300000010C040",
    "EventName": "PM_INST_FWOM_NON_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0A0340000020C040",
    "EventName": "PM_DATA_FWOM_NON_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x094100000000C040",
    "EventName": "PM_INST_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's memowy due to a demand miss."
  },
  {
    "EventCode": "0x094040000000C040",
    "EventName": "PM_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's memowy due to a demand miss."
  },
  {
    "EventCode": "0x094100000010C040",
    "EventName": "PM_INST_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x094040000020C040",
    "EventName": "PM_DATA_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x098040000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache due to a demand miss."
  },
  {
    "EventCode": "0x098040000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x09C040000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI memowy due to a demand miss."
  },
  {
    "EventCode": "0x09C040000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x098100000000C040",
    "EventName": "PM_INST_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x098140000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x098100000010C040",
    "EventName": "PM_INST_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x098140000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0040000000C040",
    "EventName": "PM_DATA_FWOM_WW2_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0040000020C040",
    "EventName": "PM_DATA_FWOM_WW2_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C4040000000C040",
    "EventName": "PM_DATA_FWOM_WW2_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C4040000020C040",
    "EventName": "PM_DATA_FWOM_WW2_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0100000000C040",
    "EventName": "PM_INST_FWOM_WW2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0140000000C040",
    "EventName": "PM_DATA_FWOM_WW2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0100000010C040",
    "EventName": "PM_INST_FWOM_WW2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0140000020C040",
    "EventName": "PM_DATA_FWOM_WW2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C8040000000C040",
    "EventName": "PM_DATA_FWOM_WW3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C8040000020C040",
    "EventName": "PM_DATA_FWOM_WW3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0CC040000000C040",
    "EventName": "PM_DATA_FWOM_WW3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0CC040000020C040",
    "EventName": "PM_DATA_FWOM_WW3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C8100000000C040",
    "EventName": "PM_INST_FWOM_WW3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C8140000000C040",
    "EventName": "PM_DATA_FWOM_WW3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C8100000010C040",
    "EventName": "PM_INST_FWOM_WW3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C8140000020C040",
    "EventName": "PM_DATA_FWOM_WW3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0240000000C040",
    "EventName": "PM_DATA_FWOM_WW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0240000020C040",
    "EventName": "PM_DATA_FWOM_WW2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C4240000000C040",
    "EventName": "PM_DATA_FWOM_WW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C4240000020C040",
    "EventName": "PM_DATA_FWOM_WW2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0300000000C040",
    "EventName": "PM_INST_FWOM_WW2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0340000000C040",
    "EventName": "PM_DATA_FWOM_WW2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0300000010C040",
    "EventName": "PM_INST_FWOM_WW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0340000020C040",
    "EventName": "PM_DATA_FWOM_WW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0D4100000000C040",
    "EventName": "PM_INST_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x0D4040000000C040",
    "EventName": "PM_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x0D4100000010C040",
    "EventName": "PM_INST_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0D4040000020C040",
    "EventName": "PM_DATA_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0D8040000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache due to a demand miss."
  },
  {
    "EventCode": "0x0D8040000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0DC040000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI memowy due to a demand miss."
  },
  {
    "EventCode": "0x0DC040000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0D8100000000C040",
    "EventName": "PM_INST_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x0D8140000000C040",
    "EventName": "PM_DATA_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x0D8100000010C040",
    "EventName": "PM_INST_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0D8140000020C040",
    "EventName": "PM_DATA_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0040000000C040",
    "EventName": "PM_DATA_FWOM_DW2_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0040000020C040",
    "EventName": "PM_DATA_FWOM_DW2_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E4040000000C040",
    "EventName": "PM_DATA_FWOM_DW2_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E4040000020C040",
    "EventName": "PM_DATA_FWOM_DW2_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0100000000C040",
    "EventName": "PM_INST_FWOM_DW2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0140000000C040",
    "EventName": "PM_DATA_FWOM_DW2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0100000010C040",
    "EventName": "PM_INST_FWOM_DW2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0140000020C040",
    "EventName": "PM_DATA_FWOM_DW2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E8040000000C040",
    "EventName": "PM_DATA_FWOM_DW3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E8040000020C040",
    "EventName": "PM_DATA_FWOM_DW3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0EC040000000C040",
    "EventName": "PM_DATA_FWOM_DW3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0EC040000020C040",
    "EventName": "PM_DATA_FWOM_DW3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E8100000000C040",
    "EventName": "PM_INST_FWOM_DW3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E8140000000C040",
    "EventName": "PM_DATA_FWOM_DW3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E8100000010C040",
    "EventName": "PM_INST_FWOM_DW3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E8140000020C040",
    "EventName": "PM_DATA_FWOM_DW3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0240000000C040",
    "EventName": "PM_DATA_FWOM_DW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0240000020C040",
    "EventName": "PM_DATA_FWOM_DW2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E4240000000C040",
    "EventName": "PM_DATA_FWOM_DW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E4240000020C040",
    "EventName": "PM_DATA_FWOM_DW2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0300000000C040",
    "EventName": "PM_INST_FWOM_DW2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0340000000C040",
    "EventName": "PM_DATA_FWOM_DW2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss."
  },
  {
    "EventCode": "0x0E0300000010C040",
    "EventName": "PM_INST_FWOM_DW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0E0340000020C040",
    "EventName": "PM_DATA_FWOM_DW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0F4100000000C040",
    "EventName": "PM_INST_FWOM_DMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom distant memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x0F4040000000C040",
    "EventName": "PM_DATA_FWOM_DMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom distant memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x0F4100000010C040",
    "EventName": "PM_INST_FWOM_DMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom distant memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0F4040000020C040",
    "EventName": "PM_DATA_FWOM_DMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom distant memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0F8040000000C040",
    "EventName": "PM_DATA_FWOM_D_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache due to a demand miss."
  },
  {
    "EventCode": "0x0F8040000020C040",
    "EventName": "PM_DATA_FWOM_D_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0FC040000000C040",
    "EventName": "PM_DATA_FWOM_D_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI memowy due to a demand miss."
  },
  {
    "EventCode": "0x0FC040000020C040",
    "EventName": "PM_DATA_FWOM_D_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0F8100000000C040",
    "EventName": "PM_INST_FWOM_D_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x0F8140000000C040",
    "EventName": "PM_DATA_FWOM_D_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss."
  },
  {
    "EventCode": "0x0F8100000010C040",
    "EventName": "PM_INST_FWOM_D_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0F8140000020C040",
    "EventName": "PM_DATA_FWOM_D_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080B00000000C040",
    "EventName": "PM_INST_FWOM_ONCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss."
  },
  {
    "EventCode": "0x080B40000000C040",
    "EventName": "PM_DATA_FWOM_ONCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss."
  },
  {
    "EventCode": "0x080B00000010C040",
    "EventName": "PM_INST_FWOM_ONCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x080B40000020C040",
    "EventName": "PM_DATA_FWOM_ONCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0B00000000C040",
    "EventName": "PM_INST_FWOM_OFFCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0B40000000C040",
    "EventName": "PM_DATA_FWOM_OFFCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss."
  },
  {
    "EventCode": "0x0C0B00000010C040",
    "EventName": "PM_INST_FWOM_OFFCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x0C0B40000020C040",
    "EventName": "PM_DATA_FWOM_OFFCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x095900000000C040",
    "EventName": "PM_INST_FWOM_ANY_MEMOWY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x095840000000C040",
    "EventName": "PM_DATA_FWOM_ANY_MEMOWY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss."
  },
  {
    "EventCode": "0x095900000010C040",
    "EventName": "PM_INST_FWOM_ANY_MEMOWY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x095840000020C040",
    "EventName": "PM_DATA_FWOM_ANY_MEMOWY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss ow pwefetch wewoad."
  },
  {
    "EventCode": "0x000300000000C142",
    "EventName": "PM_MWK_INST_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x000340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x000300000010C142",
    "EventName": "PM_MWK_INST_FWOM_W2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x000340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x003F00000000C142",
    "EventName": "PM_MWK_INST_FWOM_W1MISS",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x003F40000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W1MISS",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x003F00000010C142",
    "EventName": "PM_MWK_INST_FWOM_W1MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x003F40000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W1MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W1 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x000040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x000040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_NO_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x004040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_MEPF",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x004040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_MEPF_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x008040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_WDHITST_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict on wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x008040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_WDHITST_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict on wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x00C040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_OTHEW_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict othew than wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x00C040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2_OTHEW_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data that had a dispatch confwict othew than wd-hit-stowe fwom the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x000380000000C142",
    "EventName": "PM_MWK_INST_FWOM_W2MISS",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0003C0000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W2MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x000380000010C142",
    "EventName": "PM_MWK_INST_FWOM_W2MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0003C0000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W2MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a souwce beyond the wocaw cowe's W2 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x010300000000C142",
    "EventName": "PM_MWK_INST_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x010340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x010300000010C142",
    "EventName": "PM_MWK_INST_FWOM_W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x010340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x010040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x010040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_NO_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded without dispatch confwicts with data NOT in the MEPF state fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x014040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_MEPF",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x014040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_MEPF_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with data in the MEPF state without dispatch confwicts fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x01C040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_CONFWICT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x01C040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W3_CONFWICT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x000780000000C142",
    "EventName": "PM_MWK_INST_FWOM_W3MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0007C0000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W3MISS_DSWC",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x000780000010C142",
    "EventName": "PM_MWK_INST_FWOM_W3MISS_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0007C0000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W3MISS_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom beyond the wocaw cowe's W3 due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x084040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x084040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W21_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W21_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x088040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x088040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x08C040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x08C040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x088100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W31_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x088140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x088100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W31_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x088140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x084240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x084240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080300000000C142",
    "EventName": "PM_MWK_INST_FWOM_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080300000010C142",
    "EventName": "PM_MWK_INST_FWOM_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in the same wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A4040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A4040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W21_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W21_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W21_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0AC040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0AC040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W31_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W31_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A8140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W31_NON_WEGENT_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A4240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A4240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0300000000C142",
    "EventName": "PM_MWK_INST_FWOM_NON_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0300000010C142",
    "EventName": "PM_MWK_INST_FWOM_NON_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0A0340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_NON_WEGENT_W2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 on the same chip in a diffewent wegent due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x094100000000C142",
    "EventName": "PM_MWK_INST_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x094040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x094100000010C142",
    "EventName": "PM_MWK_INST_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x094040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x098040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x098040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x09C040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x09C040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x098100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x098140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x098100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x098140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom the wocaw chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C4040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C4040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0100000000C142",
    "EventName": "PM_MWK_INST_FWOM_WW2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0100000010C142",
    "EventName": "PM_MWK_INST_FWOM_WW2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0CC040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0CC040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8100000000C142",
    "EventName": "PM_MWK_INST_FWOM_WW3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8100000010C142",
    "EventName": "PM_MWK_INST_FWOM_WW3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C8140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C4240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C4240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0300000000C142",
    "EventName": "PM_MWK_INST_FWOM_WW2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0300000010C142",
    "EventName": "PM_MWK_INST_FWOM_WW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a wemote chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D4100000000C142",
    "EventName": "PM_MWK_INST_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D4040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D4100000010C142",
    "EventName": "PM_MWK_INST_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D4040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_WMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom wemote memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0DC040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0DC040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8100000000C142",
    "EventName": "PM_MWK_INST_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8100000010C142",
    "EventName": "PM_MWK_INST_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0D8140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_W_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a wemote chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E4040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E4040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0100000000C142",
    "EventName": "PM_MWK_INST_FWOM_DW2",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0100000010C142",
    "EventName": "PM_MWK_INST_FWOM_DW2_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0EC040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0EC040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8100000000C142",
    "EventName": "PM_MWK_INST_FWOM_DW3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8100000010C142",
    "EventName": "PM_MWK_INST_FWOM_DW3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E8140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_SHW_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a vawid wine that was not in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E4240000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E4240000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_MOD_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded with a wine in the M (excwusive) state fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0300000000C142",
    "EventName": "PM_MWK_INST_FWOM_DW2W3",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0340000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0300000010C142",
    "EventName": "PM_MWK_INST_FWOM_DW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0E0340000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a distant chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F4100000000C142",
    "EventName": "PM_MWK_INST_FWOM_DMEM",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom distant memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F4040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_DMEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom distant memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F4100000010C142",
    "EventName": "PM_MWK_INST_FWOM_DMEM_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom distant memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F4040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_DMEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom distant memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0FC040000000C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_MEM",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0FC040000020C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_MEM_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8100000000C142",
    "EventName": "PM_MWK_INST_FWOM_D_OC_ANY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8140000000C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_ANY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8100000010C142",
    "EventName": "PM_MWK_INST_FWOM_D_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0F8140000020C142",
    "EventName": "PM_MWK_DATA_FWOM_D_OC_ANY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom a distant chip's OpenCAPI cache ow memowy due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080B00000000C142",
    "EventName": "PM_MWK_INST_FWOM_ONCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080B40000000C142",
    "EventName": "PM_MWK_DATA_FWOM_ONCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x080B00000010C142",
    "EventName": "PM_MWK_INST_FWOM_ONCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x080B40000020C142",
    "EventName": "PM_MWK_DATA_FWOM_ONCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom the same chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0B00000000C142",
    "EventName": "PM_MWK_INST_FWOM_OFFCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0B40000000C142",
    "EventName": "PM_MWK_DATA_FWOM_OFFCHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0B00000010C142",
    "EventName": "PM_MWK_INST_FWOM_OFFCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x0C0B40000020C142",
    "EventName": "PM_MWK_DATA_FWOM_OFFCHIP_CACHE_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom anothew cowe's W2 ow W3 fwom a diffewent chip due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x095900000000C142",
    "EventName": "PM_MWK_INST_FWOM_ANY_MEMOWY",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x095840000000C142",
    "EventName": "PM_MWK_DATA_FWOM_ANY_MEMOWY",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss fow a mawked instwuction."
  },
  {
    "EventCode": "0x095900000010C142",
    "EventName": "PM_MWK_INST_FWOM_ANY_MEMOWY_AWW",
    "BwiefDescwiption": "The pwocessow's instwuction cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  },
  {
    "EventCode": "0x095840000020C142",
    "EventName": "PM_MWK_DATA_FWOM_ANY_MEMOWY_AWW",
    "BwiefDescwiption": "The pwocessow's W1 data cache was wewoaded fwom any chip's memowy (MC swow) due to a demand miss ow pwefetch wewoad fow a mawked instwuction."
  }
]
