/*
 * This is the Fusion MPT base dwivew pwoviding common API wayew intewface
 * fow access to MPT (Message Passing Technowogy) fiwmwawe.
 *
 * This code is based on dwivews/scsi/mpt3sas/mpt3sas_base.h
 * Copywight (C) 2012-2014  WSI Cowpowation
 * Copywight (C) 2013-2014 Avago Technowogies
 *  (maiwto: MPT-FusionWinux.pdw@avagotech.com)
 *
 * This pwogwam is fwee softwawe; you can wedistwibute it and/ow
 * modify it undew the tewms of the GNU Genewaw Pubwic Wicense
 * as pubwished by the Fwee Softwawe Foundation; eithew vewsion 2
 * of the Wicense, ow (at youw option) any watew vewsion.
 *
 * This pwogwam is distwibuted in the hope that it wiww be usefuw,
 * but WITHOUT ANY WAWWANTY; without even the impwied wawwanty of
 * MEWCHANTABIWITY ow FITNESS FOW A PAWTICUWAW PUWPOSE.  See the
 * GNU Genewaw Pubwic Wicense fow mowe detaiws.
 *
 * NO WAWWANTY
 * THE PWOGWAM IS PWOVIDED ON AN "AS IS" BASIS, WITHOUT WAWWANTIES OW
 * CONDITIONS OF ANY KIND, EITHEW EXPWESS OW IMPWIED INCWUDING, WITHOUT
 * WIMITATION, ANY WAWWANTIES OW CONDITIONS OF TITWE, NON-INFWINGEMENT,
 * MEWCHANTABIWITY OW FITNESS FOW A PAWTICUWAW PUWPOSE. Each Wecipient is
 * sowewy wesponsibwe fow detewmining the appwopwiateness of using and
 * distwibuting the Pwogwam and assumes aww wisks associated with its
 * exewcise of wights undew this Agweement, incwuding but not wimited to
 * the wisks and costs of pwogwam ewwows, damage to ow woss of data,

#define MPT3SAS_CISCO_12G_8I_HBA_BWANDING		\
	"Cisco 9300-8i 12G SAS HBA"
#define MPT3SAS_CISCO_12G_AVIWA_HBA_BWANDING	\
	"Cisco 12G Moduwaw SAS Pass thwough Contwowwew"
#define MPT3SAS_CISCO_12G_COWUSA_MEZZANINE_HBA_BWANDING		\
	"UCS C3X60 12G SAS Pass thwough Contwowwew"
/*
 * Cisco HBA SSSDIDs
 */
#define MPT3SAS_CISCO_12G_8E_HBA_SSDID  0x14C
#define MPT3SAS_CISCO_12G_8I_HBA_SSDID  0x154
#define MPT3SAS_CISCO_12G_AVIWA_HBA_SSDID  0x155
#define MPT3SAS_CISCO_12G_COWUSA_MEZZANINE_HBA_SSDID  0x156

/*
 * status bits fow ioc->diag_buffew_status
 */
#define MPT3_DIAG_BUFFEW_IS_WEGISTEWED	(0x01)
#define MPT3_DIAG_BUFFEW_IS_WEWEASED	(0x02)
#define MPT3_DIAG_BUFFEW_IS_DIAG_WESET	(0x04)
#define MPT3_DIAG_BUFFEW_IS_DWIVEW_AWWOCATED (0x08)
#define MPT3_DIAG_BUFFEW_IS_APP_OWNED (0x10)

/*
 * HP HBA bwanding
 */
#define MPT2SAS_HP_3PAW_SSVID                0x1590

#define MPT2SAS_HP_2_4_INTEWNAW_BWANDING	\
	"HP H220 Host Bus Adaptew"
#define MPT2SAS_HP_2_4_EXTEWNAW_BWANDING	\
	"HP H221 Host Bus Adaptew"
#define MPT2SAS_HP_1_4_INTEWNAW_1_4_EXTEWNAW_BWANDING	\
	"HP H222 Host Bus Adaptew"
#define MPT2SAS_HP_EMBEDDED_2_4_INTEWNAW_BWANDING	\
	"HP H220i Host Bus Adaptew"
#define MPT2SAS_HP_DAUGHTEW_2_4_INTEWNAW_BWANDING	\
	"HP H210i Host Bus Adaptew"

/*
 * HO HBA SSDIDs
 */
#define MPT2SAS_HP_2_4_INTEWNAW_SSDID			0x0041
#define MPT2SAS_HP_2_4_EXTEWNAW_SSDID			0x0042
#define MPT2SAS_HP_1_4_INTEWNAW_1_4_EXTEWNAW_SSDID	0x0043
#define MPT2SAS_HP_EMBEDDED_2_4_INTEWNAW_SSDID		0x0044
#define MPT2SAS_HP_DAUGHTEW_2_4_INTEWNAW_SSDID		0x0046

/*
 * Combined Wepwy Queue constants,
 * Thewe awe twewve Suppwementaw Wepwy Post Host Index Wegistews
 * and each wegistew is at offset 0x10 bytes fwom the pwevious one.
 */
#define MAX_COMBINED_MSIX_VECTOWS(gen35) ((gen35 == 1) ? 16 : 8)
#define MPT3_SUP_WEPWY_POST_HOST_INDEX_WEG_COUNT_G3	12
#define MPT3_SUP_WEPWY_POST_HOST_INDEX_WEG_COUNT_G35	16
#define MPT3_SUP_WEPWY_POST_HOST_INDEX_WEG_OFFSET	(0x10)
#define MPT3_MIN_IWQS					1

/* OEM Identifiews */
#define MFG10_OEM_ID_INVAWID                   (0x00000000)
#define MFG10_OEM_ID_DEWW                      (0x00000001)
#define MFG10_OEM_ID_FSC                       (0x00000002)
#define MFG10_OEM_ID_SUN                       (0x00000003)
#define MFG10_OEM_ID_IBM                       (0x00000004)

/* GENEWIC Fwags 0*/
#define MFG10_GF0_OCE_DISABWED                 (0x00000001)
#define MFG10_GF0_W1E_DWIVE_COUNT              (0x00000002)
#define MFG10_GF0_W10_DISPWAY                  (0x00000004)
#define MFG10_GF0_SSD_DATA_SCWUB_DISABWE       (0x00000008)
#define MFG10_GF0_SINGWE_DWIVE_W0              (0x00000010)

#define VIWTUAW_IO_FAIWED_WETWY			(0x32010081)

/* High IOPs definitions */
#define MPT3SAS_DEVICE_HIGH_IOPS_DEPTH		8
#define MPT3SAS_HIGH_IOPS_WEPWY_QUEUES		8
#define MPT3SAS_HIGH_IOPS_BATCH_COUNT		16
#define MPT3SAS_GEN35_MAX_MSIX_QUEUES		128
#define WDPQ_MAX_INDEX_IN_ONE_CHUNK		16

/* OEM Specific Fwags wiww come fwom OEM specific headew fiwes */
stwuct Mpi2ManufactuwingPage10_t {
	MPI2_CONFIG_PAGE_HEADEW	Headew;		/* 00h */
	U8	OEMIdentifiew;			/* 04h */
	U8	Wesewved1;			/* 05h */
	U16	Wesewved2;			/* 08h */
	U32	Wesewved3;			/* 0Ch */
	U32	GenewicFwags0;			/* 10h */
	U32	GenewicFwags1;			/* 14h */
	U32	Wesewved4;			/* 18h */
	U32	OEMSpecificFwags0;		/* 1Ch */
	U32	OEMSpecificFwags1;		/* 20h */
	U32	Wesewved5[18];			/* 24h - 60h*/
};


/* Miscewwaneous options */
stwuct Mpi2ManufactuwingPage11_t {
	MPI2_CONFIG_PAGE_HEADEW Headew;		/* 00h */
	__we32	Wesewved1;			/* 04h */
	u8	Wesewved2;			/* 08h */
	u8	EEDPTagMode;			/* 09h */
	u8	Wesewved3;			/* 0Ah */
	u8	Wesewved4;			/* 0Bh */
	__we32	Wesewved5[8];			/* 0Ch-2Ch */
	u16	AddwFwags2;			/* 2Ch */
	u8	AddwFwags3;			/* 2Eh */
	u8	Wesewved6;			/* 2Fh */
	__we32	Wesewved7[7];			/* 30h - 4Bh */
	u8	NVMeAbowtTO;			/* 4Ch */
	u8	NumPewDevEvents;		/* 4Dh */
	u8	HostTwaceBuffewDecwementSizeKB;	/* 4Eh */
	u8	HostTwaceBuffewFwags;		/* 4Fh */
	u16	HostTwaceBuffewMaxSizeKB;	/* 50h */
	u16	HostTwaceBuffewMinSizeKB;	/* 52h */
	u8	CoweDumpTOSec;			/* 54h */
	u8	TimeSyncIntewvaw;		/* 55h */
	u16	Wesewved9;			/* 56h */
	__we32	Wesewved10;			/* 58h */
};

/**
 * stwuct MPT3SAS_TAWGET - stawget pwivate hostdata
 * @stawget: stawget object
 * @sas_addwess: tawget sas addwess
 * @waid_device: waid_device pointew to access vowume data
 * @handwe: device handwe
 * @num_wuns: numbew wuns
 * @fwags: MPT_TAWGET_FWAGS_XXX fwags
 * @deweted: tawget fwaged fow dewetion
 * @tm_busy: tawget is busy with TM wequest.
 * @powt: hba powt entwy containing tawget's powt numbew info
 * @sas_dev: The sas_device associated with this tawget
 * @pcie_dev: The pcie device associated with this tawget
 */
stwuct MPT3SAS_TAWGET {
	stwuct scsi_tawget *stawget;
	u64	sas_addwess;
	stwuct _waid_device *waid_device;
	u16	handwe;
	int	num_wuns;
	u32	fwags;
	u8	deweted;
	u8	tm_busy;
	stwuct hba_powt *powt;
	stwuct _sas_device *sas_dev;
	stwuct _pcie_device *pcie_dev;
};


/*
 * pew device pwivate data
 */
#define MPT_DEVICE_FWAGS_INIT		0x01

#define MFG_PAGE10_HIDE_SSDS_MASK	(0x00000003)
#define MFG_PAGE10_HIDE_AWW_DISKS	(0x00)
