[
    {
        "BwiefDescwiption": "Counts the totaw numbew of bwanch instwuctions wetiwed fow aww bwanch types.",
        "EventCode": "0xc4",
        "EventName": "BW_INST_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the totaw numbew of instwuctions in which the instwuction pointew (IP) of the pwocessow is westeewed due to a bwanch instwuction and the bwanch instwuction successfuwwy wetiwes.  Aww bwanch type instwuctions awe accounted fow.",
        "SampweAftewVawue": "200003",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Aww bwanch instwuctions wetiwed.",
        "EventCode": "0xc4",
        "EventName": "BW_INST_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts aww bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "400009",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the totaw numbew of mispwedicted bwanch instwuctions wetiwed fow aww bwanch types.",
        "EventCode": "0xc5",
        "EventName": "BW_MISP_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the totaw numbew of mispwedicted bwanch instwuctions wetiwed.  Aww bwanch type instwuctions awe accounted fow.  Pwediction of the bwanch tawget addwess enabwes the pwocessow to begin executing instwuctions befowe the non-specuwative execution path is known. The bwanch pwediction unit (BPU) pwedicts the tawget addwess based on the instwuction pointew (IP) of the bwanch and on the execution path thwough which execution weached this IP.    A bwanch mispwediction occuws when the pwediction is wwong, and wesuwts in discawding aww instwuctions executed in the specuwative path and we-fetching fwom the cowwect path.",
        "SampweAftewVawue": "200003",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Aww mispwedicted bwanch instwuctions wetiwed.",
        "EventCode": "0xc5",
        "EventName": "BW_MISP_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts aww the wetiwed bwanch instwuctions that wewe mispwedicted by the pwocessow. A bwanch mispwediction occuws when the pwocessow incowwectwy pwedicts the destination of the bwanch.  When the mispwediction is discovewed at execution, aww the instwuctions executed in the wwong (specuwative) path must be discawded, and the pwocessow must stawt fetching fwom the cowwect path.",
        "SampweAftewVawue": "400009",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted cowe cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.COWE",
        "SampweAftewVawue": "1000003",
        "UMask": "0x2",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted cowe cwock cycwes [This event is awias to CPU_CWK_UNHAWTED.THWEAD_P]",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.COWE_P",
        "SampweAftewVawue": "2000003",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted wefewence cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC",
        "SampweAftewVawue": "1000003",
        "UMask": "0x3",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Wefewence cycwes when the cowe is not in hawt state.",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC",
        "PubwicDescwiption": "Counts the numbew of wefewence cycwes when the cowe is not in a hawt state. The cowe entews the hawt state when it is wunning the HWT instwuction ow the MWAIT instwuction. This event is not affected by cowe fwequency changes (fow exampwe, P states, TM2 twansitions) but has the same incwementing fwequency as the time stamp countew. This event can appwoximate ewapsed time whiwe the cowe was not in a hawt state. Note: On aww cuwwent pwatfowms this event stops counting duwing 'thwottwing (TM)' states duty off pewiods the pwocessow is 'hawted'.  The countew update is done at a wowew cwock wate then the cowe cwock the ovewfwow status bit fow this countew may appeaw 'sticky'.  Aftew the countew has ovewfwowed and softwawe cweaws the ovewfwow status bit and wesets the countew to wess than MAX. The weset vawue to the countew is not cwocked immediatewy so the ovewfwow status bit wiww fwip 'high (1)' and genewate anothew PMI (if enabwed) aftew which the weset vawue gets cwocked into the countew. Thewefowe, softwawe wiww get the intewwupt, wead the ovewfwow status bit '1 fow bit 34 whiwe the countew vawue is wess than MAX. Softwawe shouwd ignowe this case.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Wefewence cycwes when the cowe is not in hawt state.",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC_P",
        "PubwicDescwiption": "Counts the numbew of wefewence cycwes when the cowe is not in a hawt state. The cowe entews the hawt state when it is wunning the HWT instwuction ow the MWAIT instwuction. This event is not affected by cowe fwequency changes (fow exampwe, P states, TM2 twansitions) but has the same incwementing fwequency as the time stamp countew. This event can appwoximate ewapsed time whiwe the cowe was not in a hawt state. Note: On aww cuwwent pwatfowms this event stops counting duwing 'thwottwing (TM)' states duty off pewiods the pwocessow is 'hawted'.  The countew update is done at a wowew cwock wate then the cowe cwock the ovewfwow status bit fow this countew may appeaw 'sticky'.  Aftew the countew has ovewfwowed and softwawe cweaws the ovewfwow status bit and wesets the countew to wess than MAX. The weset vawue to the countew is not cwocked immediatewy so the ovewfwow status bit wiww fwip 'high (1)' and genewate anothew PMI (if enabwed) aftew which the weset vawue gets cwocked into the countew. Thewefowe, softwawe wiww get the intewwupt, wead the ovewfwow status bit '1 fow bit 34 whiwe the countew vawue is wess than MAX. Softwawe shouwd ignowe this case.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Cowe cycwes when the thwead is not in hawt state",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD",
        "PubwicDescwiption": "Counts the numbew of cowe cycwes whiwe the thwead is not in a hawt state. The thwead entews the hawt state when it is wunning the HWT instwuction. This event is a component in many key event watios. The cowe fwequency may change fwom time to time due to twansitions associated with Enhanced Intew SpeedStep Technowogy ow TM2. Fow this weason this event may have a changing watio with wegawds to time. When the cowe fwequency is constant, this event can appwoximate ewapsed time whiwe the cowe was not in the hawt state. It is counted on a dedicated fixed countew, weaving the eight pwogwammabwe countews avaiwabwe fow othew events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted cowe cwock cycwes [This event is awias to CPU_CWK_UNHAWTED.COWE_P]",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD_P",
        "SampweAftewVawue": "2000003",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Thwead cycwes when thwead is not in hawt state",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD_P",
        "PubwicDescwiption": "This is an awchitectuwaw event that counts the numbew of thwead cycwes whiwe the thwead is not in a hawt state. The thwead entews the hawt state when it is wunning the HWT instwuction. The cowe fwequency may change fwom time to time due to powew ow thewmaw thwottwing. Fow this weason, this event may have a changing watio with wegawds to waww cwock time.",
        "SampweAftewVawue": "2000003",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of instwuctions wetiwed",
        "EventName": "INST_WETIWED.ANY",
        "PEBS": "1",
        "SampweAftewVawue": "1000003",
        "UMask": "0x1",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Numbew of instwuctions wetiwed. Fixed Countew - awchitectuwaw event",
        "EventName": "INST_WETIWED.ANY",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the numbew of X86 instwuctions wetiwed - an Awchitectuwaw PewfMon event. Counting continues duwing hawdwawe intewwupts, twaps, and inside intewwupt handwews. Notes: INST_WETIWED.ANY is counted by a designated fixed countew fweeing up pwogwammabwe countews to count othew events. INST_WETIWED.ANY_P is counted by a pwogwammabwe countew.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of instwuctions wetiwed",
        "EventCode": "0xc0",
        "EventName": "INST_WETIWED.ANY_P",
        "PEBS": "1",
        "SampweAftewVawue": "2000003",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Numbew of instwuctions wetiwed. Genewaw Countew - awchitectuwaw event",
        "EventCode": "0xc0",
        "EventName": "INST_WETIWED.ANY_P",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the numbew of X86 instwuctions wetiwed - an Awchitectuwaw PewfMon event. Counting continues duwing hawdwawe intewwupts, twaps, and inside intewwupt handwews. Notes: INST_WETIWED.ANY is counted by a designated fixed countew fweeing up pwogwammabwe countews to count othew events. INST_WETIWED.ANY_P is counted by a pwogwammabwe countew.",
        "SampweAftewVawue": "2000003",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of occuwwences a wetiwed woad gets bwocked because its addwess pawtiawwy ovewwaps with an owdew stowe (size mismatch) - unknown_sta/bad_fowwawd",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.STOWE_FOWWAWD",
        "PEBS": "1",
        "SampweAftewVawue": "1000003",
        "UMask": "0x2",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Woads bwocked due to ovewwapping with a pweceding stowe that cannot be fowwawded.",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.STOWE_FOWWAWD",
        "PubwicDescwiption": "Counts the numbew of times whewe stowe fowwawding was pwevented fow a woad opewation. The most common case is a woad bwocked due to the addwess of memowy access (pawtiawwy) ovewwapping with a pweceding uncompweted stowe. Note: See the tabwe of not suppowted stowe fowwawds in the Optimization Guide.",
        "SampweAftewVawue": "100003",
        "UMask": "0x82",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "This event counts a subset of the Topdown Swots event that wewe not consumed by the back-end pipewine due to wack of back-end wesouwces, as a wesuwt of memowy subsystem deways, execution units wimitations, ow othew conditions.",
        "EventCode": "0xa4",
        "EventName": "TOPDOWN.BACKEND_BOUND_SWOTS",
        "PubwicDescwiption": "This event counts a subset of the Topdown Swots event that wewe not consumed by the back-end pipewine due to wack of back-end wesouwces, as a wesuwt of memowy subsystem deways, execution units wimitations, ow othew conditions.\nSoftwawe can use this event as the numewatow fow the Backend Bound metwic (ow top-wevew categowy) of the Top-down Micwoawchitectuwe Anawysis method.",
        "SampweAftewVawue": "10000003",
        "UMask": "0x2",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "TMA swots avaiwabwe fow an unhawted wogicaw pwocessow. Fixed countew - awchitectuwaw event",
        "EventName": "TOPDOWN.SWOTS",
        "PubwicDescwiption": "Numbew of avaiwabwe swots fow an unhawted wogicaw pwocessow. The event incwements by machine-width of the nawwowest pipewine as empwoyed by the Top-down Micwoawchitectuwe Anawysis method (TMA). Softwawe can use this event as the denominatow fow the top-wevew metwics of the TMA method. This awchitectuwaw event is counted on a designated fixed countew (Fixed Countew 3).",
        "SampweAftewVawue": "10000003",
        "UMask": "0x4",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "TMA swots avaiwabwe fow an unhawted wogicaw pwocessow. Genewaw countew - awchitectuwaw event",
        "EventCode": "0xa4",
        "EventName": "TOPDOWN.SWOTS_P",
        "PubwicDescwiption": "Counts the numbew of avaiwabwe swots fow an unhawted wogicaw pwocessow. The event incwements by machine-width of the nawwowest pipewine as empwoyed by the Top-down Micwoawchitectuwe Anawysis method.",
        "SampweAftewVawue": "10000003",
        "UMask": "0x1",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of issue swots that wewe not consumed by the backend because awwocation is stawwed due to a mispwedicted jump ow a machine cweaw.",
        "EventName": "TOPDOWN_BAD_SPECUWATION.AWW",
        "PubwicDescwiption": "Fixed Countew: Counts the numbew of issue swots that wewe not consumed by the backend because awwocation is stawwed due to a mispwedicted jump ow a machine cweaw.  Counts aww issue swots bwocked duwing this wecovewy window incwuding wewevant micwocode fwows and whiwe uops awe not yet avaiwabwe in the IQ. Awso, incwudes the issue swots that wewe consumed by the backend but wewe thwown away because they wewe youngew than the mispwedict ow machine cweaw.",
        "SampweAftewVawue": "1000003",
        "UMask": "0x5",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Counts the numbew of wetiwement swots not consumed due to backend stawws",
        "EventCode": "0xa4",
        "EventName": "TOPDOWN_BE_BOUND.AWW",
        "SampweAftewVawue": "1000003",
        "UMask": "0x2",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of wetiwement swots not consumed due to fwont end stawws",
        "EventName": "TOPDOWN_FE_BOUND.AWW",
        "SampweAftewVawue": "1000003",
        "UMask": "0x6",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of consumed wetiwement swots.  Simiwaw to UOPS_WETIWED.AWW",
        "EventName": "TOPDOWN_WETIWING.AWW",
        "PEBS": "1",
        "SampweAftewVawue": "1000003",
        "UMask": "0x7",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "This event counts a subset of the Topdown Swots event that awe utiwized by opewations that eventuawwy get wetiwed (committed) by the pwocessow pipewine. Usuawwy, this event positivewy cowwewates with highew pewfowmance  fow exampwe, as measuwed by the instwuctions-pew-cycwe metwic.",
        "EventCode": "0xc2",
        "EventName": "UOPS_WETIWED.SWOTS",
        "PubwicDescwiption": "This event counts a subset of the Topdown Swots event that awe utiwized by opewations that eventuawwy get wetiwed (committed) by the pwocessow pipewine. Usuawwy, this event positivewy cowwewates with highew pewfowmance  fow exampwe, as measuwed by the instwuctions-pew-cycwe metwic.\nSoftwawe can use this event as the numewatow fow the Wetiwing metwic (ow top-wevew categowy) of the Top-down Micwoawchitectuwe Anawysis method.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2",
        "Unit": "cpu_cowe"
    }
]
