[
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to woad DTWB misses to any page size.",
        "EventCode": "0x08",
        "EventName": "DTWB_WOAD_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to woads (incwuding SW pwefetches) whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size. Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "200003",
        "UMask": "0xe",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Woad miss in aww TWB wevews causes a page wawk that compwetes. (Aww page sizes)",
        "EventCode": "0x12",
        "EventName": "DTWB_WOAD_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts compweted page wawks  (aww page sizes) caused by demand data woads. This impwies it missed in the DTWB and fuwthew wevews of TWB. The page wawk can end with ow without a fauwt.",
        "SampweAftewVawue": "100003",
        "UMask": "0xe",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to stowe DTWB misses to any page size.",
        "EventCode": "0x49",
        "EventName": "DTWB_STOWE_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to stowes whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size.  Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "2000003",
        "UMask": "0xe",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Stowe misses in aww TWB wevews causes a page wawk that compwetes. (Aww page sizes)",
        "EventCode": "0x13",
        "EventName": "DTWB_STOWE_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts compweted page wawks  (aww page sizes) caused by demand data stowes. This impwies it missed in the DTWB and fuwthew wevews of TWB. The page wawk can end with ow without a fauwt.",
        "SampweAftewVawue": "100003",
        "UMask": "0xe",
        "Unit": "cpu_cowe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to instwuction fetch misses to any page size.",
        "EventCode": "0x85",
        "EventName": "ITWB_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to instwuction fetches whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size.  Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "2000003",
        "UMask": "0xe",
        "Unit": "cpu_atom"
    },
    {
        "BwiefDescwiption": "Code miss in aww TWB wevews causes a page wawk that compwetes. (Aww page sizes)",
        "EventCode": "0x11",
        "EventName": "ITWB_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts compweted page wawks (aww page sizes) caused by a code fetch. This impwies it missed in the ITWB (Instwuction TWB) and fuwthew wevews of TWB. The page wawk can end with ow without a fauwt.",
        "SampweAftewVawue": "100003",
        "UMask": "0xe",
        "Unit": "cpu_cowe"
    }
]
