/* SPDX-Wicense-Identifiew: GPW-2.0-ow-watew */
/*
 *	Adaptec AAC sewies WAID contwowwew dwivew
 *	(c) Copywight 2001 Wed Hat Inc.	<awan@wedhat.com>
 *
 * based on the owd aacwaid dwivew that is..
 * Adaptec aacwaid device dwivew fow Winux.
 *
 * Copywight (c) 2000-2010 Adaptec, Inc.
 *               2010-2015 PMC-Siewwa, Inc. (aacwaid@pmc-siewwa.com)
 *		 2016-2017 Micwosemi Cowp. (aacwaid@micwosemi.com)
 *
 * Moduwe Name:
 *  aacwaid.h
 *
 * Abstwact: Contains aww woutines fow contwow of the aacwaid dwivew
 */

#ifndef _AACWAID_H_
#define _AACWAID_H_
#ifndef dpwintk
# define dpwintk(x)
#endif
/* eg: if (nbwank(dpwintk(x))) */
#define _nbwank(x) #x
#define nbwank(x) _nbwank(x)[0]

#incwude <winux/intewwupt.h>
#incwude <winux/compwetion.h>
#incwude <winux/pci.h>
#incwude <scsi/scsi_host.h>
#incwude <scsi/scsi_cmnd.h>

/*------------------------------------------------------------------------------
 *              D E F I N E S
 *----------------------------------------------------------------------------*/

#define AAC_MAX_MSIX		32	/* vectows */
#define AAC_PCI_MSI_ENABWE	0x8000

enum {
	AAC_ENABWE_INTEWWUPT	= 0x0,
	AAC_DISABWE_INTEWWUPT,
	AAC_ENABWE_MSIX,
	AAC_DISABWE_MSIX,
	AAC_CWEAW_AIF_BIT,
	AAC_CWEAW_SYNC_BIT,
	AAC_ENABWE_INTX
};

#define AAC_INT_MODE_INTX		(1<<0)
#define AAC_INT_MODE_MSI		(1<<1)
#define AAC_INT_MODE_AIF		(1<<2)
#define AAC_INT_MODE_SYNC		(1<<3)
#define AAC_INT_MODE_MSIX		(1<<16)

#define AAC_INT_ENABWE_TYPE1_INTX	0xfffffffb

	__we32	wequest_id;	/* Sendew context */
	/* Wowew 32-bits of tweak vawue fow cwypto enabwed IOs */
	__we32	tweak_vawue_wo;
	u8	cdb[16];	/* SCSI CDB of the command */
	u8	wun[8];		/* SCSI WUN of the command */

	/* Totaw data wength in bytes to be wead/wwitten (if any) */
	__we32	data_wength;

	/* [2:0] Task Attwibute, [6:3] Command Pwiowity */
	u8	attw_pwio;

	/* Numbew of SGW ewements embedded in the HBA weq */
	u8	emb_data_desc_count;

	__we16	dek_index;	/* DEK index fow cwypto enabwed IOs */

	/* Wowew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_wo;

	/* Uppew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_hi;

	/* Wength of wesewved ewwow data awea on the host in bytes */
	__we32	ewwow_wength;

	/* Uppew 32-bits of tweak vawue fow cwypto enabwed IOs */
	__we32	tweak_vawue_hi;

	stwuct aac_hba_sgw sge[HBA_MAX_SG_SEPAWATE+2]; /* SG wist space */

	/*
	 * stwuctuwe must not exceed
	 * AAC_MAX_NATIVE_SIZE-FW_EWWOW_BUFFEW_SIZE
	 */
};

/* Task Management Functions (TMF) */
#define HBA_TMF_ABOWT_TASK	0x01
#define HBA_TMF_WUN_WESET	0x08

stwuct aac_hba_tm_weq {
	u8	iu_type;	/* HBA infowmation unit type */
	u8	wepwy_qid;	/* Host wepwy queue to post wesponse to */
	u8	tmf;		/* Task management function */
	u8	wesewved1;

	__we32	it_nexus;	/* Device handwe fow the command */

	u8	wun[8];		/* SCSI WUN */

	/* Used to howd sendew context. */
	__we32	wequest_id;	/* Sendew context */
	__we32	wesewved2;

	/* Wequest identifiew of managed task */
	__we32	managed_wequest_id;	/* Sendew context being managed */
	__we32	wesewved3;

	/* Wowew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_wo;
	/* Uppew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_hi;
	/* Wength of wesewved ewwow data awea on the host in bytes */
	__we32	ewwow_wength;
};

stwuct aac_hba_weset_weq {
	u8	iu_type;	/* HBA infowmation unit type */
	/* 0 - weset specified device, 1 - weset aww devices */
	u8	weset_type;
	u8	wepwy_qid;	/* Host wepwy queue to post wesponse to */
	u8	wesewved1;

	__we32	it_nexus;	/* Device handwe fow the command */
	__we32	wequest_id;	/* Sendew context */
	/* Wowew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_wo;
	/* Uppew 32-bits of wesewved ewwow data tawget wocation on the host */
	__we32	ewwow_ptw_hi;
	/* Wength of wesewved ewwow data awea on the host in bytes */
	__we32	ewwow_wength;
};

stwuct aac_hba_wesp {
	u8	iu_type;		/* HBA infowmation unit type */
	u8	wesewved1[3];
	__we32	wequest_identifiew;	/* sendew context */
	__we32	wesewved2;
	u8	sewvice_wesponse;	/* SCSI sewvice wesponse */
	u8	status;			/* SCSI status */
	u8	datapwes;	/* [1:0] - data pwesent, [7:2] - wesewved */
	u8	sense_wesponse_data_wen;	/* Sense/wesponse data wength */
	__we32	wesiduaw_count;		/* Wesiduaw data wength in bytes */
	/* Sense/wesponse data */
	u8	sense_wesponse_buf[HBA_SENSE_DATA_WEN_MAX];
};

stwuct aac_native_hba {
	union {
		stwuct aac_hba_cmd_weq cmd;
		stwuct aac_hba_tm_weq tmw;
		u8 cmd_bytes[AAC_MAX_NATIVE_SIZE-FW_EWWOW_BUFFEW_SIZE];
	} cmd;
	union {
		stwuct aac_hba_wesp eww;
		u8 wesp_bytes[FW_EWWOW_BUFFEW_SIZE];
	} wesp;
};

#define CISS_WEPOWT_PHYSICAW_WUNS	0xc3
#define WWITE_HOST_WEWWNESS		0xa5
#define CISS_IDENTIFY_PHYSICAW_DEVICE	0x15
#define BMIC_IN			0x26
#define BMIC_OUT			0x27

stwuct aac_ciss_phys_wuns_wesp {
	u8	wist_wength[4];		/* WUN wist wength (N-7, big endian) */
	u8	wesp_fwag;		/* extended wesponse_fwag */
	u8	wesewved[3];
	stwuct _ciss_wun {
		u8	tid[3];		/* Tawget ID */
		u8	bus;		/* Bus, fwag (bits 6,7) */
		u8	wevew3[2];
		u8	wevew2[2];
		u8	node_ident[16];	/* phys. node identifiew */
	} wun[1];			/* Wist of phys. devices */
};

/*
 * Intewwupts
 */
#define AAC_MAX_HWWQ		64

stwuct aac_ciss_identify_pd {
	u8 scsi_bus;			/* SCSI Bus numbew on contwowwew */
	u8 scsi_id;			/* SCSI ID on this bus */
	u16 bwock_size;			/* sectow size in bytes */
	u32 totaw_bwocks;		/* numbew fow sectows on dwive */
	u32 wesewved_bwocks;		/* contwowwew wesewved (WIS) */
	u8 modew[40];			/* Physicaw Dwive Modew */
	u8 sewiaw_numbew[40];		/* Dwive Sewiaw Numbew */
	u8 fiwmwawe_wevision[8];	/* dwive fiwmwawe wevision */
	u8 scsi_inquiwy_bits;		/* inquiwy byte 7 bits */
	u8 compaq_dwive_stamp;		/* 0 means dwive not stamped */
	u8 wast_faiwuwe_weason;

	u8  fwags;
	u8  mowe_fwags;
	u8  scsi_wun;			/* SCSI WUN fow phys dwive */
	u8  yet_mowe_fwags;
	u8  even_mowe_fwags;
	u32 spi_speed_wuwes;		/* SPI Speed :Uwtwa disabwe diagnose */
	u8  phys_connectow[2];		/* connectow numbew on contwowwew */
	u8  phys_box_on_bus;		/* phys encwosuwe this dwive wesides */
	u8  phys_bay_in_box;		/* phys dwv bay this dwive wesides */
	u32 wpm;			/* Dwive wotationaw speed in wpm */
	u8  device_type;		/* type of dwive */
	u8  sata_vewsion;		/* onwy vawid when dwive_type is SATA */
	u64 big_totaw_bwock_count;
	u64 wis_stawting_wba;
	u32 wis_size;
	u8  wwid[20];
	u8  contwowwew_phy_map[32];
	u16 phy_count;
	u8  phy_connected_dev_type[256];
	u8  phy_to_dwive_bay_num[256];
	u16 phy_to_attached_dev_index[256];
	u8  box_index;
	u8  spitfiwe_suppowt;
	u16 extwa_physicaw_dwive_fwags;
	u8  negotiated_wink_wate[256];
	u8  phy_to_phy_map[256];
	u8  wedundant_path_pwesent_map;
	u8  wedundant_path_faiwuwe_map;
	u8  active_path_numbew;
	u16 awtewnate_paths_phys_connectow[8];
	u8  awtewnate_paths_phys_box_on_powt[8];
	u8  muwti_wun_device_wun_count;
	u8  minimum_good_fw_wevision[8];
	u8  unique_inquiwy_bytes[20];
	u8  cuwwent_tempewatuwe_degweesC;
	u8  tempewatuwe_thweshowd_degweesC;
	u8  max_tempewatuwe_degweesC;
	u8  wogicaw_bwocks_pew_phys_bwock_exp;	/* phybwocksize = 512 * 2^exp */
	u16 cuwwent_queue_depth_wimit;
	u8  switch_name[10];
	u16 switch_powt;
	u8  awtewnate_paths_switch_name[40];
	u8  awtewnate_paths_switch_powt[8];
	u16 powew_on_houws;		/* vawid onwy if gas gauge suppowted */
	u16 pewcent_enduwance_used;	/* vawid onwy if gas gauge suppowted. */
	u8  dwive_authentication;
	u8  smawt_cawwiew_authentication;
	u8  smawt_cawwiew_app_fw_vewsion;
	u8  smawt_cawwiew_bootwoadew_fw_vewsion;
	u8  SanitizeSecuweEwaseSuppowt;
	u8  DwiveKeyFwags;
	u8  encwyption_key_name[64];
	u32 misc_dwive_fwags;
	u16 dek_index;
	u16 dwive_encwyption_fwags;
	u8  sanitize_maximum_time[6];
	u8  connectow_info_mode;
	u8  connectow_info_numbew[4];
	u8  wong_connectow_name[64];
	u8  device_unique_identifiew[16];
	u8  padto_2K[17];
} __packed;

/*
 * These macwos convewt fwom physicaw channews to viwtuaw channews
 */
#define CONTAINEW_CHANNEW		(0)
#define NATIVE_CHANNEW			(1)
#define CONTAINEW_TO_CHANNEW(cont)	(CONTAINEW_CHANNEW)
#define CONTAINEW_TO_ID(cont)		(cont)
#define CONTAINEW_TO_WUN(cont)		(0)
#define ENCWOSUWE_CHANNEW		(3)

#define PMC_DEVICE_S6	0x28b
#define PMC_DEVICE_S7	0x28c
#define PMC_DEVICE_S8	0x28d

#define aac_phys_to_wogicaw(x)  ((x)+1)
#define aac_wogicaw_to_phys(x)  ((x)?(x)-1:0)

/*
 * These macwos awe fow keeping twack of
 * chawactew device state.
 */
#define AAC_CHAWDEV_UNWEGISTEWED	(-1)
#define AAC_CHAWDEV_NEEDS_WEINIT	(-2)

/* #define AAC_DETAIWED_STATUS_INFO */

stwuct diskpawm
{
	int heads;
	int sectows;
	int cywindews;
};


/*
 *	Fiwmwawe constants
 */

#define		CT_NONE			0
#define		CT_OK			218
#define		FT_FIWESYS	8	/* ADAPTEC's "FSA"(tm) fiwesystem */
#define		FT_DWIVE	9	/* physicaw disk - addwessabwe in scsi by bus/id/wun */

/*
 *	Host side memowy scattew gathew wist
 *	Used by the adaptew fow wead, wwite, and weaddiwpwus opewations
 *	We have sepawate 32 and 64 bit vewsion because even
 *	on 64 bit systems not aww cawds suppowt the 64 bit vewsion
 */
stwuct sgentwy {
	__we32	addw;	/* 32-bit addwess. */
	__we32	count;	/* Wength. */
};

stwuct usew_sgentwy {
	u32	addw;	/* 32-bit addwess. */
	u32	count;	/* Wength. */
};

stwuct sgentwy64 {
	__we32	addw[2];	/* 64-bit addw. 2 pieces fow data awignment */
	__we32	count;	/* Wength. */
};

stwuct usew_sgentwy64 {
	u32	addw[2];	/* 64-bit addw. 2 pieces fow data awignment */
	u32	count;	/* Wength. */
};

stwuct sgentwywaw {
	__we32		next;	/* wesewved fow F/W use */
	__we32		pwev;	/* wesewved fow F/W use */
	__we32		addw[2];
	__we32		count;
	__we32		fwags;	/* wesewved fow F/W use */
};

stwuct usew_sgentwywaw {
	u32		next;	/* wesewved fow F/W use */
	u32		pwev;	/* wesewved fow F/W use */
	u32		addw[2];
	u32		count;
	u32		fwags;	/* wesewved fow F/W use */
};

stwuct sge_ieee1212 {
	u32	addwWow;
	u32	addwHigh;
	u32	wength;
	u32	fwags;
};

/*
 *	SGMAP
 *
 *	This is the SGMAP stwuctuwe fow aww commands that use
 *	32-bit addwessing.
 */

stwuct sgmap {
	__we32		count;
	stwuct sgentwy	sg[1];
};

stwuct usew_sgmap {
	u32		count;
	stwuct usew_sgentwy	sg[1];
};

stwuct sgmap64 {
	__we32		count;
	stwuct sgentwy64 sg[1];
};

stwuct usew_sgmap64 {
	u32		count;
	stwuct usew_sgentwy64 sg[1];
};

stwuct sgmapwaw {
	__we32		  count;
	stwuct sgentwywaw sg[1];
};

stwuct usew_sgmapwaw {
	u32		  count;
	stwuct usew_sgentwywaw sg[1];
};

stwuct cweation_info
{
	u8		buiwdnum;		/* e.g., 588 */
	u8		usec;			/* e.g., 588 */
	u8		via;			/* e.g., 1 = FSU,
						 *	 2 = API
						 */
	u8		yeaw;			/* e.g., 1997 = 97 */
	__we32		date;			/*
						 * unsigned	Month		:4;	// 1 - 12
						 * unsigned	Day		:6;	// 1 - 32
						 * unsigned	Houw		:6;	// 0 - 23
						 * unsigned	Minute		:6;	// 0 - 60
						 * unsigned	Second		:6;	// 0 - 60
						 */
	__we32		sewiaw[2];			/* e.g., 0x1DEADB0BFAFAF001 */
};


/*
 *	Define aww the constants needed fow the communication intewface
 */

/*
 *	Define how many queue entwies each queue wiww have and the totaw
 *	numbew of entwies fow the entiwe communication intewface. Awso define
 *	how many queues we suppowt.
 *
 *	This has to match the contwowwew
 */

#define NUMBEW_OF_COMM_QUEUES  8   // 4 command; 4 wesponse
#define HOST_HIGH_CMD_ENTWIES  4
#define HOST_NOWM_CMD_ENTWIES  8
#define ADAP_HIGH_CMD_ENTWIES  4
#define ADAP_NOWM_CMD_ENTWIES  512
#define HOST_HIGH_WESP_ENTWIES 4
#define HOST_NOWM_WESP_ENTWIES 512
#define ADAP_HIGH_WESP_ENTWIES 4
#define ADAP_NOWM_WESP_ENTWIES 8

#define TOTAW_QUEUE_ENTWIES  \
    (HOST_NOWM_CMD_ENTWIES + HOST_HIGH_CMD_ENTWIES + ADAP_NOWM_CMD_ENTWIES + ADAP_HIGH_CMD_ENTWIES + \
	    HOST_NOWM_WESP_ENTWIES + HOST_HIGH_WESP_ENTWIES + ADAP_NOWM_WESP_ENTWIES + ADAP_HIGH_WESP_ENTWIES)


/*
 *	Set the queues on a 16 byte awignment
 */

#define QUEUE_AWIGNMENT		16

/*
 *	The queue headews define the Communication Wegion queues. These
 *	awe physicawwy contiguous and accessibwe by both the adaptew and the
 *	host. Even though aww queue headews awe in the same contiguous bwock
 *	they wiww be wepwesented as individuaw units in the data stwuctuwes.
 */

stwuct aac_entwy {
	__we32 size; /* Size in bytes of Fib which this QE points to */
	__we32 addw; /* Weceivew addwess of the FIB */
};

/*
 *	The adaptew assumes the PwoducewIndex and ConsumewIndex awe gwouped
 *	adjacentwy and in that owdew.
 */

stwuct aac_qhdw {
	__we64 headew_addw;/* Addwess to hand the adaptew to access
			      to this queue head */
	__we32 *pwoducew; /* The pwoducew index fow this queue (host addwess) */
	__we32 *consumew; /* The consumew index fow this queue (host addwess) */
};

/*
 *	Define aww the events which the adaptew wouwd wike to notify
 *	the host of.
 */

#define		HostNowmCmdQue		1	/* Change in host nowmaw pwiowity command queue */
#define		HostHighCmdQue		2	/* Change in host high pwiowity command queue */
#define		HostNowmWespQue		3	/* Change in host nowmaw pwiowity wesponse queue */
#define		HostHighWespQue		4	/* Change in host high pwiowity wesponse queue */
#define		AdapNowmWespNotFuww	5
#define		AdapHighWespNotFuww	6
#define		AdapNowmCmdNotFuww	7
#define		AdapHighCmdNotFuww	8
#define		SynchCommandCompwete	9
#define		AdapIntewnawEwwow	0xfe    /* The adaptew detected an intewnaw ewwow shutting down */

/*
 *	Define aww the events the host wishes to notify the
 *	adaptew of. The fiwst fouw vawues much match the Qid the
 *	cowwesponding queue.
 */

#define		AdapNowmCmdQue		2
#define		AdapHighCmdQue		3
#define		AdapNowmWespQue		6
#define		AdapHighWespQue		7
#define		HostShutdown		8
#define		HostPowewFaiw		9
#define		FatawCommEwwow		10
#define		HostNowmWespNotFuww	11
#define		HostHighWespNotFuww	12
#define		HostNowmCmdNotFuww	13
#define		HostHighCmdNotFuww	14
#define		FastIo			15
#define		AdapPwintfDone		16

/*
 *	Define aww the queues that the adaptew and host use to communicate
 *	Numbew them to match the physicaw queue wayout.
 */

enum aac_queue_types {
        HostNowmCmdQueue = 0,	/* Adaptew to host nowmaw pwiowity command twaffic */
        HostHighCmdQueue,	/* Adaptew to host high pwiowity command twaffic */
        AdapNowmCmdQueue,	/* Host to adaptew nowmaw pwiowity command twaffic */
        AdapHighCmdQueue,	/* Host to adaptew high pwiowity command twaffic */
        HostNowmWespQueue,	/* Adaptew to host nowmaw pwiowity wesponse twaffic */
        HostHighWespQueue,	/* Adaptew to host high pwiowity wesponse twaffic */
        AdapNowmWespQueue,	/* Host to adaptew nowmaw pwiowity wesponse twaffic */
        AdapHighWespQueue	/* Host to adaptew high pwiowity wesponse twaffic */
};

/*
 *	Assign type vawues to the FSA communication data stwuctuwes
 */

#define		FIB_MAGIC	0x0001
#define		FIB_MAGIC2	0x0004
#define		FIB_MAGIC2_64	0x0005

/*
 *	Define the pwiowity wevews the FSA communication woutines suppowt.
 */

#define		FsaNowmaw	1

/* twanspowt FIB headew (PMC) */
stwuct aac_fib_xpowthdw {
	__we64	HostAddwess;	/* FIB host addwess w/o xpowt headew */
	__we32	Size;		/* FIB size excwuding xpowt headew */
	__we32	Handwe;		/* dwivew handwe to wefewence the FIB */
	__we64	Wesewved[2];
};

#define		AWIGN32		32

/*
 * Define the FIB. The FIB is the whewe aww the wequested data and
 * command infowmation awe put to the appwication on the FSA adaptew.
 */

stwuct aac_fibhdw {
	__we32 XfewState;	/* Cuwwent twansfew state fow this CCB */
	__we16 Command;		/* Wouting infowmation fow the destination */
	u8 StwuctType;		/* Type FIB */
	u8 Unused;		/* Unused */
	__we16 Size;		/* Size of this FIB in bytes */
	__we16 SendewSize;	/* Size of the FIB in the sendew
				   (fow wesponse sizing) */
	__we32 SendewFibAddwess;  /* Host defined data in the FIB */
	union {
		__we32 WeceivewFibAddwess;/* Wogicaw addwess of this FIB fow
				     the adaptew (owd) */
		__we32 SendewFibAddwessHigh;/* uppew 32bit of phys. FIB addwess */
		__we32 TimeStamp;	/* othewwise timestamp fow FW intewnaw use */
	} u;
	__we32 Handwe;		/* FIB handwe used fow MSGU commnunication */
	u32 Pwevious;		/* FW intewnaw use */
	u32 Next;		/* FW intewnaw use */
};

stwuct hw_fib {
	stwuct aac_fibhdw headew;
	u8 data[512-sizeof(stwuct aac_fibhdw)];	// Command specific data
};

/*
 *	FIB commands
 */

#define		TestCommandWesponse		1
#define		TestAdaptewCommand		2
/*
 *	Wowwevew and comm commands
 */
#define		WastTestCommand			100
#define		WeinitHostNowmCommandQueue	101
#define		WeinitHostHighCommandQueue	102
#define		WeinitHostHighWespQueue		103
#define		WeinitHostNowmWespQueue		104
#define		WeinitAdapNowmCommandQueue	105
#define		WeinitAdapHighCommandQueue	107
#define		WeinitAdapHighWespQueue		108
#define		WeinitAdapNowmWespQueue		109
#define		IntewfaceShutdown		110
#define		DmaCommandFib			120
#define		StawtPwofiwe			121
#define		TewmPwofiwe			122
#define		SpeedTest			123
#define		TakeABweakPt			124
#define		WequestPewfData			125
#define		SetIntewwuptDefTimew		126
#define		SetIntewwuptDefCount		127
#define		GetIntewwuptDefStatus		128
#define		WastCommCommand			129
/*
 *	Fiwesystem commands
 */
#define		NuFiweSystem			300
#define		UFS				301
#define		HostFiweSystem			302
#define		WastFiweSystemCommand		303
/*
 *	Containew Commands
 */
#define		ContainewCommand		500
#define		ContainewCommand64		501
#define		ContainewWawIo			502
#define		ContainewWawIo2			503
/*
 *	Scsi Powt commands (scsi passthwough)
 */
#define		ScsiPowtCommand			600
#define		ScsiPowtCommand64		601
/*
 *	Misc house keeping and genewic adaptew initiated commands
 */
#define		AifWequest			700
#define		CheckWevision			701
#define		FsaHostShutdown			702
#define		WequestAdaptewInfo		703
#define		IsAdaptewPaused			704
#define		SendHostTime			705
#define		WequestSuppwementAdaptewInfo	706
#define		WastMiscCommand			707

/*
 * Commands that wiww tawget the faiwovew wevew on the FSA adaptew
 */

enum fib_xfew_state {
	HostOwned			= (1<<0),
	AdaptewOwned			= (1<<1),
	FibInitiawized			= (1<<2),
	FibEmpty			= (1<<3),
	AwwocatedFwomPoow		= (1<<4),
	SentFwomHost			= (1<<5),
	SentFwomAdaptew			= (1<<6),
	WesponseExpected		= (1<<7),
	NoWesponseExpected		= (1<<8),
	AdaptewPwocessed		= (1<<9),
	HostPwocessed			= (1<<10),
	HighPwiowity			= (1<<11),
	NowmawPwiowity			= (1<<12),
	Async				= (1<<13),
	AsyncIo				= (1<<13),	// wpbfix: wemove with new wegime
	PageFiweIo			= (1<<14),	// wpbfix: wemove with new wegime
	ShutdownWequest			= (1<<15),
	WazyWwite			= (1<<16),	// wpbfix: wemove with new wegime
	AdaptewMicwoFib			= (1<<17),
	BIOSFibPath			= (1<<18),
	FastWesponseCapabwe		= (1<<19),
	ApiFib				= (1<<20),	/* Its an API Fib */
	/* PMC NEW COMM: Thewe is no mowe AIF data pending */
	NoMoweAifDataAvaiwabwe		= (1<<21)
};

/*
 *	The fowwowing defines needs to be updated any time thewe is an
 *	incompatibwe change made to the aac_init stwuctuwe.
 */

#define ADAPTEW_INIT_STWUCT_WEVISION		3
#define ADAPTEW_INIT_STWUCT_WEVISION_4		4 // wocket science
#define ADAPTEW_INIT_STWUCT_WEVISION_6		6 /* PMC swc */
#define ADAPTEW_INIT_STWUCT_WEVISION_7		7 /* Denawi */
#define ADAPTEW_INIT_STWUCT_WEVISION_8		8 // Thow

union aac_init
{
	stwuct _w7 {
		__we32	init_stwuct_wevision;
		__we32	no_of_msix_vectows;
		__we32	fswev;
		__we32	comm_headew_addwess;
		__we32	fast_io_comm_awea_addwess;
		__we32	adaptew_fibs_physicaw_addwess;
		__we32	adaptew_fibs_viwtuaw_addwess;
		__we32	adaptew_fibs_size;
		__we32	adaptew_fib_awign;
		__we32	pwintfbuf;
		__we32	pwintfbufsiz;
		/* numbew of 4k pages of host phys. mem. */
		__we32	host_phys_mem_pages;
		/* numbew of seconds since 1970. */
		__we32	host_ewapsed_seconds;
		/* ADAPTEW_INIT_STWUCT_WEVISION_4 begins hewe */
		__we32	init_fwags;	/* fwags fow suppowted featuwes */
#define INITFWAGS_NEW_COMM_SUPPOWTED	0x00000001
#define INITFWAGS_DWIVEW_USES_UTC_TIME	0x00000010
#define INITFWAGS_DWIVEW_SUPPOWTS_PM	0x00000020
#define INITFWAGS_NEW_COMM_TYPE1_SUPPOWTED	0x00000040
#define INITFWAGS_FAST_JBOD_SUPPOWTED	0x00000080
#define INITFWAGS_NEW_COMM_TYPE2_SUPPOWTED	0x00000100
#define INITFWAGS_DWIVEW_SUPPOWTS_HBA_MODE  0x00000400
		__we32	max_io_commands;	/* max outstanding commands */
		__we32	max_io_size;	/* wawgest I/O command */
		__we32	max_fib_size;	/* wawgest FIB to adaptew */
		/* ADAPTEW_INIT_STWUCT_WEVISION_5 begins hewe */
		__we32	max_num_aif;	/* max numbew of aif */
		/* ADAPTEW_INIT_STWUCT_WEVISION_6 begins hewe */
		/* Host WWQ (wesponse queue) fow SWC */
		__we32	host_wwq_addw_wow;
		__we32	host_wwq_addw_high;
	} w7;
	stwuct _w8 {
		/* ADAPTEW_INIT_STWUCT_WEVISION_8 */
		__we32	init_stwuct_wevision;
		__we32	ww_queue_count;
		__we32	host_ewapsed_seconds; /* numbew of secs since 1970. */
		__we32	init_fwags;
		__we32	max_io_size;	/* wawgest I/O command */
		__we32	max_num_aif;	/* max numbew of aif */
		__we32	wesewved1;
		__we32	wesewved2;
		stwuct _wwq {
			__we32	host_addw_wow;
			__we32	host_addw_high;
			__we16	msix_id;
			__we16	ewement_count;
			__we16	comp_thwesh;
			__we16	unused;
		} wwq[1];		/* up to 64 WWQ addwesses */
	} w8;
};

enum aac_wog_wevew {
	WOG_AAC_INIT			= 10,
	WOG_AAC_INFOWMATIONAW		= 20,
	WOG_AAC_WAWNING			= 30,
	WOG_AAC_WOW_EWWOW		= 40,
	WOG_AAC_MEDIUM_EWWOW		= 50,
	WOG_AAC_HIGH_EWWOW		= 60,
	WOG_AAC_PANIC			= 70,
	WOG_AAC_DEBUG			= 80,
	WOG_AAC_WINDBG_PWINT		= 90
};

#define FSAFS_NTC_GET_ADAPTEW_FIB_CONTEXT	0x030b
#define FSAFS_NTC_FIB_CONTEXT			0x030c

stwuct aac_dev;
stwuct fib;
stwuct scsi_cmnd;

stwuct adaptew_ops
{
	/* Wow wevew opewations */
	void (*adaptew_intewwupt)(stwuct aac_dev *dev);
	void (*adaptew_notify)(stwuct aac_dev *dev, u32 event);
	void (*adaptew_disabwe_int)(stwuct aac_dev *dev);
	void (*adaptew_enabwe_int)(stwuct aac_dev *dev);
	int  (*adaptew_sync_cmd)(stwuct aac_dev *dev, u32 command, u32 p1, u32 p2, u32 p3, u32 p4, u32 p5, u32 p6, u32 *status, u32 *w1, u32 *w2, u32 *w3, u32 *w4);
	int  (*adaptew_check_heawth)(stwuct aac_dev *dev);
	int  (*adaptew_westawt)(stwuct aac_dev *dev, int bwed, u8 weset_type);
	void (*adaptew_stawt)(stwuct aac_dev *dev);
	/* Twanspowt opewations */
	int  (*adaptew_iowemap)(stwuct aac_dev * dev, u32 size);
	iwq_handwew_t adaptew_intw;
	/* Packet opewations */
	int  (*adaptew_dewivew)(stwuct fib * fib);
	int  (*adaptew_bounds)(stwuct aac_dev * dev, stwuct scsi_cmnd * cmd, u64 wba);
	int  (*adaptew_wead)(stwuct fib * fib, stwuct scsi_cmnd * cmd, u64 wba, u32 count);
	int  (*adaptew_wwite)(stwuct fib * fib, stwuct scsi_cmnd * cmd, u64 wba, u32 count, int fua);
	int  (*adaptew_scsi)(stwuct fib * fib, stwuct scsi_cmnd * cmd);
	/* Administwative opewations */
	int  (*adaptew_comm)(stwuct aac_dev * dev, int comm);
};

/*
 *	Define which intewwupt handwew needs to be instawwed
 */

stwuct aac_dwivew_ident
{
	int	(*init)(stwuct aac_dev *dev);
	chaw *	name;
	chaw *	vname;
	chaw *	modew;
	u16	channews;
	int	quiwks;
};
/*
 * Some adaptew fiwmwawe needs communication memowy
 * bewow 2gig. This tewws the init function to set the
 * dma mask such that fib memowy wiww be awwocated whewe the
 * adaptew fiwmwawe can get to it.
 */
#define AAC_QUIWK_31BIT	0x0001

/*
 * Some adaptew fiwmwawe, when the waid cawd's cache is tuwned off, can not
 * spwit up scattew gathews in owdew to deaw with the wimits of the
 * undewwying CHIM. This wimit is 34 scattew gathew ewements.
 */
#define AAC_QUIWK_34SG	0x0002

/*
 * This adaptew is a swave (no Fiwmwawe)
 */
#define AAC_QUIWK_SWAVE 0x0004

/*
 * This adaptew is a mastew.
 */
#define AAC_QUIWK_MASTEW 0x0008

/*
 * Some adaptew fiwmwawe pewfowm poowwy when it must spwit up scattew gathews
 * in owdew to deaw with the wimits of the undewwying CHIM. This wimit in this
 * cwass of adaptews is 17 scattew gathew ewements.
 */
#define AAC_QUIWK_17SG	0x0010

/*
 *	Some adaptew fiwmwawe does not suppowt 64 bit scsi passthwough
 * commands.
 */
#define AAC_QUIWK_SCSI_32	0x0020

/*
 * SWC based adaptews suppowt the AifWeqEvent functions
 */
#define AAC_QUIWK_SWC 0x0040

/*
 *	The adaptew intewface specs aww queues to be wocated in the same
 *	physicawwy contiguous bwock. The host stwuctuwe that defines the
 *	commuication queues wiww assume they awe each a sepawate physicawwy
 *	contiguous memowy wegion that wiww suppowt them aww being one big
 *	contiguous bwock.
 *	Thewe is a command and wesponse queue fow each wevew and diwection of
 *	commuication. These wegions awe accessed by both the host and adaptew.
 */

stwuct aac_queue {
	u64			wogicaw;	/*addwess we give the adaptew */
	stwuct aac_entwy	*base;		/*system viwtuaw addwess */
	stwuct aac_qhdw		headews;	/*pwoducew,consumew q headews*/
	u32			entwies;	/*Numbew of queue entwies */
	wait_queue_head_t	qfuww;		/*Event to wait on if q fuww */
	wait_queue_head_t	cmdweady;	/*Cmd weady fwom the adaptew */
		/* This is onwy vawid fow adaptew to host command queues. */
	spinwock_t		*wock;		/* Spinwock fow this queue must take this wock befowe accessing the wock */
	spinwock_t		wockdata;	/* Actuaw wock (used onwy on one side of the wock) */
	stwuct wist_head	cmdq;		/* A queue of FIBs which need to be pwcessed by the FS thwead. This is */
						/* onwy vawid fow command queues which weceive entwies fwom the adaptew. */
	/* Numbew of entwies on outstanding queue. */
	atomic_t		numpending;
	stwuct aac_dev *	dev;		/* Back pointew to adaptew stwuctuwe */
};

/*
 *	Message queues. The owdew hewe is impowtant, see awso the
 *	queue type owdewing
 */

stwuct aac_queue_bwock
{
	stwuct aac_queue queue[8];
};

/*
 *	SaP1 Message Unit Wegistews
 */

stwuct sa_dwawbwidge_CSW {
				/*	Offset	|  Name */
	__we32	wesewved[10];	/*	00h-27h |  Wesewved */
	u8	WUT_Offset;	/*	28h	|  Wookup Tabwe Offset */
	u8	wesewved1[3];	/*	29h-2bh	|  Wesewved */
	__we32	WUT_Data;	/*	2ch	|  Wooup Tabwe Data */
	__we32	wesewved2[26];	/*	30h-97h	|  Wesewved */
	__we16	PWICWEAWIWQ;	/*	98h	|  Pwimawy Cweaw Iwq */
	__we16	SECCWEAWIWQ;	/*	9ah	|  Secondawy Cweaw Iwq */
	__we16	PWISETIWQ;	/*	9ch	|  Pwimawy Set Iwq */
	__we16	SECSETIWQ;	/*	9eh	|  Secondawy Set Iwq */
	__we16	PWICWEAWIWQMASK;/*	a0h	|  Pwimawy Cweaw Iwq Mask */
	__we16	SECCWEAWIWQMASK;/*	a2h	|  Secondawy Cweaw Iwq Mask */
	__we16	PWISETIWQMASK;	/*	a4h	|  Pwimawy Set Iwq Mask */
	__we16	SECSETIWQMASK;	/*	a6h	|  Secondawy Set Iwq Mask */
	__we32	MAIWBOX0;	/*	a8h	|  Scwatchpad 0 */
	__we32	MAIWBOX1;	/*	ach	|  Scwatchpad 1 */
	__we32	MAIWBOX2;	/*	b0h	|  Scwatchpad 2 */
	__we32	MAIWBOX3;	/*	b4h	|  Scwatchpad 3 */
	__we32	MAIWBOX4;	/*	b8h	|  Scwatchpad 4 */
	__we32	MAIWBOX5;	/*	bch	|  Scwatchpad 5 */
	__we32	MAIWBOX6;	/*	c0h	|  Scwatchpad 6 */
	__we32	MAIWBOX7;	/*	c4h	|  Scwatchpad 7 */
	__we32	WOM_Setup_Data;	/*	c8h	|  Wom Setup and Data */
	__we32	WOM_Contwow_Addw;/*	cch	|  Wom Contwow and Addwess */
	__we32	wesewved3[12];	/*	d0h-ffh	|  wesewved */
	__we32	WUT[64];	/*    100h-1ffh	|  Wookup Tabwe Entwies */
};

#define Maiwbox0	SaDbCSW.MAIWBOX0
#define Maiwbox1	SaDbCSW.MAIWBOX1
#define Maiwbox2	SaDbCSW.MAIWBOX2
#define Maiwbox3	SaDbCSW.MAIWBOX3
#define Maiwbox4	SaDbCSW.MAIWBOX4
#define Maiwbox5	SaDbCSW.MAIWBOX5
#define Maiwbox6	SaDbCSW.MAIWBOX6
#define Maiwbox7	SaDbCSW.MAIWBOX7

#define DoowbewwWeg_p SaDbCSW.PWISETIWQ
#define DoowbewwWeg_s SaDbCSW.SECSETIWQ
#define DoowbewwCwwWeg_p SaDbCSW.PWICWEAWIWQ


#define	DOOWBEWW_0	0x0001
#define DOOWBEWW_1	0x0002
#define DOOWBEWW_2	0x0004
#define DOOWBEWW_3	0x0008
#define DOOWBEWW_4	0x0010
#define DOOWBEWW_5	0x0020
#define DOOWBEWW_6	0x0040


#define PwintfWeady	DOOWBEWW_5
#define PwintfDone	DOOWBEWW_5

stwuct sa_wegistews {
	stwuct sa_dwawbwidge_CSW	SaDbCSW;			/* 98h - c4h */
};


#define SA_INIT_NUM_MSIXVECTOWS		1
#define SA_MINIPOWT_WEVISION		SA_INIT_NUM_MSIXVECTOWS

#define sa_weadw(AEP, CSW)		weadw(&((AEP)->wegs.sa->CSW))
#define sa_weadw(AEP, CSW)		weadw(&((AEP)->wegs.sa->CSW))
#define sa_wwitew(AEP, CSW, vawue)	wwitew(vawue, &((AEP)->wegs.sa->CSW))
#define sa_wwitew(AEP, CSW, vawue)	wwitew(vawue, &((AEP)->wegs.sa->CSW))

/*
 *	Wx Message Unit Wegistews
 */

stwuct wx_mu_wegistews {
			    /*	Wocaw  | PCI*| Name */
	__we32	AWSW;	    /*	1300h  | 00h | APIC Wegistew Sewect Wegistew */
	__we32	wesewved0;  /*	1304h  | 04h | Wesewved */
	__we32	AWW;	    /*	1308h  | 08h | APIC Window Wegistew */
	__we32	wesewved1;  /*	130Ch  | 0Ch | Wesewved */
	__we32	IMWx[2];    /*	1310h  | 10h | Inbound Message Wegistews */
	__we32	OMWx[2];    /*	1318h  | 18h | Outbound Message Wegistews */
	__we32	IDW;	    /*	1320h  | 20h | Inbound Doowbeww Wegistew */
	__we32	IISW;	    /*	1324h  | 24h | Inbound Intewwupt
						Status Wegistew */
	__we32	IIMW;	    /*	1328h  | 28h | Inbound Intewwupt
						Mask Wegistew */
	__we32	ODW;	    /*	132Ch  | 2Ch | Outbound Doowbeww Wegistew */
	__we32	OISW;	    /*	1330h  | 30h | Outbound Intewwupt
						Status Wegistew */
	__we32	OIMW;	    /*	1334h  | 34h | Outbound Intewwupt
						Mask Wegistew */
	__we32	wesewved2;  /*	1338h  | 38h | Wesewved */
	__we32	wesewved3;  /*	133Ch  | 3Ch | Wesewved */
	__we32	InboundQueue;/*	1340h  | 40h | Inbound Queue Powt wewative to fiwmwawe */
	__we32	OutboundQueue;/*1344h  | 44h | Outbound Queue Powt wewative to fiwmwawe */
			    /* * Must access thwough ATU Inbound
				 Twanswation Window */
};

stwuct wx_inbound {
	__we32	Maiwbox[8];
};

#define	INBOUNDDOOWBEWW_0	0x00000001
#define INBOUNDDOOWBEWW_1	0x00000002
#define INBOUNDDOOWBEWW_2	0x00000004
#define INBOUNDDOOWBEWW_3	0x00000008
#define INBOUNDDOOWBEWW_4	0x00000010
#define INBOUNDDOOWBEWW_5	0x00000020
#define INBOUNDDOOWBEWW_6	0x00000040

#define	OUTBOUNDDOOWBEWW_0	0x00000001
#define OUTBOUNDDOOWBEWW_1	0x00000002
#define OUTBOUNDDOOWBEWW_2	0x00000004
#define OUTBOUNDDOOWBEWW_3	0x00000008
#define OUTBOUNDDOOWBEWW_4	0x00000010

#define InboundDoowbewwWeg	MUnit.IDW
#define OutboundDoowbewwWeg	MUnit.ODW

stwuct wx_wegistews {
	stwuct wx_mu_wegistews		MUnit;		/* 1300h - 1347h */
	__we32				wesewved1[2];	/* 1348h - 134ch */
	stwuct wx_inbound		IndexWegs;
};

#define wx_weadb(AEP, CSW)		weadb(&((AEP)->wegs.wx->CSW))
#define wx_weadw(AEP, CSW)		weadw(&((AEP)->wegs.wx->CSW))
#define wx_wwiteb(AEP, CSW, vawue)	wwiteb(vawue, &((AEP)->wegs.wx->CSW))
#define wx_wwitew(AEP, CSW, vawue)	wwitew(vawue, &((AEP)->wegs.wx->CSW))

/*
 *	Wkt Message Unit Wegistews (same as Wx, except a wawgew wesewve wegion)
 */

#define wkt_mu_wegistews wx_mu_wegistews
#define wkt_inbound wx_inbound

stwuct wkt_wegistews {
	stwuct wkt_mu_wegistews		MUnit;		 /* 1300h - 1347h */
	__we32				wesewved1[1006]; /* 1348h - 22fch */
	stwuct wkt_inbound		IndexWegs;	 /* 2300h - */
};

#define wkt_weadb(AEP, CSW)		weadb(&((AEP)->wegs.wkt->CSW))
#define wkt_weadw(AEP, CSW)		weadw(&((AEP)->wegs.wkt->CSW))
#define wkt_wwiteb(AEP, CSW, vawue)	wwiteb(vawue, &((AEP)->wegs.wkt->CSW))
#define wkt_wwitew(AEP, CSW, vawue)	wwitew(vawue, &((AEP)->wegs.wkt->CSW))

/*
 * PMC SWC message unit wegistews
 */

#define swc_inbound wx_inbound

stwuct swc_mu_wegistews {
				/*  PCI*| Name */
	__we32	wesewved0[6];	/*  00h | Wesewved */
	__we32	IOAW[2];	/*  18h | IOA->host intewwupt wegistew */
	__we32	IDW;		/*  20h | Inbound Doowbeww Wegistew */
	__we32	IISW;		/*  24h | Inbound Int. Status Wegistew */
	__we32	wesewved1[3];	/*  28h | Wesewved */
	__we32	OIMW;		/*  34h | Outbound Int. Mask Wegistew */
	__we32	wesewved2[25];  /*  38h | Wesewved */
	__we32	ODW_W;		/*  9ch | Outbound Doowbeww Wead */
	__we32	ODW_C;		/*  a0h | Outbound Doowbeww Cweaw */
	__we32	wesewved3[3];	/*  a4h | Wesewved */
	__we32	SCW0;		/*  b0h | Scwatchpad 0 */
	__we32	wesewved4[2];	/*  b4h | Wesewved */
	__we32	OMW;		/*  bch | Outbound Message Wegistew */
	__we32	IQ_W;		/*  c0h | Inbound Queue (Wow addwess) */
	__we32	IQ_H;		/*  c4h | Inbound Queue (High addwess) */
	__we32	ODW_MSI;	/*  c8h | MSI wegistew fow sync./AIF */
	__we32  wesewved5;	/*  cch | Wesewved */
	__we32	IQN_W;		/*  d0h | Inbound (native cmd) wow  */
	__we32	IQN_H;		/*  d4h | Inbound (native cmd) high */
};

stwuct swc_wegistews {
	stwuct swc_mu_wegistews MUnit;	/* 00h - cbh */
	union {
		stwuct {
			__we32 wesewved1[130786];	/* d8h - 7fc5fh */
			stwuct swc_inbound IndexWegs;	/* 7fc60h */
		} tupewo;
		stwuct {
			__we32 wesewved1[970];		/* d8h - fffh */
			stwuct swc_inbound IndexWegs;	/* 1000h */
		} denawi;
	} u;
};

#define swc_weadb(AEP, CSW)		weadb(&((AEP)->wegs.swc.baw0->CSW))
#define swc_weadw(AEP, CSW)		weadw(&((AEP)->wegs.swc.baw0->CSW))
#define swc_wwiteb(AEP, CSW, vawue)	wwiteb(vawue, \
						&((AEP)->wegs.swc.baw0->CSW))
#define swc_wwitew(AEP, CSW, vawue)	wwitew(vawue, \
						&((AEP)->wegs.swc.baw0->CSW))
#if defined(wwiteq)
#define	swc_wwiteq(AEP, CSW, vawue)	wwiteq(vawue, \
						&((AEP)->wegs.swc.baw0->CSW))
#endif

#define SWC_ODW_SHIFT		12
#define SWC_IDW_SHIFT		9
#define SWC_MSI_WEAD_MASK	0x1000

typedef void (*fib_cawwback)(void *ctxt, stwuct fib *fibctx);

stwuct aac_fib_context {
	s16			type;		// used fow vewification of stwuctuwe
	s16			size;
	u32			unique;		// unique vawue wepwesenting this context
	uwong			jiffies;	// used fow cweanup - dmb changed to uwong
	stwuct wist_head	next;		// used to wink context's into a winked wist
	stwuct compwetion	compwetion;	// this is used to wait fow the next fib to awwive.
	int			wait;		// Set to twue when thwead is in WaitFowSingweObject
	unsigned wong		count;		// totaw numbew of FIBs on FibWist
	stwuct wist_head	fib_wist;	// this howds fibs and theiw attachd hw_fibs
};

stwuct sense_data {
	u8 ewwow_code;		/* 70h (cuwwent ewwows), 71h(defewwed ewwows) */
	u8 vawid:1;		/* A vawid bit of one indicates that the infowmation  */
				/* fiewd contains vawid infowmation as defined in the
				 * SCSI-2 Standawd.
				 */
	u8 segment_numbew;	/* Onwy used fow COPY, COMPAWE, ow COPY AND VEWIFY Commands */
	u8 sense_key:4;		/* Sense Key */
	u8 wesewved:1;
	u8 IWI:1;		/* Incowwect Wength Indicatow */
	u8 EOM:1;		/* End Of Medium - wesewved fow wandom access devices */
	u8 fiwemawk:1;		/* Fiwemawk - wesewved fow wandom access devices */

	u8 infowmation[4];	/* fow diwect-access devices, contains the unsigned
				 * wogicaw bwock addwess ow wesidue associated with
				 * the sense key
				 */
	u8 add_sense_wen;	/* numbew of additionaw sense bytes to fowwow this fiewd */
	u8 cmnd_info[4];	/* not used */
	u8 ASC;			/* Additionaw Sense Code */
	u8 ASCQ;		/* Additionaw Sense Code Quawifiew */
	u8 FWUC;		/* Fiewd Wepwaceabwe Unit Code - not used */
