[
    {
        "BwiefDescwiption": "Counts once fow most SIMD 128-bit packed computationaw doubwe pwecision fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.128B_PACKED_DOUBWE",
        "PubwicDescwiption": "Counts once fow most SIMD 128-bit packed computationaw doubwe pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 2 computation opewations, one fow each ewement.  Appwies to packed doubwe pwecision fwoating-point instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX SQWT DPP FM(N)ADD/SUB.  DPP and FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD 128-bit packed computationaw singwe pwecision fwoating-point instwuction wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.128B_PACKED_SINGWE",
        "PubwicDescwiption": "Counts once fow most SIMD 128-bit packed computationaw singwe pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 4 computation opewations, one fow each ewement.  Appwies to packed singwe pwecision fwoating-point instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX SQWT WSQWT WCP DPP FM(N)ADD/SUB.  DPP and FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD 256-bit packed doubwe computationaw pwecision fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.256B_PACKED_DOUBWE",
        "PubwicDescwiption": "Counts once fow most SIMD 256-bit packed doubwe computationaw pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 4 computation opewations, one fow each ewement.  Appwies to packed doubwe pwecision fwoating-point instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX SQWT FM(N)ADD/SUB.  FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD 256-bit packed singwe computationaw pwecision fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.256B_PACKED_SINGWE",
        "PubwicDescwiption": "Counts once fow most SIMD 256-bit packed singwe computationaw pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 8 computation opewations, one fow each ewement.  Appwies to packed singwe pwecision fwoating-point instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX SQWT WSQWT WCP DPP FM(N)ADD/SUB.  DPP and FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x20"
    },
    {
        "BwiefDescwiption": "Numbew of SSE/AVX computationaw 128-bit packed singwe and 256-bit packed doubwe pwecision FP instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 2 ow/and 4 computation opewations, 1 fow each ewement.  Appwies to SSE* and AVX* packed singwe pwecision and packed doubwe pwecision FP instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX WCP14 WSQWT14 SQWT DPP FM(N)ADD/SUB.  DPP and FM(N)ADD/SUB count twice as they pewfowm 2 cawcuwations pew ewement.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.4_FWOPS",
        "PubwicDescwiption": "Numbew of SSE/AVX computationaw 128-bit packed singwe pwecision and 256-bit packed doubwe pwecision  fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 2 ow/and 4 computation opewations, one fow each ewement.  Appwies to SSE* and AVX* packed singwe pwecision fwoating-point and packed doubwe pwecision fwoating-point instwuctions: ADD SUB HADD HSUB SUBADD MUW DIV MIN MAX WCP14 WSQWT14 SQWT DPP FM(N)ADD/SUB.  DPP and FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "1000003",
        "UMask": "0x18"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD scawaw computationaw fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.SCAWAW",
        "PubwicDescwiption": "Counts once fow most SIMD scawaw computationaw singwe pwecision and doubwe pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 1 computationaw opewation. Appwies to SIMD scawaw singwe pwecision fwoating-point instwuctions: ADD SUB MUW DIV MIN MAX SQWT WSQWT WCP FM(N)ADD/SUB.  FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD scawaw computationaw doubwe pwecision fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.SCAWAW_DOUBWE",
        "PubwicDescwiption": "Counts once fow most SIMD scawaw computationaw doubwe pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 1 computationaw opewation. Appwies to SIMD scawaw doubwe pwecision fwoating-point instwuctions: ADD SUB MUW DIV MIN MAX SQWT FM(N)ADD/SUB.  FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts once fow most SIMD scawaw computationaw singwe pwecision fwoating-point instwuctions wetiwed. Counts twice fow DPP and FM(N)ADD/SUB instwuctions wetiwed.",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.SCAWAW_SINGWE",
        "PubwicDescwiption": "Counts once fow most SIMD scawaw computationaw singwe pwecision fwoating-point instwuctions wetiwed; some instwuctions wiww count twice as noted bewow.  Each count wepwesents 1 computationaw opewation. Appwies to SIMD scawaw singwe pwecision fwoating-point instwuctions: ADD SUB MUW DIV MIN MAX SQWT WSQWT WCP FM(N)ADD/SUB.  FM(N)ADD/SUB instwuctions count twice as they pewfowm 2 cawcuwations pew ewement. The DAZ and FTZ fwags in the MXCSW wegistew need to be set when using these events.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Numbew of any Vectow wetiwed FP awithmetic instwuctions",
        "EventCode": "0xC7",
        "EventName": "FP_AWITH_INST_WETIWED.VECTOW",
        "SampweAftewVawue": "2000003",
        "UMask": "0xfc"
    },
    {
        "BwiefDescwiption": "Cycwes with any input/output SSE ow FP assist",
        "CountewMask": "1",
        "EventCode": "0xCA",
        "EventName": "FP_ASSIST.ANY",
        "PubwicDescwiption": "Counts cycwes with any input and output SSE ow x87 FP assist. If an input and output assist awe detected on the same cycwe the event incwements by 1.",
        "SampweAftewVawue": "100003",
        "UMask": "0x1e"
    }
]
