[
  {
    "EventCode": "0x300F4",
    "EventName": "PM_THWD_CONC_WUN_INST",
    "BwiefDescwiption": "PPC Instwuctions Finished by this thwead when aww thweads in the cowe had the wun-watch set"
  },
  {
    "EventCode": "0x1E056",
    "EventName": "PM_CMPWU_STAWW_FWUSH_ANY_THWEAD",
    "BwiefDescwiption": "Cycwes in which the NTC instwuction is not awwowed to compwete because any of the 4 thweads in the same cowe suffewed a fwush, which bwocks compwetion"
  },
  {
    "EventCode": "0x4D016",
    "EventName": "PM_CMPWU_STAWW_FXWONG",
    "BwiefDescwiption": "Compwetion staww due to a wong watency scawaw fixed point instwuction (division, squawe woot)"
  },
  {
    "EventCode": "0x2D016",
    "EventName": "PM_CMPWU_STAWW_FXU",
    "BwiefDescwiption": "Finish staww due to a scawaw fixed point ow CW instwuction in the execution pipewine. These instwuctions get wouted to the AWU, AWU2, and DIV pipes"
  },
  {
    "EventCode": "0x4D12A",
    "EventName": "PM_MWK_DATA_FWOM_WW4_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad fwom anothew chip's W4 on the same Node ow Gwoup ( Wemote) due to a mawked woad"
  },
  {
    "EventCode": "0x1003C",
    "EventName": "PM_CMPWU_STAWW_DMISS_W2W3",
    "BwiefDescwiption": "Compwetion staww by Dcache miss which wesowved in W2/W3"
  },
  {
    "EventCode": "0x4C014",
    "EventName": "PM_CMPWU_STAWW_WMQ_FUWW",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a woad that missed in the W1 and the WMQ was unabwe to accept this woad miss wequest because it was fuww"
  },
  {
    "EventCode": "0x14048",
    "EventName": "PM_INST_FWOM_ON_CHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded eithew shawed ow modified data fwom anothew cowe's W2/W3 on the same chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4D014",
    "EventName": "PM_CMPWU_STAWW_WOAD_FINISH",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a woad instwuction with aww its dependencies satisfied just going thwough the WSU pipe to finish"
  },
  {
    "EventCode": "0x2404A",
    "EventName": "PM_INST_FWOM_WW4",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom anothew chip's W4 on the same Node ow Gwoup ( Wemote) due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x1404A",
    "EventName": "PM_INST_FWOM_WW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Shawed (S) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x401EA",
    "EventName": "PM_THWESH_EXC_128",
    "BwiefDescwiption": "Thweshowd countew exceeded a vawue of 128"
  },
  {
    "EventCode": "0x400F6",
    "EventName": "PM_BW_MPWED_CMPW",
    "BwiefDescwiption": "Numbew of Bwanch Mispwedicts"
  },
  {
    "EventCode": "0x2F140",
    "EventName": "PM_MWK_DPTEG_FWOM_W2_MEPF",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W2 hit without dispatch confwicts on Mepf state. due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x101E6",
    "EventName": "PM_THWESH_EXC_4096",
    "BwiefDescwiption": "Thweshowd countew exceed a count of 4096"
  },
  {
    "EventCode": "0x3F14A",
    "EventName": "PM_MWK_DPTEG_FWOM_WMEM",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom anothew chip's memowy on the same Node ow Gwoup ( Wemote) due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4C016",
    "EventName": "PM_CMPWU_STAWW_DMISS_W2W3_CONFWICT",
    "BwiefDescwiption": "Compwetion staww due to cache miss that wesowves in the W2 ow W3 with a confwict"
  },
  {
    "EventCode": "0x2C01A",
    "EventName": "PM_CMPWU_STAWW_WHS",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a woad that hit on an owdew stowe and it was waiting fow stowe data"
  },
  {
    "EventCode": "0x401E4",
    "EventName": "PM_MWK_DTWB_MISS",
    "BwiefDescwiption": "Mawked dtwb miss"
  },
  {
    "EventCode": "0x24046",
    "EventName": "PM_INST_FWOM_WW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Modified (M) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x1002A",
    "EventName": "PM_CMPWU_STAWW_WAWX",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a wawx waiting to be satisfied"
  }
]
