[
  {
    "EventCode": "0x3013E",
    "EventName": "PM_MWK_STAWW_CMPWU_CYC",
    "BwiefDescwiption": "Numbew of cycwes the mawked instwuction is expewiencing a staww whiwe it is next to compwete (NTC)"
  },
  {
    "EventCode": "0x4F056",
    "EventName": "PM_WADIX_PWC_W1_PDE_FWOM_W3MISS",
    "BwiefDescwiption": "A Page Diwectowy Entwy was wewoaded to a wevew 1 page wawk cache fwom beyond the cowe's W3 data cache. The souwce couwd be wocaw/wemote/distant memowy ow anothew cowe's cache"
  },
  {
    "EventCode": "0x24158",
    "EventName": "PM_MWK_INST",
    "BwiefDescwiption": "An instwuction was mawked. Incwudes both Wandom Instwuction Sampwing (WIS) at decode time and Wandom Event Sampwing (WES) at the time the configuwed event happens"
  },
  {
    "EventCode": "0x1E046",
    "EventName": "PM_DPTEG_FWOM_W31_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew cowe's W3 on the same chip due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x3C04A",
    "EventName": "PM_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom anothew chip's memowy on the same Node ow Gwoup ( Wemote) due to a demand woad"
  },
  {
    "EventCode": "0x2C01C",
    "EventName": "PM_CMPWU_STAWW_DMISS_WEMOTE",
    "BwiefDescwiption": "Compwetion staww by Dcache miss which wesowved fwom wemote chip (cache ow memowy)"
  },
  {
    "EventCode": "0x44040",
    "EventName": "PM_INST_FWOM_W2_DISP_CONFWICT_OTHEW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W2 with dispatch confwict due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x2E050",
    "EventName": "PM_DAWQ0_7_9_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 7,8, ow 9 DAWQ entwies (out of 12) awe in use"
  },
  {
    "EventCode": "0x2D02E",
    "EventName": "PM_WADIX_PWC_W3_PTE_FWOM_W2",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 3 page wawk cache fwom the cowe's W2 data cache. This impwies that a wevew 4 PWC access was not necessawy fow this twanswation"
  },
  {
    "EventCode": "0x3F05E",
    "EventName": "PM_WADIX_PWC_W3_PTE_FWOM_W3",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 3 page wawk cache fwom the cowe's W3 data cache. This impwies that a wevew 4 PWC access was not necessawy fow this twanswation"
  },
  {
    "EventCode": "0x2E01E",
    "EventName": "PM_CMPWU_STAWW_NTC_FWUSH",
    "BwiefDescwiption": "Compwetion staww due to ntc fwush"
  },
  {
    "EventCode": "0x1F14C",
    "EventName": "PM_MWK_DPTEG_FWOM_WW4",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom the wocaw chip's W4 cache due to a mawked data side wequest.. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x20130",
    "EventName": "PM_MWK_INST_DECODED",
    "BwiefDescwiption": "An instwuction was mawked at decode time. Wandom Instwuction Sampwing (WIS) onwy"
  },
  {
    "EventCode": "0x3F144",
    "EventName": "PM_MWK_DPTEG_FWOM_W31_ECO_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew cowe's ECO W3 on the same chip due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4D058",
    "EventName": "PM_VECTOW_FWOP_CMPW",
    "BwiefDescwiption": "Vectow FP instwuction compweted"
  },
  {
    "EventCode": "0x14040",
    "EventName": "PM_INST_FWOM_W2_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W2 without confwict due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4404E",
    "EventName": "PM_INST_FWOM_W3MISS_MOD",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom a wocation othew than the wocaw cowe's W3 due to a instwuction fetch"
  },
  {
    "EventCode": "0x3003A",
    "EventName": "PM_CMPWU_STAWW_EXCEPTION",
    "BwiefDescwiption": "Cycwes in which the NTC instwuction is not awwowed to compwete because it was intewwupted by ANY exception, which has to be sewviced befowe the instwuction can compwete"
  },
  {
    "EventCode": "0x4F144",
    "EventName": "PM_MWK_DPTEG_FWOM_W31_ECO_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew cowe's ECO W3 on the same chip due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x3E044",
    "EventName": "PM_DPTEG_FWOM_W31_ECO_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew cowe's ECO W3 on the same chip due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x300F6",
    "EventName": "PM_W1_DCACHE_WEWOAD_VAWID",
    "BwiefDescwiption": "DW1 wewoaded due to Demand Woad"
  },
  {
    "EventCode": "0x1415E",
    "EventName": "PM_MWK_DATA_FWOM_W3MISS_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad fwom a wocation othew than the wocaw cowe's W3 due to a mawked woad"
  },
  {
    "EventCode": "0x1E052",
    "EventName": "PM_CMPWU_STAWW_SWB",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was awaiting W2 wesponse fow an SWB"
  },
  {
    "EventCode": "0x4404C",
    "EventName": "PM_INST_FWOM_DMEM",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom anothew chip's memowy on the same Node ow Gwoup (Distant) due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x3000E",
    "EventName": "PM_FXU_1PWUS_BUSY",
    "BwiefDescwiption": "At weast one of the 4 FXU units is busy"
  },
  {
    "EventCode": "0x2C048",
    "EventName": "PM_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom the wocaw chip's Memowy due to a demand woad"
  },
  {
    "EventCode": "0x3000A",
    "EventName": "PM_CMPWU_STAWW_PM",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was issued to the Pewmute execution pipe and waiting to finish. Incwudes pewmute and decimaw fixed point instwuctions (128 bit BCD awithmetic) + a few 128 bit fixpoint add/subtwact instwuctions with cawwy. Not quawified by vectow ow muwticycwe"
  },
  {
    "EventCode": "0x1504E",
    "EventName": "PM_IPTEG_FWOM_W2MISS",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a wocation othew than the wocaw cowe's W2 due to a instwuction side wequest"
  },
  {
    "EventCode": "0x1C052",
    "EventName": "PM_DATA_GWP_PUMP_MPWED_WTY",
    "BwiefDescwiption": "Finaw Pump Scope (Gwoup) ended up wawgew than Initiaw Pump Scope (Chip) fow a demand woad"
  },
  {
    "EventCode": "0x30008",
    "EventName": "PM_DISP_STAWVED",
    "BwiefDescwiption": "Dispatched Stawved"
  },
  {
    "EventCode": "0x14042",
    "EventName": "PM_INST_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W2 due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4000C",
    "EventName": "PM_FWEQ_UP",
    "BwiefDescwiption": "Powew Management: Above Thweshowd A"
  },
  {
    "EventCode": "0x3C050",
    "EventName": "PM_DATA_SYS_PUMP_CPWED",
    "BwiefDescwiption": "Initiaw and Finaw Pump Scope was system pump (pwediction=cowwect) fow a demand woad"
  },
  {
    "EventCode": "0x25040",
    "EventName": "PM_IPTEG_FWOM_W2_MEPF",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W2 hit without dispatch confwicts on Mepf state. due to a instwuction side wequest"
  },
  {
    "EventCode": "0x10132",
    "EventName": "PM_MWK_INST_ISSUED",
    "BwiefDescwiption": "Mawked instwuction issued"
  },
  {
    "EventCode": "0x1C046",
    "EventName": "PM_DATA_FWOM_W31_SHW",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded with Shawed (S) data fwom anothew cowe's W3 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x2C044",
    "EventName": "PM_DATA_FWOM_W31_MOD",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded with Modified (M) data fwom anothew cowe's W3 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x2C04A",
    "EventName": "PM_DATA_FWOM_WW4",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom anothew chip's W4 on the same Node ow Gwoup ( Wemote) due to a demand woad"
  },
  {
    "EventCode": "0x24044",
    "EventName": "PM_INST_FWOM_W31_MOD",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Modified (M) data fwom anothew cowe's W3 on the same chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4C050",
    "EventName": "PM_DATA_SYS_PUMP_MPWED_WTY",
    "BwiefDescwiption": "Finaw Pump Scope (system) ended up wawgew than Initiaw Pump Scope (Chip/Gwoup) fow a demand woad"
  },
  {
    "EventCode": "0x2C052",
    "EventName": "PM_DATA_GWP_PUMP_MPWED",
    "BwiefDescwiption": "Finaw Pump Scope (Gwoup) ended up eithew wawgew ow smawwew than Initiaw Pump Scope fow a demand woad"
  },
  {
    "EventCode": "0x2F148",
    "EventName": "PM_MWK_DPTEG_FWOM_WMEM",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom the wocaw chip's Memowy due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4D01A",
    "EventName": "PM_CMPWU_STAWW_EIEIO",
    "BwiefDescwiption": "Finish staww because the NTF instwuction is an EIEIO waiting fow wesponse fwom W2"
  },
  {
    "EventCode": "0x4F14E",
    "EventName": "PM_MWK_DPTEG_FWOM_W3MISS",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a wocation othew than the wocaw cowe's W3 due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4F05A",
    "EventName": "PM_WADIX_PWC_W4_PTE_FWOM_W3",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 4 page wawk cache fwom the cowe's W3 data cache. This is the deepest wevew of PWC possibwe fow a twanswation"
  },
  {
    "EventCode": "0x1F05A",
    "EventName": "PM_WADIX_PWC_W4_PTE_FWOM_W2",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 4 page wawk cache fwom the cowe's W2 data cache. This is the deepest wevew of PWC possibwe fow a twanswation"
  },
  {
    "EventCode": "0x30068",
    "EventName": "PM_W1_ICACHE_WEWOADED_PWEF",
    "BwiefDescwiption": "Counts aww Icache pwefetch wewoads ( incwudes demand tuwned into pwefetch)"
  },
  {
    "EventCode": "0x4C04A",
    "EventName": "PM_DATA_FWOM_OFF_CHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded eithew shawed ow modified data fwom anothew cowe's W2/W3 on a diffewent chip (wemote ow distant) due to a demand woad"
  },
  {
    "EventCode": "0x400FE",
    "EventName": "PM_DATA_FWOM_MEMOWY",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom a memowy wocation incwuding W4 fwom wocaw wemote ow distant due to a demand woad"
  },
  {
    "EventCode": "0x3F058",
    "EventName": "PM_WADIX_PWC_W1_PDE_FWOM_W3",
    "BwiefDescwiption": "A Page Diwectowy Entwy was wewoaded to a wevew 1 page wawk cache fwom the cowe's W3 data cache"
  },
  {
    "EventCode": "0x3C052",
    "EventName": "PM_DATA_SYS_PUMP_MPWED",
    "BwiefDescwiption": "Finaw Pump Scope (system) mispwedicted. Eithew the owiginaw scope was too smaww (Chip/Gwoup) ow the owiginaw scope was System and it shouwd have been smawwew. Counts fow a demand woad"
  },
  {
    "EventCode": "0x4D142",
    "EventName": "PM_MWK_DATA_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom wocaw cowe's W3 due to a mawked woad"
  },
  {
    "EventCode": "0x30050",
    "EventName": "PM_SYS_PUMP_CPWED",
    "BwiefDescwiption": "Initiaw and Finaw Pump Scope was system pump fow aww data types excwuding data pwefetch (demand woad,inst pwefetch,inst fetch,xwate)"
  },
  {
    "EventCode": "0x30028",
    "EventName": "PM_CMPWU_STAWW_SPEC_FINISH",
    "BwiefDescwiption": "Finish staww whiwe waiting fow the non-specuwative finish of eithew a stcx waiting fow its wesuwt ow a woad waiting fow non-cwiticaw sectows of data and ECC"
  },
  {
    "EventCode": "0x400F4",
    "EventName": "PM_WUN_PUWW",
    "BwiefDescwiption": "Wun_PUWW"
  },
  {
    "EventCode": "0x3404C",
    "EventName": "PM_INST_FWOM_DW4",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom anothew chip's W4 on a diffewent Node ow Gwoup (Distant) due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x3D05A",
    "EventName": "PM_NTC_ISSUE_HEWD_OTHEW",
    "BwiefDescwiption": "The NTC instwuction is being hewd at dispatch duwing weguwaw pipewine cycwes, ow because the VSU is busy with muwti-cycwe instwuctions, ow because of a wwite-back cowwision with VSU"
  },
  {
    "EventCode": "0x2E048",
    "EventName": "PM_DPTEG_FWOM_WMEM",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom the wocaw chip's Memowy due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x2D02A",
    "EventName": "PM_WADIX_PWC_W3_PDE_FWOM_W2",
    "BwiefDescwiption": "A Page Diwectowy Entwy was wewoaded to a wevew 3 page wawk cache fwom the cowe's W2 data cache"
  },
  {
    "EventCode": "0x1F05C",
    "EventName": "PM_WADIX_PWC_W3_PDE_FWOM_W3",
    "BwiefDescwiption": "A Page Diwectowy Entwy was wewoaded to a wevew 3 page wawk cache fwom the cowe's W3 data cache"
  },
  {
    "EventCode": "0x4D04A",
    "EventName": "PM_DAWQ0_0_3_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 3 ow wess DAWQ entwies (out of 12) awe in use"
  },
  {
    "EventCode": "0x1404C",
    "EventName": "PM_INST_FWOM_WW4",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom the wocaw chip's W4 cache due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x200FD",
    "EventName": "PM_W1_ICACHE_MISS",
    "BwiefDescwiption": "Demand iCache Miss"
  },
  {
    "EventCode": "0x34040",
    "EventName": "PM_INST_FWOM_W2_DISP_CONFWICT_WDHITST",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W2 with woad hit stowe confwict due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x20138",
    "EventName": "PM_MWK_ST_NEST",
    "BwiefDescwiption": "Mawked stowe sent to nest"
  },
  {
    "EventCode": "0x44048",
    "EventName": "PM_INST_FWOM_DW2W3_MOD",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Modified (M) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x35046",
    "EventName": "PM_IPTEG_FWOM_W21_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew cowe's W2 on the same chip due to a instwuction side wequest"
  },
  {
    "EventCode": "0x4C04E",
    "EventName": "PM_DATA_FWOM_W3MISS_MOD",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom a wocation othew than the wocaw cowe's W3 due to a demand woad"
  },
  {
    "EventCode": "0x401E0",
    "EventName": "PM_MWK_INST_CMPW",
    "BwiefDescwiption": "mawked instwuction compweted"
  },
  {
    "EventCode": "0x2C128",
    "EventName": "PM_MWK_DATA_FWOM_DW2W3_SHW_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad with Shawed (S) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to a mawked woad"
  },
  {
    "EventCode": "0x34044",
    "EventName": "PM_INST_FWOM_W31_ECO_SHW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Shawed (S) data fwom anothew cowe's ECO W3 on the same chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4E018",
    "EventName": "PM_CMPWU_STAWW_NTC_DISP_FIN",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was one that must finish at dispatch."
  },
  {
    "EventCode": "0x2E05E",
    "EventName": "PM_WMQ_EMPTY_CYC",
    "BwiefDescwiption": "Cycwes in which the WMQ has no pending woad misses fow this thwead"
  },
  {
    "EventCode": "0x4C122",
    "EventName": "PM_DAWQ1_0_3_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 3 ow fewew DAWQ1 entwies (out of 12) awe in use"
  },
  {
    "EventCode": "0x4F058",
    "EventName": "PM_WADIX_PWC_W2_PTE_FWOM_W3",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 2 page wawk cache fwom the cowe's W3 data cache. This impwies that wevew 3 and wevew 4 PWC accesses wewe not necessawy fow this twanswation"
  },
  {
    "EventCode": "0x14046",
    "EventName": "PM_INST_FWOM_W31_SHW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Shawed (S) data fwom anothew cowe's W3 on the same chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x3012C",
    "EventName": "PM_MWK_ST_FWD",
    "BwiefDescwiption": "Mawked st fowwawds"
  },
  {
    "EventCode": "0x101E0",
    "EventName": "PM_MWK_INST_DISP",
    "BwiefDescwiption": "The thwead has dispatched a wandomwy sampwed mawked instwuction"
  },
  {
    "EventCode": "0x1D058",
    "EventName": "PM_DAWQ0_10_12_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 10 ow mowe DAWQ entwies (out of 12) awe in use"
  },
  {
    "EventCode": "0x300FE",
    "EventName": "PM_DATA_FWOM_W3MISS",
    "BwiefDescwiption": "Demand WD - W3 Miss (not W2 hit and not W3 hit)"
  },
  {
    "EventCode": "0x30006",
    "EventName": "PM_CMPWU_STAWW_OTHEW_CMPW",
    "BwiefDescwiption": "Instwuctions the cowe compweted whiwe this twead was stawwed"
  },
  {
    "EventCode": "0x1005C",
    "EventName": "PM_CMPWU_STAWW_DP",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a scawaw instwuction issued to the Doubwe Pwecision execution pipe and waiting to finish. Incwudes binawy fwoating point instwuctions in 32 and 64 bit binawy fwoating point fowmat. Not quawified muwticycwe. Quawified by NOT vectow"
  },
  {
    "EventCode": "0x1E042",
    "EventName": "PM_DPTEG_FWOM_W2",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W2 due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x1016E",
    "EventName": "PM_MWK_BW_CMPW",
    "BwiefDescwiption": "Bwanch Instwuction compweted"
  },
  {
    "EventCode": "0x2013A",
    "EventName": "PM_MWK_BWU_FIN",
    "BwiefDescwiption": "bwu mawked instw finish"
  },
  {
    "EventCode": "0x4F05E",
    "EventName": "PM_WADIX_PWC_W3_PTE_FWOM_W3MISS",
    "BwiefDescwiption": "A Page Tabwe Entwy was wewoaded to a wevew 3 page wawk cache fwom beyond the cowe's W3 data cache. This impwies that a wevew 4 PWC access was not necessawy fow this twanswation. The souwce couwd be wocaw/wemote/distant memowy ow anothew cowe's cache"
  },
  {
    "EventCode": "0x400FC",
    "EventName": "PM_ITWB_MISS",
    "BwiefDescwiption": "ITWB Wewoaded. Counts 1 pew ITWB miss fow HPT but muwtipwe fow wadix depending on numbew of wevews twavewesed"
  },
  {
    "EventCode": "0x1E044",
    "EventName": "PM_DPTEG_FWOM_W3_NO_CONFWICT",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W3 without confwict due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4D05A",
    "EventName": "PM_NON_MATH_FWOP_CMPW",
    "BwiefDescwiption": "Non FWOP opewation compweted"
  },
  {
    "EventCode": "0x101E2",
    "EventName": "PM_MWK_BW_TAKEN_CMPW",
    "BwiefDescwiption": "Mawked Bwanch Taken compweted"
  },
  {
    "EventCode": "0x3E158",
    "EventName": "PM_MWK_STCX_FAIW",
    "BwiefDescwiption": "mawked stcx faiwed"
  },
  {
    "EventCode": "0x1C048",
    "EventName": "PM_DATA_FWOM_ON_CHIP_CACHE",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded eithew shawed ow modified data fwom anothew cowe's W2/W3 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x1C054",
    "EventName": "PM_DATA_PUMP_CPWED",
    "BwiefDescwiption": "Pump pwediction cowwect. Counts acwoss aww types of pumps fow a demand woad"
  },
  {
    "EventCode": "0x4405E",
    "EventName": "PM_DAWQ_STOWE_WEJECT",
    "BwiefDescwiption": "The DAWQ attempted to twansmit a stowe into an WSAQ ow SWQ entwy but It was wejected. Divide by PM_DAWQ_STOWE_XMIT to get weject watio"
  },
  {
    "EventCode": "0x1C042",
    "EventName": "PM_DATA_FWOM_W2",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom wocaw cowe's W2 due to a demand woad"
  },
  {
    "EventCode": "0x1D14C",
    "EventName": "PM_MWK_DATA_FWOM_WW4",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom the wocaw chip's W4 cache due to a mawked woad"
  },
  {
    "EventCode": "0x1006C",
    "EventName": "PM_WUN_CYC_ST_MODE",
    "BwiefDescwiption": "Cycwes wun watch is set and cowe is in ST mode"
  },
  {
    "EventCode": "0x3C044",
    "EventName": "PM_DATA_FWOM_W31_ECO_SHW",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded with Shawed (S) data fwom anothew cowe's ECO W3 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x4C052",
    "EventName": "PM_DATA_PUMP_MPWED",
    "BwiefDescwiption": "Pump mispwediction. Counts acwoss aww types of pumps fow a demand woad"
  },
  {
    "EventCode": "0x20050",
    "EventName": "PM_GWP_PUMP_CPWED",
    "BwiefDescwiption": "Initiaw and Finaw Pump Scope and data souwced acwoss this scope was gwoup pump fow aww data types excwuding data pwefetch (demand woad,inst pwefetch,inst fetch,xwate)"
  },
  {
    "EventCode": "0x1F150",
    "EventName": "PM_MWK_ST_W2DISP_TO_CMPW_CYC",
    "BwiefDescwiption": "cycwes fwom W2 wc disp to w2 wc compwetion"
  },
  {
    "EventCode": "0x4505A",
    "EventName": "PM_SP_FWOP_CMPW",
    "BwiefDescwiption": "SP instwuction compweted"
  },
  {
    "EventCode": "0x4000A",
    "EventName": "PM_ISQ_36_44_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 36 ow mowe Issue Queue entwies awe in use. This is a shawed event, not pew thwead. Thewe awe 44 issue queue entwies acwoss 4 swices in the whowe cowe"
  },
  {
    "EventCode": "0x2C12E",
    "EventName": "PM_MWK_DATA_FWOM_WW4_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad fwom the wocaw chip's W4 cache due to a mawked woad"
  },
  {
    "EventCode": "0x2C058",
    "EventName": "PM_MEM_PWEF",
    "BwiefDescwiption": "Memowy pwefetch fow this thwead. Incwudes W4"
  },
  {
    "EventCode": "0x40012",
    "EventName": "PM_W1_ICACHE_WEWOADED_AWW",
    "BwiefDescwiption": "Counts aww Icache wewoads incwudes demand, pwefetch, pwefetch tuwned into demand and demand tuwned into pwefetch"
  },
  {
    "EventCode": "0x3003C",
    "EventName": "PM_CMPWU_STAWW_NESTED_TEND",
    "BwiefDescwiption": "Compwetion staww because the ISU is updating the TEXASW to keep twack of the nested tend and decwement the TEXASW nested wevew. This is a showt deway"
  },
  {
    "EventCode": "0x3D05C",
    "EventName": "PM_DISP_HEWD_HB_FUWW",
    "BwiefDescwiption": "Dispatch hewd due to Histowy Buffew fuww. Couwd be GPW/VSW/VMW/FPW/CW/XVF; CW; XVF (XEW/VSCW/FPSCW)"
  },
  {
    "EventCode": "0x30052",
    "EventName": "PM_SYS_PUMP_MPWED",
    "BwiefDescwiption": "Finaw Pump Scope (system) mispwedicted. Eithew the owiginaw scope was too smaww (Chip/Gwoup) ow the owiginaw scope was System and it shouwd have been smawwew. Counts fow aww data types excwuding data pwefetch (demand woad,inst pwefetch,inst fetch,xwate)"
  },
  {
    "EventCode": "0x2E044",
    "EventName": "PM_DPTEG_FWOM_W31_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew cowe's W3 on the same chip due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x34048",
    "EventName": "PM_INST_FWOM_DW2W3_SHW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Shawed (S) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x45042",
    "EventName": "PM_IPTEG_FWOM_W3",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W3 due to a instwuction side wequest"
  },
  {
    "EventCode": "0x15042",
    "EventName": "PM_IPTEG_FWOM_W2",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W2 due to a instwuction side wequest"
  },
  {
    "EventCode": "0x1C05E",
    "EventName": "PM_MEM_WOC_THWESH_WSU_MED",
    "BwiefDescwiption": "Wocaw memowy above thweshowd fow data pwefetch"
  },
  {
    "EventCode": "0x40134",
    "EventName": "PM_MWK_INST_TIMEO",
    "BwiefDescwiption": "mawked Instwuction finish timeout (instwuction wost)"
  },
  {
    "EventCode": "0x1002C",
    "EventName": "PM_W1_DCACHE_WEWOADED_AWW",
    "BwiefDescwiption": "W1 data cache wewoaded fow demand. If MMCW1[16] is 1, pwefetches wiww be incwuded as weww"
  },
  {
    "EventCode": "0x30130",
    "EventName": "PM_MWK_INST_FIN",
    "BwiefDescwiption": "mawked instwuction finished"
  },
  {
    "EventCode": "0x1F14A",
    "EventName": "PM_MWK_DPTEG_FWOM_WW2W3_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to a mawked data side wequest.. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x3504E",
    "EventName": "PM_DAWQ0_4_6_ENTWIES",
    "BwiefDescwiption": "Cycwes in which 4, 5, ow 6 DAWQ entwies (out of 12) awe in use"
  },
  {
    "EventCode": "0x30064",
    "EventName": "PM_DAWQ_STOWE_XMIT",
    "BwiefDescwiption": "The DAWQ attempted to twansmit a stowe into an WSAQ ow SWQ entwy. Incwudes wejects. Not quawified by thwead, so it incwudes counts fow the whowe cowe"
  },
  {
    "EventCode": "0x45046",
    "EventName": "PM_IPTEG_FWOM_W21_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew cowe's W2 on the same chip due to a instwuction side wequest"
  },
  {
    "EventCode": "0x2C016",
    "EventName": "PM_CMPWU_STAWW_PASTE",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a paste waiting fow wesponse fwom W2"
  },
  {
    "EventCode": "0x24156",
    "EventName": "PM_MWK_STCX_FIN",
    "BwiefDescwiption": "Numbew of mawked stcx instwuctions finished. This incwudes instwuctions in the specuwative path of a bwanch that may be fwushed"
  },
  {
    "EventCode": "0x15150",
    "EventName": "PM_SYNC_MWK_PWOBE_NOP",
    "BwiefDescwiption": "Mawked pwobeNops which can cause synchwonous intewwupts"
  },
  {
    "EventCode": "0x301E4",
    "EventName": "PM_MWK_BW_MPWED_CMPW",
    "BwiefDescwiption": "Mawked Bwanch Mispwedicted"
  }
]