[
  {
    "EventCode": "0x20036",
    "EventName": "PM_BW_2PATH",
    "BwiefDescwiption": "Bwanches that awe not stwongwy biased"
  },
  {
    "EventCode": "0x40056",
    "EventName": "PM_MEM_WOC_THWESH_WSU_HIGH",
    "BwiefDescwiption": "Wocaw memowy above thweshowd fow WSU medium"
  },
  {
    "EventCode": "0x40118",
    "EventName": "PM_MWK_DCACHE_WEWOAD_INTV",
    "BwiefDescwiption": "Combined Intewvention event"
  },
  {
    "EventCode": "0x4F148",
    "EventName": "PM_MWK_DPTEG_FWOM_DW2W3_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x301E8",
    "EventName": "PM_THWESH_EXC_64",
    "BwiefDescwiption": "Thweshowd countew exceeded a vawue of 64"
  },
  {
    "EventCode": "0x4E04E",
    "EventName": "PM_DPTEG_FWOM_W3MISS",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a wocation othew than the wocaw cowe's W3 due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x40050",
    "EventName": "PM_SYS_PUMP_MPWED_WTY",
    "BwiefDescwiption": "Finaw Pump Scope (system) ended up wawgew than Initiaw Pump Scope (Chip/Gwoup) fow aww data types excwuding data pwefetch (demand woad,inst pwefetch,inst fetch,xwate)"
  },
  {
    "EventCode": "0x1F14E",
    "EventName": "PM_MWK_DPTEG_FWOM_W2MISS",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a wocation othew than the wocaw cowe's W2 due to a mawked data side wequest.. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4D018",
    "EventName": "PM_CMPWU_STAWW_BWU",
    "BwiefDescwiption": "Compwetion staww due to a Bwanch Unit"
  },
  {
    "EventCode": "0x45052",
    "EventName": "PM_4FWOP_CMPW",
    "BwiefDescwiption": "4 FWOP instwuction compweted"
  },
  {
    "EventCode": "0x3D142",
    "EventName": "PM_MWK_DATA_FWOM_WMEM",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom the wocaw chip's Memowy due to a mawked woad"
  },
  {
    "EventCode": "0x4C01E",
    "EventName": "PM_CMPWU_STAWW_CWYPTO",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was wouted to the cwypto execution pipe and was waiting to finish"
  },
  {
    "EventCode": "0x3000C",
    "EventName": "PM_FWEQ_DOWN",
    "BwiefDescwiption": "Powew Management: Bewow Thweshowd B"
  },
  {
    "EventCode": "0x4D128",
    "EventName": "PM_MWK_DATA_FWOM_WMEM_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad fwom the wocaw chip's Memowy due to a mawked woad"
  },
  {
    "EventCode": "0x4D054",
    "EventName": "PM_8FWOP_CMPW",
    "BwiefDescwiption": "8 FWOP instwuction compweted"
  },
  {
    "EventCode": "0x10026",
    "EventName": "PM_TABWEWAWK_CYC",
    "BwiefDescwiption": "Cycwes when an instwuction tabwewawk is active"
  },
  {
    "EventCode": "0x2C012",
    "EventName": "PM_CMPWU_STAWW_DCACHE_MISS",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a woad that missed the W1 and was waiting fow the data to wetuwn fwom the nest"
  },
  {
    "EventCode": "0x2E04C",
    "EventName": "PM_DPTEG_FWOM_MEMOWY",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a memowy wocation incwuding W4 fwom wocaw wemote ow distant due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x3F142",
    "EventName": "PM_MWK_DPTEG_FWOM_W3_DISP_CONFWICT",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W3 with dispatch confwict due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x4F142",
    "EventName": "PM_MWK_DPTEG_FWOM_W3",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom wocaw cowe's W3 due to a mawked data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x10060",
    "EventName": "PM_TM_TWANS_WUN_CYC",
    "BwiefDescwiption": "wun cycwes in twansactionaw state"
  },
  {
    "EventCode": "0x1E04C",
    "EventName": "PM_DPTEG_FWOM_WW4",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom the wocaw chip's W4 cache due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x45050",
    "EventName": "PM_1FWOP_CMPW",
    "BwiefDescwiption": "one fwop (fadd, fmuw, fsub, fcmp, fsew, fabs, fnabs, fwes, fsqwte, fneg) opewation compweted"
  }
]
