[
  {
    "EventCode": "0x1E",
    "EventName": "PM_CYC",
    "BwiefDescwiption": "Pwocessow cycwes"
  },
  {
    "EventCode": "0x30010",
    "EventName": "PM_PMC2_OVEWFWOW",
    "BwiefDescwiption": "Ovewfwow fwom countew 2"
  },
  {
    "EventCode": "0x3C046",
    "EventName": "PM_DATA_FWOM_W21_SHW",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded with Shawed (S) data fwom anothew cowe's W2 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x4D05C",
    "EventName": "PM_DP_QP_FWOP_CMPW",
    "BwiefDescwiption": "Doubwe-Pwecion ow Quad-Pwecision instwuction compweted"
  },
  {
    "EventCode": "0x4E04C",
    "EventName": "PM_DPTEG_FWOM_DMEM",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom anothew chip's memowy on the same Node ow Gwoup (Distant) due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x20016",
    "EventName": "PM_ST_FIN",
    "BwiefDescwiption": "Stowe finish count. Incwudes specuwative activity"
  },
  {
    "EventCode": "0x1504A",
    "EventName": "PM_IPTEG_FWOM_WW2W3_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to a instwuction side wequest"
  },
  {
    "EventCode": "0x40132",
    "EventName": "PM_MWK_WSU_FIN",
    "BwiefDescwiption": "wsu mawked instw PPC finish"
  },
  {
    "EventCode": "0x3C05C",
    "EventName": "PM_CMPWU_STAWW_VFXU",
    "BwiefDescwiption": "Finish staww due to a vectow fixed point instwuction in the execution pipewine. These instwuctions get wouted to the AWU, AWU2, and DIV pipes"
  },
  {
    "EventCode": "0x30066",
    "EventName": "PM_WSU_FIN",
    "BwiefDescwiption": "WSU Finished a PPC instwuction (up to 4 pew cycwe)"
  },
  {
    "EventCode": "0x2011C",
    "EventName": "PM_MWK_NTC_CYC",
    "BwiefDescwiption": "Cycwes duwing which the mawked instwuction is next to compwete (compwetion is hewd up because the mawked instwuction hasn't compweted yet)"
  },
  {
    "EventCode": "0x3E048",
    "EventName": "PM_DPTEG_FWOM_DW2W3_SHW",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Shawed (S) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x2E018",
    "EventName": "PM_CMPWU_STAWW_VFXWONG",
    "BwiefDescwiption": "Compwetion staww due to a wong watency vectow fixed point instwuction (division, squawe woot)"
  },
  {
    "EventCode": "0x1C04E",
    "EventName": "PM_DATA_FWOM_W2MISS_MOD",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded fwom a wocation othew than the wocaw cowe's W2 due to a demand woad"
  },
  {
    "EventCode": "0x15048",
    "EventName": "PM_IPTEG_FWOM_ON_CHIP_CACHE",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB eithew shawed ow modified data fwom anothew cowe's W2/W3 on the same chip due to a instwuction side wequest"
  },
  {
    "EventCode": "0x34046",
    "EventName": "PM_INST_FWOM_W21_SHW",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded with Shawed (S) data fwom anothew cowe's W2 on the same chip due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x1E058",
    "EventName": "PM_STCX_FAIW",
    "BwiefDescwiption": "stcx faiwed"
  },
  {
    "EventCode": "0x300F0",
    "EventName": "PM_ST_MISS_W1",
    "BwiefDescwiption": "Stowe Missed W1"
  },
  {
    "EventCode": "0x4C046",
    "EventName": "PM_DATA_FWOM_W21_MOD",
    "BwiefDescwiption": "The pwocessow's data cache was wewoaded with Modified (M) data fwom anothew cowe's W2 on the same chip due to a demand woad"
  },
  {
    "EventCode": "0x2504A",
    "EventName": "PM_IPTEG_FWOM_WW4",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom anothew chip's W4 on the same Node ow Gwoup ( Wemote) due to a instwuction side wequest"
  },
  {
    "EventCode": "0x2003E",
    "EventName": "PM_WSU_WMQ_SWQ_EMPTY_CYC",
    "BwiefDescwiption": "Cycwes in which the WSU is empty fow aww thweads (wmq and swq awe compwetewy empty)"
  },
  {
    "EventCode": "0x201E6",
    "EventName": "PM_THWESH_EXC_32",
    "BwiefDescwiption": "Thweshowd countew exceeded a vawue of 32"
  },
  {
    "EventCode": "0x4405C",
    "EventName": "PM_CMPWU_STAWW_VDP",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a vectow instwuction issued to the Doubwe Pwecision execution pipe and waiting to finish. Incwudes binawy fwoating point instwuctions in 32 and 64 bit binawy fwoating point fowmat. Not quawified muwticycwe. Quawified by vectow"
  },
  {
    "EventCode": "0x4D010",
    "EventName": "PM_PMC1_SAVED",
    "BwiefDescwiption": "PMC1 Wewind Vawue saved"
  },
  {
    "EventCode": "0x44042",
    "EventName": "PM_INST_FWOM_W3",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W3 due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x200FE",
    "EventName": "PM_DATA_FWOM_W2MISS",
    "BwiefDescwiption": "Demand WD - W2 Miss (not W2 hit)"
  },
  {
    "EventCode": "0x2D14A",
    "EventName": "PM_MWK_DATA_FWOM_WW2W3_MOD_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad with Modified (M) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to a mawked woad"
  },
  {
    "EventCode": "0x10028",
    "EventName": "PM_STAWW_END_ICT_EMPTY",
    "BwiefDescwiption": "The numbew a times the cowe twansitioned fwom a staww to ICT-empty fow this thwead"
  },
  {
    "EventCode": "0x2504C",
    "EventName": "PM_IPTEG_FWOM_MEMOWY",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom a memowy wocation incwuding W4 fwom wocaw wemote ow distant due to a instwuction side wequest"
  },
  {
    "EventCode": "0x4504A",
    "EventName": "PM_IPTEG_FWOM_OFF_CHIP_CACHE",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB eithew shawed ow modified data fwom anothew cowe's W2/W3 on a diffewent chip (wemote ow distant) due to a instwuction side wequest"
  },
  {
    "EventCode": "0x1404E",
    "EventName": "PM_INST_FWOM_W2MISS",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom a wocation othew than the wocaw cowe's W2 due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x34042",
    "EventName": "PM_INST_FWOM_W3_DISP_CONFWICT",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W3 with dispatch confwict due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x4E048",
    "EventName": "PM_DPTEG_FWOM_DW2W3_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew chip's W2 ow W3 on a diffewent Node ow Gwoup (Distant), as this chip due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x200F0",
    "EventName": "PM_ST_CMPW",
    "BwiefDescwiption": "Stowes compweted fwom S2Q (2nd-wevew stowe queue)."
  },
  {
    "EventCode": "0x4E05C",
    "EventName": "PM_WSU_WEJECT_WHS",
    "BwiefDescwiption": "WSU Weject due to WHS (up to 4 pew cycwe)"
  },
  {
    "EventCode": "0x14044",
    "EventName": "PM_INST_FWOM_W3_NO_CONFWICT",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W3 without confwict due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x3E04C",
    "EventName": "PM_DPTEG_FWOM_DW4",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom anothew chip's W4 on a diffewent Node ow Gwoup (Distant) due to a data side wequest. When using Wadix Page Twanswation, this count excwudes PDE wewoads. Onwy PTE wewoads awe incwuded"
  },
  {
    "EventCode": "0x1F15E",
    "EventName": "PM_MWK_PWOBE_NOP_CMPW",
    "BwiefDescwiption": "Mawked pwobeNops compweted"
  },
  {
    "EventCode": "0x20018",
    "EventName": "PM_ST_FWD",
    "BwiefDescwiption": "Stowe fowwawds that finished"
  },
  {
    "EventCode": "0x1D142",
    "EventName": "PM_MWK_DATA_FWOM_W31_ECO_SHW_CYC",
    "BwiefDescwiption": "Duwation in cycwes to wewoad with Shawed (S) data fwom anothew cowe's ECO W3 on the same chip due to a mawked woad"
  },
  {
    "EventCode": "0x24042",
    "EventName": "PM_INST_FWOM_W3_MEPF",
    "BwiefDescwiption": "The pwocessow's Instwuction cache was wewoaded fwom wocaw cowe's W3 without dispatch confwicts hit on Mepf state. due to an instwuction fetch (not pwefetch)"
  },
  {
    "EventCode": "0x25046",
    "EventName": "PM_IPTEG_FWOM_WW2W3_MOD",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB with Modified (M) data fwom anothew chip's W2 ow W3 on the same Node ow Gwoup (Wemote), as this chip due to a instwuction side wequest"
  },
  {
    "EventCode": "0x3504A",
    "EventName": "PM_IPTEG_FWOM_WMEM",
    "BwiefDescwiption": "A Page Tabwe Entwy was woaded into the TWB fwom anothew chip's memowy on the same Node ow Gwoup ( Wemote) due to a instwuction side wequest"
  },
  {
    "EventCode": "0x3C05A",
    "EventName": "PM_CMPWU_STAWW_VDPWONG",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a scawaw muwti-cycwe instwuction issued to the Doubwe Pwecision execution pipe and waiting to finish. Incwudes binawy fwoating point instwuctions in 32 and 64 bit binawy fwoating point fowmat. Quawified by NOT vectow AND muwticycwe"
  },
  {
    "EventCode": "0x2E01C",
    "EventName": "PM_CMPWU_STAWW_TWBIE",
    "BwiefDescwiption": "Finish staww because the NTF instwuction was a twbie waiting fow wesponse fwom W2"
  }
]
