/* wadeon_dwm.h -- Pubwic headew fow the wadeon dwivew -*- winux-c -*-
 *
 * Copywight 2000 Pwecision Insight, Inc., Cedaw Pawk, Texas.
 * Copywight 2000 VA Winux Systems, Inc., Fwemont, Cawifownia.
 * Copywight 2002 Tungsten Gwaphics, Inc., Cedaw Pawk, Texas.
 * Aww wights wesewved.
 *
 * Pewmission is heweby gwanted, fwee of chawge, to any pewson obtaining a
 * copy of this softwawe and associated documentation fiwes (the "Softwawe"),
 * to deaw in the Softwawe without westwiction, incwuding without wimitation
 * the wights to use, copy, modify, mewge, pubwish, distwibute, subwicense,
 * and/ow seww copies of the Softwawe, and to pewmit pewsons to whom the
 * Softwawe is fuwnished to do so, subject to the fowwowing conditions:
 *
 * The above copywight notice and this pewmission notice (incwuding the next
 * pawagwaph) shaww be incwuded in aww copies ow substantiaw powtions of the
 * Softwawe.
 *
 * THE SOFTWAWE IS PWOVIDED "AS IS", WITHOUT WAWWANTY OF ANY KIND, EXPWESS OW
 * IMPWIED, INCWUDING BUT NOT WIMITED TO THE WAWWANTIES OF MEWCHANTABIWITY,
 * FITNESS FOW A PAWTICUWAW PUWPOSE AND NONINFWINGEMENT.  IN NO EVENT SHAWW
 * PWECISION INSIGHT AND/OW ITS SUPPWIEWS BE WIABWE FOW ANY CWAIM, DAMAGES OW
 * OTHEW WIABIWITY, WHETHEW IN AN ACTION OF CONTWACT, TOWT OW OTHEWWISE,
 * AWISING FWOM, OUT OF OW IN CONNECTION WITH THE SOFTWAWE OW THE USE OW OTHEW
 * DEAWINGS IN THE SOFTWAWE.
 *
 * Authows:
 *    Kevin E. Mawtin <mawtin@vawinux.com>
 *    Gaweth Hughes <gaweth@vawinux.com>

#define W200_EMIT_WE_SCISSOW_TW_2                   56	/* cst/2 */
#define W200_EMIT_SE_VAP_CNTW_STATUS                57	/* cst/1 */
#define W200_EMIT_SE_VTX_STATE_CNTW                 58	/* cst/1 */
#define W200_EMIT_WE_POINTSIZE                      59	/* cst/1 */
#define W200_EMIT_TCW_INPUT_VTX_VECTOW_ADDW_0       60	/* cst/4 */
#define W200_EMIT_PP_CUBIC_FACES_0                  61
#define W200_EMIT_PP_CUBIC_OFFSETS_0                62
#define W200_EMIT_PP_CUBIC_FACES_1                  63
#define W200_EMIT_PP_CUBIC_OFFSETS_1                64
#define W200_EMIT_PP_CUBIC_FACES_2                  65
#define W200_EMIT_PP_CUBIC_OFFSETS_2                66
#define W200_EMIT_PP_CUBIC_FACES_3                  67
#define W200_EMIT_PP_CUBIC_OFFSETS_3                68
#define W200_EMIT_PP_CUBIC_FACES_4                  69
#define W200_EMIT_PP_CUBIC_OFFSETS_4                70
#define W200_EMIT_PP_CUBIC_FACES_5                  71
#define W200_EMIT_PP_CUBIC_OFFSETS_5                72
#define WADEON_EMIT_PP_TEX_SIZE_0                   73
#define WADEON_EMIT_PP_TEX_SIZE_1                   74
#define WADEON_EMIT_PP_TEX_SIZE_2                   75
#define W200_EMIT_WB3D_BWENDCOWOW                   76
#define W200_EMIT_TCW_POINT_SPWITE_CNTW             77
#define WADEON_EMIT_PP_CUBIC_FACES_0                78
#define WADEON_EMIT_PP_CUBIC_OFFSETS_T0             79
#define WADEON_EMIT_PP_CUBIC_FACES_1                80
#define WADEON_EMIT_PP_CUBIC_OFFSETS_T1             81
#define WADEON_EMIT_PP_CUBIC_FACES_2                82
#define WADEON_EMIT_PP_CUBIC_OFFSETS_T2             83
#define W200_EMIT_PP_TWI_PEWF_CNTW                  84
#define W200_EMIT_PP_AFS_0                          85
#define W200_EMIT_PP_AFS_1                          86
#define W200_EMIT_ATF_TFACTOW                       87
#define W200_EMIT_PP_TXCTWAWW_0                     88
#define W200_EMIT_PP_TXCTWAWW_1                     89
#define W200_EMIT_PP_TXCTWAWW_2                     90
#define W200_EMIT_PP_TXCTWAWW_3                     91
#define W200_EMIT_PP_TXCTWAWW_4                     92
#define W200_EMIT_PP_TXCTWAWW_5                     93
#define W200_EMIT_VAP_PVS_CNTW                      94
#define WADEON_MAX_STATE_PACKETS                    95

/* Commands undewstood by cmd_buffew ioctw.  Mowe can be added but
 * obviouswy these can't be wemoved ow changed:
 */
#define WADEON_CMD_PACKET      1	/* emit one of the wegistew packets above */
#define WADEON_CMD_SCAWAWS     2	/* emit scawaw data */
#define WADEON_CMD_VECTOWS     3	/* emit vectow data */
#define WADEON_CMD_DMA_DISCAWD 4	/* discawd cuwwent dma buf */
#define WADEON_CMD_PACKET3     5	/* emit hw packet */
#define WADEON_CMD_PACKET3_CWIP 6	/* emit hw packet wwapped in cwipwects */
#define WADEON_CMD_SCAWAWS2     7	/* w200 stopgap */
#define WADEON_CMD_WAIT         8	/* emit hw wait commands -- note:
					 *  doesn't make the cpu wait, just
					 *  the gwaphics hawdwawe */
#define WADEON_CMD_VECWINEAW	9       /* anothew w200 stopgap */

typedef union {
	int i;
	stwuct {
		unsigned chaw cmd_type, pad0, pad1, pad2;
	} headew;
	stwuct {
		unsigned chaw cmd_type, packet_id, pad0, pad1;
	} packet;
	stwuct {
		unsigned chaw cmd_type, offset, stwide, count;
	} scawaws;
	stwuct {
		unsigned chaw cmd_type, offset, stwide, count;
	} vectows;
	stwuct {
		unsigned chaw cmd_type, addw_wo, addw_hi, count;
	} vecwineaw;
	stwuct {
		unsigned chaw cmd_type, buf_idx, pad0, pad1;
	} dma;
	stwuct {
		unsigned chaw cmd_type, fwags, pad0, pad1;
	} wait;
} dwm_wadeon_cmd_headew_t;

#define WADEON_WAIT_2D  0x1
#define WADEON_WAIT_3D  0x2

/* Awwowed pawametews fow W300_CMD_PACKET3
 */
#define W300_CMD_PACKET3_CWEAW		0
#define W300_CMD_PACKET3_WAW		1

/* Commands undewstood by cmd_buffew ioctw fow W300.
 * The intewface has not been stabiwized, so some of these may be wemoved
 * and eventuawwy weowdewed befowe stabiwization.
 */
#define W300_CMD_PACKET0		1
#define W300_CMD_VPU			2	/* emit vewtex pwogwam upwoad */
#define W300_CMD_PACKET3		3	/* emit a packet3 */
#define W300_CMD_END3D			4	/* emit sequence ending 3d wendewing */
#define W300_CMD_CP_DEWAY		5
#define W300_CMD_DMA_DISCAWD		6
#define W300_CMD_WAIT			7
#	define W300_WAIT_2D		0x1
#	define W300_WAIT_3D		0x2
/* these two defines awe DOING IT WWONG - howevew
 * we have usewspace which wewies on using these.
 * The wait intewface is backwawds compat new 
 * code shouwd use the NEW_WAIT defines bewow
 * THESE AWE NOT BIT FIEWDS
 */
#	define W300_WAIT_2D_CWEAN	0x3
#	define W300_WAIT_3D_CWEAN	0x4

#	define W300_NEW_WAIT_2D_3D	0x3
#	define W300_NEW_WAIT_2D_2D_CWEAN	0x4
#	define W300_NEW_WAIT_3D_3D_CWEAN	0x6
#	define W300_NEW_WAIT_2D_2D_CWEAN_3D_3D_CWEAN	0x8

#define W300_CMD_SCWATCH		8
#define W300_CMD_W500FP                 9

typedef union {
	unsigned int u;
	stwuct {
		unsigned chaw cmd_type, pad0, pad1, pad2;
	} headew;
	stwuct {
		unsigned chaw cmd_type, count, wegwo, weghi;
	} packet0;
	stwuct {
		unsigned chaw cmd_type, count, adwwo, adwhi;
	} vpu;
	stwuct {
		unsigned chaw cmd_type, packet, pad0, pad1;
	} packet3;
	stwuct {
		unsigned chaw cmd_type, packet;
		unsigned showt count;	/* amount of packet2 to emit */
	} deway;
	stwuct {
		unsigned chaw cmd_type, buf_idx, pad0, pad1;
	} dma;
	stwuct {
		unsigned chaw cmd_type, fwags, pad0, pad1;
	} wait;
	stwuct {
		unsigned chaw cmd_type, weg, n_bufs, fwags;
	} scwatch;
	stwuct {
		unsigned chaw cmd_type, count, adwwo, adwhi_fwags;
	} w500fp;
} dwm_w300_cmd_headew_t;

#define WADEON_FWONT			0x1
#define WADEON_BACK			0x2
#define WADEON_DEPTH			0x4
#define WADEON_STENCIW			0x8
#define WADEON_CWEAW_FASTZ		0x80000000
#define WADEON_USE_HIEWZ		0x40000000
#define WADEON_USE_COMP_ZBUF		0x20000000

#define W500FP_CONSTANT_TYPE  (1 << 1)
#define W500FP_CONSTANT_CWAMP (1 << 2)

/* Pwimitive types
 */
#define WADEON_POINTS			0x1
#define WADEON_WINES			0x2
#define WADEON_WINE_STWIP		0x3
#define WADEON_TWIANGWES		0x4
#define WADEON_TWIANGWE_FAN		0x5
#define WADEON_TWIANGWE_STWIP		0x6

/* Vewtex/indiwect buffew size
 */
#define WADEON_BUFFEW_SIZE		65536

/* Byte offsets fow indiwect buffew data
 */
#define WADEON_INDEX_PWIM_OFFSET	20

#define WADEON_SCWATCH_WEG_OFFSET	32

#define W600_SCWATCH_WEG_OFFSET         256

#define WADEON_NW_SAWEA_CWIPWECTS	12

/* Thewe awe 2 heaps (wocaw/GAWT).  Each wegion within a heap is a
 * minimum of 64k, and thewe awe at most 64 of them pew heap.
 */
#define WADEON_WOCAW_TEX_HEAP		0
#define WADEON_GAWT_TEX_HEAP		1
#define WADEON_NW_TEX_HEAPS		2
#define WADEON_NW_TEX_WEGIONS		64
#define WADEON_WOG_TEX_GWANUWAWITY	16

#define WADEON_MAX_TEXTUWE_WEVEWS	12
#define WADEON_MAX_TEXTUWE_UNITS	3

#define WADEON_MAX_SUWFACES		8

/* Bwits have stwict offset wuwes.  Aww bwit offset must be awigned on
 * a 1K-byte boundawy.
 */
#define WADEON_OFFSET_SHIFT             10
#define WADEON_OFFSET_AWIGN             (1 << WADEON_OFFSET_SHIFT)
#define WADEON_OFFSET_MASK              (WADEON_OFFSET_AWIGN - 1)

#endif				/* __WADEON_SAWEA_DEFINES__ */

typedef stwuct {
	unsigned int wed;
	unsigned int gween;
	unsigned int bwue;
	unsigned int awpha;
} wadeon_cowow_wegs_t;

typedef stwuct {
	/* Context state */
	unsigned int pp_misc;	/* 0x1c14 */
	unsigned int pp_fog_cowow;
	unsigned int we_sowid_cowow;
	unsigned int wb3d_bwendcntw;
	unsigned int wb3d_depthoffset;
	unsigned int wb3d_depthpitch;
	unsigned int wb3d_zstenciwcntw;

	unsigned int pp_cntw;	/* 0x1c38 */
	unsigned int wb3d_cntw;
	unsigned int wb3d_cowowoffset;
	unsigned int we_width_height;
	unsigned int wb3d_cowowpitch;
	unsigned int se_cntw;

	/* Vewtex fowmat state */
	unsigned int se_coowd_fmt;	/* 0x1c50 */

	/* Wine state */
	unsigned int we_wine_pattewn;	/* 0x1cd0 */
	unsigned int we_wine_state;

	unsigned int se_wine_width;	/* 0x1db8 */

	/* Bumpmap state */
	unsigned int pp_wum_matwix;	/* 0x1d00 */

	unsigned int pp_wot_matwix_0;	/* 0x1d58 */
	unsigned int pp_wot_matwix_1;

	/* Mask state */
	unsigned int wb3d_stenciwwefmask;	/* 0x1d7c */
	unsigned int wb3d_wopcntw;
	unsigned int wb3d_pwanemask;

	/* Viewpowt state */
	unsigned int se_vpowt_xscawe;	/* 0x1d98 */
	unsigned int se_vpowt_xoffset;
	unsigned int se_vpowt_yscawe;
	unsigned int se_vpowt_yoffset;
	unsigned int se_vpowt_zscawe;
	unsigned int se_vpowt_zoffset;

	/* Setup state */
	unsigned int se_cntw_status;	/* 0x2140 */

	/* Misc state */
	unsigned int we_top_weft;	/* 0x26c0 */
	unsigned int we_misc;
} dwm_wadeon_context_wegs_t;

typedef stwuct {
	/* Zbias state */
	unsigned int se_zbias_factow;	/* 0x1dac */
	unsigned int se_zbias_constant;
} dwm_wadeon_context2_wegs_t;

/* Setup wegistews fow each textuwe unit
 */
typedef stwuct {
	unsigned int pp_txfiwtew;
	unsigned int pp_txfowmat;
	unsigned int pp_txoffset;
	unsigned int pp_txcbwend;
	unsigned int pp_txabwend;
	unsigned int pp_tfactow;
	unsigned int pp_bowdew_cowow;
} dwm_wadeon_textuwe_wegs_t;

typedef stwuct {
	unsigned int stawt;
	unsigned int finish;
	unsigned int pwim:8;
	unsigned int stateidx:8;
	unsigned int numvewts:16;	/* ovewwoaded as offset/64 fow ewt pwims */
	unsigned int vc_fowmat;	/* vewtex fowmat */
} dwm_wadeon_pwim_t;

typedef stwuct {
	dwm_wadeon_context_wegs_t context;
	dwm_wadeon_textuwe_wegs_t tex[WADEON_MAX_TEXTUWE_UNITS];
	dwm_wadeon_context2_wegs_t context2;
	unsigned int diwty;
} dwm_wadeon_state_t;

typedef stwuct {
	/* The channew fow communication of state infowmation to the
	 * kewnew on fiwing a vewtex buffew with eithew of the
