[
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to woad DTWB misses to any page size.",
        "EventCode": "0x08",
        "EventName": "DTWB_WOAD_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to woads (incwuding SW pwefetches) whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size. Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "200003",
        "UMask": "0xe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to stowe DTWB misses to any page size.",
        "EventCode": "0x49",
        "EventName": "DTWB_STOWE_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to stowes whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size.  Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "2000003",
        "UMask": "0xe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks initiated by a instwuction fetch that missed the fiwst and second wevew TWBs.",
        "EventCode": "0x85",
        "EventName": "ITWB_MISSES.MISS_CAUSED_WAWK",
        "SampweAftewVawue": "1000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks due to an instwuction fetch that miss the PDE (Page Diwectowy Entwy) cache.",
        "EventCode": "0x85",
        "EventName": "ITWB_MISSES.PDE_CACHE_MISS",
        "SampweAftewVawue": "2000003",
        "UMask": "0x80"
    },
    {
        "BwiefDescwiption": "Counts the numbew of page wawks compweted due to instwuction fetch misses to any page size.",
        "EventCode": "0x85",
        "EventName": "ITWB_MISSES.WAWK_COMPWETED",
        "PubwicDescwiption": "Counts the numbew of page wawks compweted due to instwuction fetches whose addwess twanswations missed in aww Twanswation Wookaside Buffew (TWB) wevews and wewe mapped to any page size.  Incwudes page wawks that page fauwt.",
        "SampweAftewVawue": "200003",
        "UMask": "0xe"
    },
    {
        "BwiefDescwiption": "Counts the numbew of cycwes that the head (owdest woad) of the woad buffew and wetiwement awe both stawwed due to a DTWB miss.",
        "EventCode": "0x05",
        "EventName": "WD_HEAD.DTWB_MISS_AT_WET",
        "SampweAftewVawue": "1000003",
        "UMask": "0x90"
    }
]
