[
	{
		"Unit": "CPU-M-CF",
		"EventCode": "128",
		"EventName": "W1D_WO_EXCW_WWITES",
		"BwiefDescwiption": "W1D Wead-onwy Excwusive Wwites",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache whewe the wine was owiginawwy in a Wead-Onwy state in the cache but has been updated to be in the Excwusive state that awwows stowes to the cache wine."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "129",
		"EventName": "DTWB2_WWITES",
		"BwiefDescwiption": "DTWB2 Wwites",
		"PubwicDescwiption": "A twanswation has been wwitten into The Twanswation Wookaside Buffew 2 (TWB2) and the wequest was made by the Wevew-1 Data cache. This is a wepwacement fow what was pwovided fow the DTWB on z13 and pwiow machines."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "130",
		"EventName": "DTWB2_MISSES",
		"BwiefDescwiption": "DTWB2 Misses",
		"PubwicDescwiption": "A TWB2 miss is in pwogwess fow a wequest made by the Wevew-1 Data cache. Incwemented by one fow evewy TWB2 miss in pwogwess fow the Wevew-1 Data cache on this cycwe. This is a wepwacement fow what was pwovided fow the DTWB on z13 and pwiow machines."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "131",
		"EventName": "CWSTE_1MB_WWITES",
		"BwiefDescwiption": "One Megabyte CWSTE wwites",
		"PubwicDescwiption": "A twanswation entwy was wwitten into the Combined Wegion and Segment Tabwe Entwy awway in the Wevew-2 TWB fow a one-megabyte page."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "132",
		"EventName": "DTWB2_GPAGE_WWITES",
		"BwiefDescwiption": "DTWB2 Two-Gigabyte Page Wwites",
		"PubwicDescwiption": "A twanswation entwy fow a two-gigabyte page was wwitten into the Wevew-2 TWB."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "134",
		"EventName": "ITWB2_WWITES",
		"BwiefDescwiption": "ITWB2 Wwites",
		"PubwicDescwiption": "A twanswation entwy has been wwitten into the Twanswation Wookaside Buffew 2 (TWB2) and the wequest was made by the instwuction cache. This is a wepwacement fow what was pwovided fow the ITWB on z13 and pwiow machines."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "135",
		"EventName": "ITWB2_MISSES",
		"BwiefDescwiption": "ITWB2 Misses",
		"PubwicDescwiption": "A TWB2 miss is in pwogwess fow a wequest made by the Wevew-1 Instwuction cache. Incwemented by one fow evewy TWB2 miss in pwogwess fow the Wevew-1 Instwuction cache in a cycwe. This is a wepwacement fow what was pwovided fow the ITWB on z13 and pwiow machines."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "137",
		"EventName": "TWB2_PTE_WWITES",
		"BwiefDescwiption": "TWB2 Page Tabwe Entwy Wwites",
		"PubwicDescwiption": "A twanswation entwy was wwitten into the Page Tabwe Entwy awway in the Wevew-2 TWB."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "138",
		"EventName": "TWB2_CWSTE_WWITES",
		"BwiefDescwiption": "TWB2 Combined Wegion and Segment Entwy Wwites",
		"PubwicDescwiption": "Twanswation entwies wewe wwitten into the Combined Wegion and Segment Tabwe Entwy awway and the Page Tabwe Entwy awway in the Wevew-2 TWB."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "139",
		"EventName": "TWB2_ENGINES_BUSY",
		"BwiefDescwiption": "TWB2 Engines Busy",
		"PubwicDescwiption": "The numbew of Wevew-2 TWB twanswation engines busy in a cycwe."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "140",
		"EventName": "TX_C_TEND",
		"BwiefDescwiption": "Compweted TEND instwuctions in constwained TX mode",
		"PubwicDescwiption": "A TEND instwuction has compweted in a constwained twansactionaw-execution mode."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "141",
		"EventName": "TX_NC_TEND",
		"BwiefDescwiption": "Compweted TEND instwuctions in non-constwained TX mode",
		"PubwicDescwiption": "A TEND instwuction has compweted in a non-constwained twansactionaw-execution mode."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "143",
		"EventName": "W1C_TWB2_MISSES",
		"BwiefDescwiption": "W1C TWB2 Misses",
		"PubwicDescwiption": "Incwements by one fow any cycwe whewe a wevew-1 cache ow wevew-2 TWB miss is in pwogwess."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "145",
		"EventName": "DCW_WEQ",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "146",
		"EventName": "DCW_WEQ_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "147",
		"EventName": "DCW_WEQ_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Cache with Chip HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache aftew using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "148",
		"EventName": "DCW_WEQ_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Cache with Dwawew HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache aftew using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "149",
		"EventName": "DCW_ON_CHIP",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Chip Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "150",
		"EventName": "DCW_ON_CHIP_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Chip Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "151",
		"EventName": "DCW_ON_CHIP_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Chip Cache with Chip HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache aftew using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "152",
		"EventName": "DCW_ON_CHIP_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Chip Cache with Dwawew HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "153",
		"EventName": "DCW_ON_MODUWE",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Moduwe Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Moduwe Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "154",
		"EventName": "DCW_ON_DWAWEW",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Dwawew Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Dwawew Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "155",
		"EventName": "DCW_OFF_DWAWEW",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Off-Dwawew Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom an Off-Dwawew Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "156",
		"EventName": "DCW_ON_CHIP_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Chip Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Chip memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "157",
		"EventName": "DCW_ON_MODUWE_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Moduwe Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Moduwe memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "158",
		"EventName": "DCW_ON_DWAWEW_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom On-Dwawew Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Dwawew memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "159",
		"EventName": "DCW_OFF_DWAWEW_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Data Cache fwom Off-Dwawew Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data cache diwectowy whewe the wetuwned cache wine was souwced fwom Off-Dwawew memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "160",
		"EventName": "IDCW_ON_MODUWE_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Moduwe Memowy Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Moduwe Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "161",
		"EventName": "IDCW_ON_MODUWE_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Moduwe Memowy Cache with Chip Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Moduwe Wevew-2 cache using chip howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "162",
		"EventName": "IDCW_ON_MODUWE_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Moduwe Memowy Cache with Dwawew Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Moduwe Wevew-2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "163",
		"EventName": "IDCW_ON_DWAWEW_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Dwawew Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Dwawew Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "164",
		"EventName": "IDCW_ON_DWAWEW_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Dwawew Cache with Chip Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Dwawew Wevew-2 cache using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "165",
		"EventName": "IDCW_ON_DWAWEW_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom On-Dwawew Cache with Dwawew Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Dwawew Wevew-2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "166",
		"EventName": "IDCW_OFF_DWAWEW_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom Off-Dwawew Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an Off-Dwawew Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "167",
		"EventName": "IDCW_OFF_DWAWEW_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom Off-Dwawew Cache with Chip Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an Off-Dwawew Wevew-2 cache using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "168",
		"EventName": "IDCW_OFF_DWAWEW_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction and Data Cache fwom Off-Dwawew Cache with Dwawew Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Data ow Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an Off-Dwawew Wevew-2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "169",
		"EventName": "ICW_WEQ",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced the wequestows Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "170",
		"EventName": "ICW_WEQ_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "171",
		"EventName": "ICW_WEQ_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Cache with Chip HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "172",
		"EventName": "ICW_WEQ_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Cache with Dwawew HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom the wequestows Wevew-2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "173",
		"EventName": "ICW_ON_CHIP",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Chip Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "174",
		"EventName": "ICW_ON_CHIP_IV",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Chip Cache with Intewvention",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced an On-Chip Wevew-2 cache with intewvention."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "175",
		"EventName": "ICW_ON_CHIP_CHIP_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Chip Cache with Chip HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip Wevew-2 cache using chip wevew howizontaw pewsistence, Chip-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "176",
		"EventName": "ICW_ON_CHIP_DWAWEW_HIT",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Chip Cache with Dwawew HP Hit",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Chip wevew 2 cache using dwawew wevew howizontaw pewsistence, Dwawew-HP hit."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "177",
		"EventName": "ICW_ON_MODUWE",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Moduwe Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom an On-Moduwe Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "178",
		"EventName": "ICW_ON_DWAWEW",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Dwawew Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced an On-Dwawew Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "179",
		"EventName": "ICW_OFF_DWAWEW",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Off-Dwawew Cache",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced an Off-Dwawew Wevew-2 cache."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "180",
		"EventName": "ICW_ON_CHIP_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Chip Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Chip memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "181",
		"EventName": "ICW_ON_MODUWE_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Moduwe Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Moduwe memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "182",
		"EventName": "ICW_ON_DWAWEW_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom On-Dwawew Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom On-Dwawew memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "183",
		"EventName": "ICW_OFF_DWAWEW_MEMOWY",
		"BwiefDescwiption": "Diwectowy Wwite Wevew 1 Instwuction Cache fwom Off-Dwawew Memowy",
		"PubwicDescwiption": "A diwectowy wwite to the Wevew-1 Instwuction cache diwectowy whewe the wetuwned cache wine was souwced fwom Off-Dwawew memowy."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "224",
		"EventName": "BCD_DFP_EXECUTION_SWOTS",
		"BwiefDescwiption": "Binawy Coded Decimaw to Decimaw Fwoating Point convewsions",
		"PubwicDescwiption": "Count of fwoating point execution swots used fow finished Binawy Coded Decimaw to Decimaw Fwoating Point convewsions. Instwuctions: CDZT, CXZT, CZDT, CZXT."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "225",
		"EventName": "VX_BCD_EXECUTION_SWOTS",
		"BwiefDescwiption": "Count finished vectow awithmetic Binawy Coded Decimaw instwuctions",
		"PubwicDescwiption": "Count of fwoating point execution swots used fow finished vectow awithmetic Binawy Coded Decimaw instwuctions. Instwuctions: VAP, VSP, VMP, VMSP, VDP, VSDP, VWP, VWIP, VSWP, VPSOP, VCP, VTP, VPKZ, VUPKZ, VCVB, VCVBG, VCVD, VCVDG."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "226",
		"EventName": "DECIMAW_INSTWUCTIONS",
		"BwiefDescwiption": "Decimaw instwuction dispatched",
		"PubwicDescwiption": "Decimaw instwuction dispatched. Instwuctions: CVB, CVD, AP, CP, DP, ED, EDMK, MP, SWP, SP, ZAP."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "232",
		"EventName": "WAST_HOST_TWANSWATIONS",
		"BwiefDescwiption": "Wast host twanswation done",
		"PubwicDescwiption": "Wast Host Twanswation done"
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "244",
		"EventName": "TX_NC_TABOWT",
		"BwiefDescwiption": "Abowted twansactions in unconstwained TX mode",
		"PubwicDescwiption": "A twansaction abowt has occuwwed in a non-constwained twansactionaw-execution mode."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "245",
		"EventName": "TX_C_TABOWT_NO_SPECIAW",
		"BwiefDescwiption": "Abowted twansactions in constwained TX mode",
		"PubwicDescwiption": "A twansaction abowt has occuwwed in a constwained twansactionaw-execution mode and the CPU is not using any speciaw wogic to awwow the twansaction to compwete."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "246",
		"EventName": "TX_C_TABOWT_SPECIAW",
		"BwiefDescwiption": "Abowted twansactions in constwained TX mode using speciaw compwetion wogic",
		"PubwicDescwiption": "A twansaction abowt has occuwwed in a constwained twansactionaw-execution mode and the CPU is using speciaw wogic to awwow the twansaction to compwete."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "248",
		"EventName": "DFWT_ACCESS",
		"BwiefDescwiption": "Cycwes CPU spent obtaining access to Defwate unit",
		"PubwicDescwiption": "Cycwes CPU spent obtaining access to Defwate unit"
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "253",
		"EventName": "DFWT_CYCWES",
		"BwiefDescwiption": "Cycwes CPU is using Defwate unit",
		"PubwicDescwiption": "Cycwes CPU is using Defwate unit"
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "256",
		"EventName": "SOWTW",
		"BwiefDescwiption": "Count SOWTW instwuctions",
		"PubwicDescwiption": "Incwements by one fow evewy SOWT WISTS instwuction executed."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "265",
		"EventName": "DFWT_CC",
		"BwiefDescwiption": "Incwements DEFWATE CONVEWSION CAWW",
		"PubwicDescwiption": "Incwements by one fow evewy DEFWATE CONVEWSION CAWW instwuction executed."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "266",
		"EventName": "DFWT_CCFINISH",
		"BwiefDescwiption": "Incwements compweted DEFWATE CONVEWSION CAWW",
		"PubwicDescwiption": "Incwements by one fow evewy DEFWATE CONVEWSION CAWW instwuction executed that ended in Condition Codes 0, 1 ow 2."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "267",
		"EventName": "NNPA_INVOCATIONS",
		"BwiefDescwiption": "NNPA Totaw invocations",
		"PubwicDescwiption": "Incwements by one fow evewy Neuwaw Netwowk Pwocessing Assist instwuction executed."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "268",
		"EventName": "NNPA_COMPWETIONS",
		"BwiefDescwiption": "NNPA Totaw compwetions",
		"PubwicDescwiption": "Incwements by one fow evewy Neuwaw Netwowk Pwocessing Assist instwuction executed that ended in Condition Codes 0, 1 ow 2."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "269",
		"EventName": "NNPA_WAIT_WOCK",
		"BwiefDescwiption": "Cycwes spent obtaining NNPA wock",
		"PubwicDescwiption": "Cycwes CPU spent obtaining access to IBM Z Integwated Accewewatow fow AI."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "270",
		"EventName": "NNPA_HOWD_WOCK",
		"BwiefDescwiption": "Cycwes spent howding NNPA wock",
		"PubwicDescwiption": "Cycwes CPU is using IBM Z Integwated Accewewatow fow AI."
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "448",
		"EventName": "MT_DIAG_CYCWES_ONE_THW_ACTIVE",
		"BwiefDescwiption": "Cycwe count with one thwead active",
		"PubwicDescwiption": "Cycwe count with one thwead active"
	},
	{
		"Unit": "CPU-M-CF",
		"EventCode": "449",
		"EventName": "MT_DIAG_CYCWES_TWO_THW_ACTIVE",
		"BwiefDescwiption": "Cycwe count with two thweads active",
		"PubwicDescwiption": "Cycwe count with two thweads active"
	}
]
