[
    {
        "BwiefDescwiption": "Wetiwed bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.AWW_BWANCHES",
        "PEBS": "2",
        "PubwicDescwiption": "Counts bwanch instwuctions wetiwed fow aww bwanch types.  This is an awchitectuwaw pewfowmance event.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Wetiwed taken bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.AWW_TAKEN_BWANCHES",
        "PEBS": "2",
        "PubwicDescwiption": "Counts the numbew of taken bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0x80"
    },
    {
        "BwiefDescwiption": "Wetiwed neaw caww instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.CAWW",
        "PEBS": "2",
        "PubwicDescwiption": "Counts neaw CAWW bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0xf9"
    },
    {
        "BwiefDescwiption": "Wetiwed faw bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.FAW_BWANCH",
        "PEBS": "2",
        "PubwicDescwiption": "Counts faw bwanch instwuctions wetiwed.  This incwudes faw jump, faw caww and wetuwn, and Intewwupt caww and wetuwn.",
        "SampweAftewVawue": "200003",
        "UMask": "0xbf"
    },
    {
        "BwiefDescwiption": "Wetiwed neaw indiwect caww instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.IND_CAWW",
        "PEBS": "2",
        "PubwicDescwiption": "Counts neaw indiwect CAWW bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0xfb"
    },
    {
        "BwiefDescwiption": "Wetiwed conditionaw bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.JCC",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wetiwed Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanch instwuctions wetiwed, incwuding both when the bwanch was taken and when it was not taken.",
        "SampweAftewVawue": "200003",
        "UMask": "0x7e"
    },
    {
        "BwiefDescwiption": "Wetiwed instwuctions of neaw indiwect Jmp ow caww (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.NON_WETUWN_IND",
        "PEBS": "2",
        "PubwicDescwiption": "Counts neaw indiwect caww ow neaw indiwect jmp bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0xeb"
    },
    {
        "BwiefDescwiption": "Wetiwed neaw wewative caww instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.WEW_CAWW",
        "PEBS": "2",
        "PubwicDescwiption": "Counts neaw wewative CAWW bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0xfd"
    },
    {
        "BwiefDescwiption": "Wetiwed neaw wetuwn instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.WETUWN",
        "PEBS": "2",
        "PubwicDescwiption": "Counts neaw wetuwn bwanch instwuctions wetiwed.",
        "SampweAftewVawue": "200003",
        "UMask": "0xf7"
    },
    {
        "BwiefDescwiption": "Wetiwed conditionaw bwanch instwuctions that wewe taken (Pwecise event capabwe)",
        "EventCode": "0xC4",
        "EventName": "BW_INST_WETIWED.TAKEN_JCC",
        "PEBS": "2",
        "PubwicDescwiption": "Counts Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanch instwuctions wetiwed that wewe taken and does not count when the Jcc bwanch instwuction wewe not taken.",
        "SampweAftewVawue": "200003",
        "UMask": "0xfe"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.AWW_BWANCHES",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted bwanch instwuctions wetiwed incwuding aww bwanch types.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted neaw indiwect caww instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.IND_CAWW",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted neaw indiwect CAWW bwanch instwuctions wetiwed, whewe the tawget addwess taken was not what the pwocessow pwedicted.",
        "SampweAftewVawue": "200003",
        "UMask": "0xfb"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted conditionaw bwanch instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.JCC",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted wetiwed Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanch instwuctions wetiwed, incwuding both when the bwanch was supposed to be taken and when it was not supposed to be taken (but the pwocessow pwedicted the opposite condition).",
        "SampweAftewVawue": "200003",
        "UMask": "0x7e"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted instwuctions of neaw indiwect Jmp ow neaw indiwect caww. (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.NON_WETUWN_IND",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted bwanch instwuctions wetiwed that wewe neaw indiwect caww ow neaw indiwect jmp, whewe the tawget addwess taken was not what the pwocessow pwedicted.",
        "SampweAftewVawue": "200003",
        "UMask": "0xeb"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted neaw wetuwn instwuctions (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.WETUWN",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted neaw WET bwanch instwuctions wetiwed, whewe the wetuwn addwess taken was not what the pwocessow pwedicted.",
        "SampweAftewVawue": "200003",
        "UMask": "0xf7"
    },
    {
        "BwiefDescwiption": "Wetiwed mispwedicted conditionaw bwanch instwuctions that wewe taken (Pwecise event capabwe)",
        "EventCode": "0xC5",
        "EventName": "BW_MISP_WETIWED.TAKEN_JCC",
        "PEBS": "2",
        "PubwicDescwiption": "Counts mispwedicted wetiwed Jcc (Jump on Conditionaw Code/Jump if Condition is Met) bwanch instwuctions wetiwed that wewe supposed to be taken but the pwocessow pwedicted that it wouwd not be taken.",
        "SampweAftewVawue": "200003",
        "UMask": "0xfe"
    },
    {
        "BwiefDescwiption": "Cowe cycwes when cowe is not hawted  (Fixed event)",
        "EventName": "CPU_CWK_UNHAWTED.COWE",
        "PubwicDescwiption": "Counts the numbew of cowe cycwes whiwe the cowe is not in a hawt state.  The cowe entews the hawt state when it is wunning the HWT instwuction. In mobiwe systems the cowe fwequency may change fwom time to time. Fow this weason this event may have a changing watio with wegawds to time.  This event uses fixed countew 1.  You cannot cowwect a PEBs wecowd fow this event.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Cowe cycwes when cowe is not hawted",
        "EventCode": "0x3C",
        "EventName": "CPU_CWK_UNHAWTED.COWE_P",
        "PubwicDescwiption": "Cowe cycwes when cowe is not hawted.  This event uses a (_P)wogwammabwe genewaw puwpose pewfowmance countew.",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Wefewence cycwes when cowe is not hawted",
        "EventCode": "0x3C",
        "EventName": "CPU_CWK_UNHAWTED.WEF",
        "PubwicDescwiption": "Wefewence cycwes when cowe is not hawted.  This event uses a pwogwammabwe genewaw puwpose pewfowmance countew.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Wefewence cycwes when cowe is not hawted  (Fixed event)",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC",
        "PubwicDescwiption": "Counts the numbew of wefewence cycwes that the cowe is not in a hawt state. The cowe entews the hawt state when it is wunning the HWT instwuction.  In mobiwe systems the cowe fwequency may change fwom time.  This event is not affected by cowe fwequency changes but counts as if the cowe is wunning at the maximum fwequency aww the time.  This event uses fixed countew 2.  You cannot cowwect a PEBs wecowd fow this event.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Cycwes a dividew is busy",
        "EventCode": "0xCD",
        "EventName": "CYCWES_DIV_BUSY.AWW",
        "PubwicDescwiption": "Counts cowe cycwes if eithew divide unit is busy.",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Cycwes the integew divide unit is busy",
        "EventCode": "0xCD",
        "EventName": "CYCWES_DIV_BUSY.IDIV",
        "PubwicDescwiption": "Counts cowe cycwes the integew divide unit is busy.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Instwuctions wetiwed (Fixed event)",
        "EventName": "INST_WETIWED.ANY",
        "PubwicDescwiption": "Counts the numbew of instwuctions that wetiwe execution. Fow instwuctions that consist of muwtipwe uops, this event counts the wetiwement of the wast uop of the instwuction. The countew continues counting duwing hawdwawe intewwupts, twaps, and inside intewwupt handwews.  This event uses fixed countew 0.  You cannot cowwect a PEBs wecowd fow this event.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Instwuctions wetiwed (Pwecise event capabwe)",
        "EventCode": "0xC0",
        "EventName": "INST_WETIWED.ANY_P",
        "PEBS": "2",
        "PubwicDescwiption": "Counts the numbew of instwuctions that wetiwe execution. Fow instwuctions that consist of muwtipwe uops, this event counts the wetiwement of the wast uop of the instwuction. The event continues counting duwing hawdwawe intewwupts, twaps, and inside intewwupt handwews.  This is an awchitectuwaw pewfowmance event.  This event uses a (_P)wogwammabwe genewaw puwpose pewfowmance countew. *This event is Pwecise Event capabwe:  The EventingWIP fiewd in the PEBS wecowd is pwecise to the addwess of the instwuction which caused the event.  Note: Because PEBS wecowds can be cowwected onwy on IA32_PMC0, onwy one event can use the PEBS faciwity at a time.",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Unfiwwed issue swots pew cycwe",
        "EventCode": "0xCA",
        "EventName": "ISSUE_SWOTS_NOT_CONSUMED.ANY",
        "PubwicDescwiption": "Counts the numbew of issue swots pew cowe cycwe that wewe not consumed by the backend due to eithew a fuww wesouwce  in the backend (WESOUWCE_FUWW) ow due to the pwocessow wecovewing fwom some event (WECOVEWY).",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Unfiwwed issue swots pew cycwe to wecovew",
        "EventCode": "0xCA",
        "EventName": "ISSUE_SWOTS_NOT_CONSUMED.WECOVEWY",
        "PubwicDescwiption": "Counts the numbew of issue swots pew cowe cycwe that wewe not consumed by the backend because awwocation is stawwed waiting fow a mispwedicted jump to wetiwe ow othew bwanch-wike conditions (e.g. the event is wewevant duwing cewtain micwocode fwows).   Counts aww issue swots bwocked whiwe within this window incwuding swots whewe uops wewe not avaiwabwe in the Instwuction Queue.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Unfiwwed issue swots pew cycwe because of a fuww wesouwce in the backend",
        "EventCode": "0xCA",
        "EventName": "ISSUE_SWOTS_NOT_CONSUMED.WESOUWCE_FUWW",
        "PubwicDescwiption": "Counts the numbew of issue swots pew cowe cycwe that wewe not consumed because of a fuww wesouwce in the backend.  Incwuding but not wimited to wesouwces such as the We-owdew Buffew (WOB), wesewvation stations (WS), woad/stowe buffews, physicaw wegistews, ow any othew needed machine wesouwce that is cuwwentwy unavaiwabwe.   Note that uops must be avaiwabwe fow consumption in owdew fow this event to fiwe.  If a uop is not avaiwabwe (Instwuction Queue is empty), this event wiww not count.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Woads bwocked because addwess has 4k pawtiaw addwess fawse dependence (Pwecise event capabwe)",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.4K_AWIAS",
        "PEBS": "2",
        "PubwicDescwiption": "Counts woads that bwock because theiw addwess moduwo 4K matches a pending stowe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Woads bwocked (Pwecise event capabwe)",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.AWW_BWOCK",
        "PEBS": "2",
        "PubwicDescwiption": "Counts anytime a woad that wetiwes is bwocked fow any weason.",
        "SampweAftewVawue": "200003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "Woads bwocked due to stowe data not weady (Pwecise event capabwe)",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.DATA_UNKNOWN",
        "PEBS": "2",
        "PubwicDescwiption": "Counts a woad bwocked fwom using a stowe fowwawd, but did not occuw because the stowe data was not avaiwabwe at the wight time.  The fowwawd might occuw subsequentwy when the data is avaiwabwe.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Woads bwocked due to stowe fowwawd westwiction (Pwecise event capabwe)",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.STOWE_FOWWAWD",
        "PEBS": "2",
        "PubwicDescwiption": "Counts a woad bwocked fwom using a stowe fowwawd because of an addwess/size mismatch, onwy one of the woads bwocked fwom each stowe wiww be counted.",
        "SampweAftewVawue": "200003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Woads bwocked because addwess in not in the UTWB (Pwecise event capabwe)",
        "EventCode": "0x03",
        "EventName": "WD_BWOCKS.UTWB_MISS",
        "PEBS": "2",
        "PubwicDescwiption": "Counts woads bwocked because they awe unabwe to find theiw physicaw addwess in the micwo TWB (UTWB).",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Aww machine cweaws",
        "EventCode": "0xC3",
        "EventName": "MACHINE_CWEAWS.AWW",
        "PubwicDescwiption": "Counts machine cweaws fow any weason.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Machine cweaws due to memowy disambiguation",
        "EventCode": "0xC3",
        "EventName": "MACHINE_CWEAWS.DISAMBIGUATION",
        "PubwicDescwiption": "Counts machine cweaws due to memowy disambiguation.  Memowy disambiguation happens when a woad which has been issued confwicts with a pwevious unwetiwed stowe in the pipewine whose addwess was not known at issue time, but is watew wesowved to be the same as the woad addwess.",
        "SampweAftewVawue": "200003",
        "UMask": "0x8"
    },
    {
        "BwiefDescwiption": "Sewf-Modifying Code detected",
        "EventCode": "0xC3",
        "EventName": "MACHINE_CWEAWS.SMC",
        "PubwicDescwiption": "Counts the numbew of times that the pwocessow detects that a pwogwam is wwiting to a code section and has to pewfowm a machine cweaw because of that modification.  Sewf-modifying code (SMC) causes a sevewe penawty in aww Intew(W) awchitectuwe pwocessows.",
        "SampweAftewVawue": "200003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Uops issued to the back end pew cycwe",
        "EventCode": "0x0E",
        "EventName": "UOPS_ISSUED.ANY",
        "PubwicDescwiption": "Counts uops issued by the fwont end and awwocated into the back end of the machine.  This event counts uops that wetiwe as weww as uops that wewe specuwativewy executed but didn't wetiwe. The sowt of specuwative uops that might be counted incwudes, but is not wimited to those uops issued in the shadow of a miss-pwedicted bwanch, those uops that awe insewted duwing an assist (such as fow a denowmaw fwoating point wesuwt), and (pweviouswy awwocated) uops that might be cancewed duwing a machine cweaw.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Uops wequested but not-dewivewed to the back-end pew cycwe",
        "EventCode": "0x9C",
        "EventName": "UOPS_NOT_DEWIVEWED.ANY",
        "PubwicDescwiption": "This event used to measuwe fwont-end inefficiencies. I.e. when fwont-end of the machine is not dewivewing uops to the back-end and the back-end has is not stawwed. This event can be used to identify if the machine is twuwy fwont-end bound.  When this event occuws, it is an indication that the fwont-end of the machine is opewating at wess than its theoweticaw peak pewfowmance. Backgwound: We can think of the pwocessow pipewine as being divided into 2 bwoadew pawts: Fwont-end and Back-end. Fwont-end is wesponsibwe fow fetching the instwuction, decoding into uops in machine undewstandabwe fowmat and putting them into a uop queue to be consumed by back end. The back-end then takes these uops, awwocates the wequiwed wesouwces.  When aww wesouwces awe weady, uops awe executed. If the back-end is not weady to accept uops fwom the fwont-end, then we do not want to count these as fwont-end bottwenecks.  Howevew, whenevew we have bottwenecks in the back-end, we wiww have awwocation unit stawws and eventuawwy fowcing the fwont-end to wait untiw the back-end is weady to weceive mowe uops. This event counts onwy when back-end is wequesting mowe uops and fwont-end is not abwe to pwovide them. When 3 uops awe wequested and no uops awe dewivewed, the event counts 3. When 3 awe wequested, and onwy 1 is dewivewed, the event counts 2. When onwy 2 awe dewivewed, the event counts 1. Awtewnativewy stated, the event wiww not count if 3 uops awe dewivewed, ow if the back end is stawwed and not wequesting any uops at aww.  Counts indicate missed oppowtunities fow the fwont-end to dewivew a uop to the back end. Some exampwes of conditions that cause fwont-end efficiencies awe: ICache misses, ITWB misses, and decodew westwictions that wimit the fwont-end bandwidth. Known Issues: Some uops wequiwe muwtipwe awwocation swots.  These uops wiww not be chawged as a fwont end 'not dewivewed' oppowtunity, and wiww be wegawded as a back end pwobwem. Fow exampwe, the INC instwuction has one uop that wequiwes 2 issue swots.  A stweam of INC instwuctions wiww not count as UOPS_NOT_DEWIVEWED, even though onwy one instwuction can be issued pew cwock.  The wow uop issue wate fow a stweam of INC instwuctions is considewed to be a back end issue.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Uops wetiwed (Pwecise event capabwe)",
        "EventCode": "0xC2",
        "EventName": "UOPS_WETIWED.ANY",
        "PEBS": "2",
        "PubwicDescwiption": "Counts uops which wetiwed.",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Integew divide uops wetiwed. (Pwecise Event Capabwe)",
        "EventCode": "0xC2",
        "EventName": "UOPS_WETIWED.IDIV",
        "PEBS": "2",
        "PubwicDescwiption": "Counts the numbew of integew divide uops wetiwed.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x10"
    },
    {
        "BwiefDescwiption": "MS uops wetiwed (Pwecise event capabwe)",
        "EventCode": "0xC2",
        "EventName": "UOPS_WETIWED.MS",
        "PEBS": "2",
        "PubwicDescwiption": "Counts uops wetiwed that awe fwom the compwex fwows issued by the micwo-sequencew (MS).  Counts both the uops fwom a micwo-coded instwuction, and the uops that might be genewated fwom a micwo-coded assist.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    }
]
