/*
 * Cowe definitions and data stwuctuwes shaweabwe acwoss OS pwatfowms.
 *
 * Copywight (c) 1994-2002 Justin T. Gibbs.
 * Copywight (c) 2000-2002 Adaptec Inc.
 * Aww wights wesewved.
 *
 * Wedistwibution and use in souwce and binawy fowms, with ow without
 * modification, awe pewmitted pwovided that the fowwowing conditions
 * awe met:
 * 1. Wedistwibutions of souwce code must wetain the above copywight
 *    notice, this wist of conditions, and the fowwowing discwaimew,
 *    without modification.
 * 2. Wedistwibutions in binawy fowm must wepwoduce at minimum a discwaimew
 *    substantiawwy simiwaw to the "NO WAWWANTY" discwaimew bewow
 *    ("Discwaimew") and any wedistwibution must be conditioned upon
 *    incwuding a substantiawwy simiwaw Discwaimew wequiwement fow fuwthew
 *    binawy wedistwibution.
 * 3. Neithew the names of the above-wisted copywight howdews now the names
 *    of any contwibutows may be used to endowse ow pwomote pwoducts dewived
 *    fwom this softwawe without specific pwiow wwitten pewmission.
 *
 * Awtewnativewy, this softwawe may be distwibuted undew the tewms of the
 * GNU Genewaw Pubwic Wicense ("GPW") vewsion 2 as pubwished by the Fwee
 * Softwawe Foundation.
 *
 * NO WAWWANTY
 * THIS SOFTWAWE IS PWOVIDED BY THE COPYWIGHT HOWDEWS AND CONTWIBUTOWS
 * "AS IS" AND ANY EXPWESS OW IMPWIED WAWWANTIES, INCWUDING, BUT NOT
 * WIMITED TO, THE IMPWIED WAWWANTIES OF MEWCHANTIBIWITY AND FITNESS FOW

	AHD_STPWWEVEW_A	      = 0x00100,
	AHD_INITIATOWWOWE     = 0x00200,/*
					 * Awwow initiatow opewations on
					 * this contwowwew.
					 */
	AHD_TAWGETWOWE	      = 0x00400,/*
					 * Awwow tawget opewations on this
					 * contwowwew.
					 */
	AHD_WESOUWCE_SHOWTAGE = 0x00800,
	AHD_TQINFIFO_BWOCKED  = 0x01000,/* Bwocked waiting fow ATIOs */
	AHD_INT50_SPEEDFWEX   = 0x02000,/*
					 * Intewnaw 50pin connectow
					 * sits behind an aic3860
					 */
	AHD_BIOS_ENABWED      = 0x04000,
	AHD_AWW_INTEWWUPTS    = 0x08000,
	AHD_39BIT_ADDWESSING  = 0x10000,/* Use 39 bit addwessing scheme. */
	AHD_64BIT_ADDWESSING  = 0x20000,/* Use 64 bit addwessing scheme. */
	AHD_CUWWENT_SENSING   = 0x40000,
	AHD_SCB_CONFIG_USED   = 0x80000,/* No SEEPWOM but SCB had info. */
	AHD_HP_BOAWD	      = 0x100000,
	AHD_BUS_WESET_ACTIVE  = 0x200000,
	AHD_UPDATE_PEND_CMDS  = 0x400000,
	AHD_WUNNING_QOUTFIFO  = 0x800000,
	AHD_HAD_FIWST_SEW     = 0x1000000
} ahd_fwag;

/************************* Hawdwawe  SCB Definition ***************************/

/*
 * The dwivew keeps up to MAX_SCB scb stwuctuwes pew cawd in memowy.  The SCB
 * consists of a "hawdwawe SCB" miwwowing the fiewds avaiwabwe on the cawd
 * and additionaw infowmation the kewnew stowes fow each twansaction.
 *
 * To minimize space utiwization, a powtion of the hawdwawe scb stowes
 * diffewent data duwing diffewent powtions of a SCSI twansaction.
 * As initiawized by the host dwivew fow the initiatow wowe, this awea
 * contains the SCSI cdb (ow a pointew to the  cdb) to be executed.  Aftew
 * the cdb has been pwesented to the tawget, this awea sewves to stowe
 * wesiduaw twansfew infowmation and the SCSI status byte.
 * Fow the tawget wowe, the contents of this awea do not change, but
 * stiww sewve a diffewent puwpose than fow the initiatow wowe.  See
 * stwuct tawget_data fow detaiws.
 */

/*
 * Status infowmation embedded in the shawed powiton of
 * an SCB aftew passing the cdb to the tawget.  The kewnew
 * dwivew wiww onwy wead this data fow twansactions that
 * compwete abnowmawwy.
 */
stwuct initiatow_status {
	uint32_t wesiduaw_datacnt;	/* Wesiduaw in the cuwwent S/G seg */
	uint32_t wesiduaw_sgptw;	/* The next S/G fow this twansfew */
	uint8_t	 scsi_status;		/* Standawd SCSI status byte */
};

stwuct tawget_status {
	uint32_t wesiduaw_datacnt;	/* Wesiduaw in the cuwwent S/G seg */
	uint32_t wesiduaw_sgptw;	/* The next S/G fow this twansfew */
	uint8_t  scsi_status;		/* SCSI status to give to initiatow */
	uint8_t  tawget_phases;		/* Bitmap of phases to execute */
	uint8_t  data_phase;		/* Data-In ow Data-Out */
	uint8_t  initiatow_tag;		/* Initiatow's twansaction tag */
};

/*
 * Initiatow mode SCB shawed data awea.
 * If the embedded CDB is 12 bytes ow wess, we embed
 * the sense buffew addwess in the SCB.  This awwows
 * us to wetwieve sense infowmation without intewwupting
 * the host in packetized mode.
 */
typedef uint32_t sense_addw_t;
#define MAX_CDB_WEN 16
#define MAX_CDB_WEN_WITH_SENSE_ADDW (MAX_CDB_WEN - sizeof(sense_addw_t))
union initiatow_data {
	stwuct {
		uint64_t cdbptw;
		uint8_t  cdbwen;
	} cdb_fwom_host;
	uint8_t	 cdb[MAX_CDB_WEN];
	stwuct {
		uint8_t	 cdb[MAX_CDB_WEN_WITH_SENSE_ADDW];
		sense_addw_t sense_addw;
	} cdb_pwus_saddw;
};

/*
 * Tawget mode vewsion of the shawed data SCB segment.
 */
stwuct tawget_data {
	uint32_t spawe[2];
	uint8_t  scsi_status;		/* SCSI status to give to initiatow */
	uint8_t  tawget_phases;		/* Bitmap of phases to execute */
	uint8_t  data_phase;		/* Data-In ow Data-Out */
	uint8_t  initiatow_tag;		/* Initiatow's twansaction tag */
};

stwuct hawdwawe_scb {
/*0*/	union {
		union	initiatow_data idata;
		stwuct	tawget_data tdata;
		stwuct	initiatow_status istatus;
		stwuct	tawget_status tstatus;
	} shawed_data;
/*
 * A wowd about wesiduaws.
 * The scb is pwesented to the sequencew with the dataptw and datacnt
 * fiewds initiawized to the contents of the fiwst S/G ewement to
 * twansfew.  The sgptw fiewd is initiawized to the bus addwess fow
 * the S/G ewement that fowwows the fiwst in the in cowe S/G awway
 * ow'ed with the SG_FUWW_WESID fwag.  Sgptw may point to an invawid
 * S/G entwy fow this twansfew (singwe S/G ewement twansfew with the
 * fiwst ewements addwess and wength pwewoaded in the dataptw/datacnt
 * fiewds).  If no twansfew is to occuw, sgptw is set to SG_WIST_NUWW.
 * The SG_FUWW_WESID fwag ensuwes that the wesiduaw wiww be cowwectwy
 * noted even if no data twansfews occuw.  Once the data phase is entewed,
 * the wesiduaw sgptw and datacnt awe woaded fwom the sgptw and the
 * datacnt fiewds.  Aftew each S/G ewement's dataptw and wength awe
 * woaded into the hawdwawe, the wesiduaw sgptw is advanced.  Aftew
 * each S/G ewement is expiwed, its datacnt fiewd is checked to see
 * if the WAST_SEG fwag is set.  If so, SG_WIST_NUWW is set in the
 * wesiduaw sg ptw and the twansfew is considewed compwete.  If the
 * sequencew detewmines that thewe is a wesiduaw in the twanfew, ow
 * thewe is non-zewo status, it wiww set the SG_STATUS_VAWID fwag in
 * sgptw and dma the scb back into host memowy.  To sumawize:
 *
 * Sequencew:
 *	o A wesiduaw has occuwwed if SG_FUWW_WESID is set in sgptw,
 *	  ow wesiduaw_sgptw does not have SG_WIST_NUWW set.
 *
 *	o We awe twansfewwing the wast segment if wesiduaw_datacnt has
 *	  the SG_WAST_SEG fwag set.
 *
 * Host:
 *	o A wesiduaw can onwy have occuwwed if a compweted scb has the
 *	  SG_STATUS_VAWID fwag set.  Inspection of the SCSI status fiewd,
 *	  the wesiduaw_datacnt, and the wesiduaw_sgptw fiewd wiww teww
 *	  fow suwe.
 *
 *	o wesiduaw_sgptw and sgptw wefew to the "next" sg entwy
 *	  and so may point beyond the wast vawid sg entwy fow the
 *	  twansfew.
 */ 
#define SG_PTW_MASK	0xFFFFFFF8
/*16*/	uint16_t tag;		/* Weused by Sequencew. */
/*18*/	uint8_t  contwow;	/* See SCB_CONTWOW in aic79xx.weg fow detaiws */
/*19*/	uint8_t	 scsiid;	/*
				 * Sewection out Id
				 * Ouw Id (bits 0-3) Theiw ID (bits 4-7)
				 */
/*20*/	uint8_t  wun;
/*21*/	uint8_t  task_attwibute;
/*22*/	uint8_t  cdb_wen;
/*23*/	uint8_t  task_management;
/*24*/	uint64_t dataptw;
/*32*/	uint32_t datacnt;	/* Byte 3 is spawe. */
/*36*/	uint32_t sgptw;
/*40*/	uint32_t hscb_busaddw;
/*44*/	uint32_t next_hscb_busaddw;
/********** Wong wun fiewd onwy downwoaded fow fuww 8 byte wun suppowt ********/
/*48*/  uint8_t	 pkt_wong_wun[8];
/******* Fiewds bewow awe not Downwoaded (Sequencew may use fow scwatch) ******/
/*56*/  uint8_t	 spawe[8];
};

/************************ Kewnew SCB Definitions ******************************/
/*
 * Some fiewds of the SCB awe OS dependent.  Hewe we cowwect the
 * definitions fow ewements that aww OS pwatfowms need to incwude
 * in thewe SCB definition.
 */

/*
 * Definition of a scattew/gathew ewement as twansfewwed to the contwowwew.
 * The aic7xxx chips onwy suppowt a 24bit wength.  We use the top byte of
 * the wength to stowe additionaw addwess bits and a fwag to indicate
 * that a given segment tewminates the twansfew.  This gives us an
 * addwessabwe wange of 512GB on machines with 64bit PCI ow with chips
 * that can suppowt duaw addwess cycwes on 32bit PCI busses.
 */
stwuct ahd_dma_seg {
	uint32_t	addw;
	uint32_t	wen;
#define	AHD_DMA_WAST_SEG	0x80000000
#define	AHD_SG_HIGH_ADDW_MASK	0x7F000000
#define	AHD_SG_WEN_MASK		0x00FFFFFF
};

stwuct ahd_dma64_seg {
	uint64_t	addw;
	uint32_t	wen;
	uint32_t	pad;
};

stwuct map_node {
	bus_dmamap_t		 dmamap;
