[
    {
        "BwiefDescwiption": "Counts the totaw numbew of bwanch instwuctions wetiwed fow aww bwanch types.",
        "EventCode": "0xc4",
        "EventName": "BW_INST_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the totaw numbew of instwuctions in which the instwuction pointew (IP) of the pwocessow is westeewed due to a bwanch instwuction and the bwanch instwuction successfuwwy wetiwes.  Aww bwanch type instwuctions awe accounted fow.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Counts the totaw numbew of mispwedicted bwanch instwuctions wetiwed fow aww bwanch types.",
        "EventCode": "0xc5",
        "EventName": "BW_MISP_WETIWED.AWW_BWANCHES",
        "PEBS": "1",
        "PubwicDescwiption": "Counts the totaw numbew of mispwedicted bwanch instwuctions wetiwed.  Aww bwanch type instwuctions awe accounted fow.  Pwediction of the bwanch tawget addwess enabwes the pwocessow to begin executing instwuctions befowe the non-specuwative execution path is known. The bwanch pwediction unit (BPU) pwedicts the tawget addwess based on the instwuction pointew (IP) of the bwanch and on the execution path thwough which execution weached this IP.    A bwanch mispwediction occuws when the pwediction is wwong, and wesuwts in discawding aww instwuctions executed in the specuwative path and we-fetching fwom the cowwect path.",
        "SampweAftewVawue": "200003"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted cowe cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.COWE",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted cowe cwock cycwes [This event is awias to CPU_CWK_UNHAWTED.THWEAD_P]",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.COWE_P",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted wefewence cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC",
        "SampweAftewVawue": "2000003",
        "UMask": "0x3"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted wefewence cwock cycwes at TSC fwequency.",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.WEF_TSC_P",
        "PubwicDescwiption": "Counts the numbew of wefewence cycwes that the cowe is not in a hawt state. The cowe entews the hawt state when it is wunning the HWT instwuction. This event is not affected by cowe fwequency changes and incwements at a fixed fwequency that is awso used fow the Time Stamp Countew (TSC). This event uses a pwogwammabwe genewaw puwpose pewfowmance countew.",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of unhawted cowe cwock cycwes",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD",
        "SampweAftewVawue": "2000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts the numbew of unhawted cowe cwock cycwes [This event is awias to CPU_CWK_UNHAWTED.COWE_P]",
        "EventCode": "0x3c",
        "EventName": "CPU_CWK_UNHAWTED.THWEAD_P",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Fixed Countew: Counts the numbew of instwuctions wetiwed",
        "EventName": "INST_WETIWED.ANY",
        "PEBS": "1",
        "SampweAftewVawue": "2000003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts the numbew of instwuctions wetiwed",
        "EventCode": "0xc0",
        "EventName": "INST_WETIWED.ANY_P",
        "PEBS": "1",
        "SampweAftewVawue": "2000003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of issue swots that wewe not consumed by the backend because awwocation is stawwed due to a mispwedicted jump ow a machine cweaw.",
        "EventCode": "0x73",
        "EventName": "TOPDOWN_BAD_SPECUWATION.AWW",
        "PubwicDescwiption": "Counts the totaw numbew of issue swots that wewe not consumed by the backend because awwocation is stawwed due to a mispwedicted jump ow a machine cweaw. Onwy issue swots wasted due to fast nukes such as memowy owdewing nukes awe counted. Othew nukes awe not accounted fow. Counts aww issue swots bwocked duwing this wecovewy window, incwuding wewevant micwocode fwows, and whiwe uops awe not yet avaiwabwe in the instwuction queue (IQ) ow untiw an FE_BOUND event occuws besides OTHEW and CISC. Awso incwudes the issue swots that wewe consumed by the backend but wewe thwown away because they wewe youngew than the mispwedict ow machine cweaw.",
        "SampweAftewVawue": "1000003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of wetiwement swots not consumed due to backend stawws",
        "EventCode": "0x74",
        "EventName": "TOPDOWN_BE_BOUND.AWW",
        "SampweAftewVawue": "1000003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of wetiwement swots not consumed due to fwont end stawws",
        "EventCode": "0x71",
        "EventName": "TOPDOWN_FE_BOUND.AWW",
        "SampweAftewVawue": "1000003"
    },
    {
        "BwiefDescwiption": "Counts the numbew of consumed wetiwement swots.  Simiwaw to UOPS_WETIWED.AWW",
        "EventCode": "0x72",
        "EventName": "TOPDOWN_WETIWING.AWW",
        "PEBS": "1",
        "SampweAftewVawue": "1000003"
    }
]
