[
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 128 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_128",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x80",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 128 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "1009",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 16 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_16",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x10",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 16 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "20011",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 256 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_256",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x100",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 256 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "503",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 32 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_32",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x20",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 32 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "100007",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 4 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_4",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x4",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 4 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 512 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_512",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x200",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 512 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "101",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 64 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_64",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x40",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 64 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "2003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 8 cycwes.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.WOAD_WATENCY_GT_8",
        "MSWIndex": "0x3F6",
        "MSWVawue": "0x8",
        "PEBS": "2",
        "PubwicDescwiption": "Counts wandomwy sewected woads when the watency fwom fiwst dispatch to compwetion is gweatew than 8 cycwes.  Wepowted watency may be wongew than just the memowy watency.",
        "SampweAftewVawue": "50021",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Wetiwed memowy stowe access opewations. A PDist event fow PEBS Stowe Watency Faciwity.",
        "Data_WA": "1",
        "EventCode": "0xcd",
        "EventName": "MEM_TWANS_WETIWED.STOWE_SAMPWE",
        "PEBS": "2",
        "PubwicDescwiption": "Counts Wetiwed memowy accesses with at weast 1 stowe opewation. This PEBS event is the pwecisewy-distwibuted (PDist) twiggew covewing aww stowes uops fow sampwing by the PEBS Stowe Watency Faciwity. The faciwity is descwibed in Intew SDM Vowume 3 section 19.9.8",
        "SampweAftewVawue": "1000003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Counts demand data weads that wewe not suppwied by the wocaw socket's W1, W2, ow W3 caches.",
        "EventCode": "0x2A,0x2B",
        "EventName": "OCW.DEMAND_DATA_WD.W3_MISS",
        "MSWIndex": "0x1a6,0x1a7",
        "MSWVawue": "0x3FBFC00001",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Counts demand weads fow ownewship (WFO) wequests and softwawe pwefetches fow excwusive ownewship (PWEFETCHW) that wewe not suppwied by the wocaw socket's W1, W2, ow W3 caches.",
        "EventCode": "0x2A,0x2B",
        "EventName": "OCW.DEMAND_WFO.W3_MISS",
        "MSWIndex": "0x1a6,0x1a7",
        "MSWVawue": "0x3F3FC00002",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Numbew of times an WTM execution abowted.",
        "EventCode": "0xc9",
        "EventName": "WTM_WETIWED.ABOWTED",
        "PubwicDescwiption": "Counts the numbew of times WTM abowt was twiggewed.",
        "SampweAftewVawue": "100003",
        "UMask": "0x4"
    },
    {
        "BwiefDescwiption": "Numbew of times an WTM execution successfuwwy committed",
        "EventCode": "0xc9",
        "EventName": "WTM_WETIWED.COMMIT",
        "PubwicDescwiption": "Counts the numbew of times WTM commit succeeded.",
        "SampweAftewVawue": "100003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Numbew of times an WTM execution stawted.",
        "EventCode": "0xc9",
        "EventName": "WTM_WETIWED.STAWT",
        "PubwicDescwiption": "Counts the numbew of times we entewed an WTM wegion. Does not count nested twansactions.",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    },
    {
        "BwiefDescwiption": "Specuwativewy counts the numbew of TSX abowts due to a data capacity wimitation fow twansactionaw weads",
        "EventCode": "0x54",
        "EventName": "TX_MEM.ABOWT_CAPACITY_WEAD",
        "PubwicDescwiption": "Specuwativewy counts the numbew of Twansactionaw Synchwonization Extensions (TSX) abowts due to a data capacity wimitation fow twansactionaw weads",
        "SampweAftewVawue": "100003",
        "UMask": "0x80"
    },
    {
        "BwiefDescwiption": "Specuwativewy counts the numbew of TSX abowts due to a data capacity wimitation fow twansactionaw wwites.",
        "EventCode": "0x54",
        "EventName": "TX_MEM.ABOWT_CAPACITY_WWITE",
        "PubwicDescwiption": "Specuwativewy counts the numbew of Twansactionaw Synchwonization Extensions (TSX) abowts due to a data capacity wimitation fow twansactionaw wwites.",
        "SampweAftewVawue": "100003",
        "UMask": "0x2"
    },
    {
        "BwiefDescwiption": "Numbew of times a twansactionaw abowt was signawed due to a data confwict on a twansactionawwy accessed addwess",
        "EventCode": "0x54",
        "EventName": "TX_MEM.ABOWT_CONFWICT",
        "PubwicDescwiption": "Counts the numbew of times a TSX wine had a cache confwict.",
        "SampweAftewVawue": "100003",
        "UMask": "0x1"
    }
]
